{"id":205306,"name":"3M COMPANY","slug":"3m-company","state":"DC","description":"American multinational conglomerate corporation","totalSpending":1230000,"filings":16,"yearlySpending":[{"year":2020,"income":270000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2024,"income":250000},{"year":2025,"income":230000}],"firms":["THEGROUP DC, LLC"],"lobbyists":["DARREL THOMPSON","SUDAFI HENRY","KWABENA NSIAH","PAMELA THIESSEN","SAUL HERNANDEZ"],"issues":["MAN","TOR","BUD","CHM","TAX","TRD"],"sampleDescriptions":["Issues related to the manufacturing and liability of personal protection equipment","Issues related to the manufacturing and liability of personal protection equipment\nH.R. 4982 / S. 3372 - the Health Care Workforce Protection Act provisions related to the Public Readiness and Emergency Preparedness Act and provisions related to NIOSH approved respirators\nH.R. 6201, \"Families First Coronavirus Response Act\" provisions related to the Public Readiness and Emergency Preparedness Act and provisions related to personal respiratory protective devices\nH.R. 748, \" Coronavirus Aid, Relief, and Economic Security Act (CARES Act)\" provisions related to the Public Readiness and Emergency Preparedness Act and provisions related to personal respiratory protective devices","Issues related to the manufacturing and distribution of personal protection equipment.","Issues related to the manufacturing and distribution of personal protection equipment","Issues related to the manufacturing and distribution of personal protection equipment, and to pandemic response.","Hydrochlorofluorocarbons and perfluorinated chemicals issues, related proposals, generally.","Monitored hydrochlorofluorocarbons and perfluorinated chemicals issues, related proposals, generally.","Monitored issue related to the corporate tax rate and R&D.","Monitored and advocated on issues related to the corporate tax rate and R&D.","Monitored and tracked trade and tariff issues."],"years":[2020,2021,2022,2024,2025]}