{
  "id": 101944,
  "name": "ACA CONNECTS - AMERICA'S COMMUNICATION ASSOCIATION",
  "slug": "aca-connects-america-s-communication-association",
  "state": "PA",
  "description": null,
  "totalSpending": 3480000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 360000
    },
    {
      "year": 2019,
      "income": 600000
    },
    {
      "year": 2020,
      "income": 360000
    },
    {
      "year": 2021,
      "income": 360000
    },
    {
      "year": 2022,
      "income": 480000
    },
    {
      "year": 2023,
      "income": 480000
    },
    {
      "year": 2024,
      "income": 360000
    },
    {
      "year": 2025,
      "income": 480000
    }
  ],
  "firms": [
    "ALPINE GROUP PARTNERS, LLC."
  ],
  "lobbyists": [
    "RHOD SHAW",
    "ANSLEY ERDEL",
    "JARED WEAVER",
    "CURTIS PHILIP",
    "GRACE BELLONE",
    "ALISON GRAAB",
    "JENNIFER FORREST",
    "PATRICK SATALIN"
  ],
  "issues": [
    "COM",
    null,
    "BUD"
  ],
  "sampleDescriptions": [
    "Rural Broadband\nVideo Program Pricing\nUSF\nretransmission consent\nPole attachments\nNetwork Neutrality\nComm Act\nProgram Access \nset top box\nPrivacy\nMedia Ownership\nH.R. 3787, Small Entity Regulatory Relief Opportunity Act of 2017",
    "Rural Broadband\nVideo Program Pricing\nUSF\nretransmission consent\nPole attachments\nNetwork Neutrality\nPrivacy\nMedia Ownership\nH.R. 3787, Small Entity Regulatory Relief Opportunity Act of 2017\nMedia mergers",
    "Re-transmission consent \nNet Neutrality/open internet \nPrivacy legislation\nSatellite Home Viewer re-authorization",
    "Retransmission consent \nNet Neutrality/open internet \nPrivacy legislation\nSatellite Home Viewer re-authorization \nH.R. 946 Stopping Bad Robocalls Act",
    "Retransmission consent \nNet Neutrality/open internet \nPrivacy legislation\nSatellite Home Viewer re-authorization \nH.R. 946 Stopping Bad Robocalls Act\nC-Band",
    "Retransmission consent \nNet Neutrality/open internet \nPrivacy legislation\nSatellite Home Viewer re-authorization \nH.R. 946 Stopping Bad Robocalls Act\nC-Band\nH.R. 5035 Television Viewer Protection Act of 2019",
    "Retransmission consent \nNet Neutrality/open internet \nPrivacy legislation\nC-Band\nBroadband issues\nPolicies affecting cable and broadband providers due to the impact of COVID-19",
    "Retransmission consent \nNet Neutrality/open internet \nPrivacy legislation\nC-Band\nBroadband issues\nPolicies affecting cable and broadband providers due to the impact of COVID-19\nPolicies affecting 5G deployment",
    "Initiatives to impact cable and broadband deployment and adoption, including proposals in the COVID relief packages and broader infrastructure initiatives.",
    "Initiatives to impact cable and broadband deployment and adoption, including proposals in the COVID relief packages and broader infrastructure initiatives. \nPolicies related to broadband deployment\nBipartisan Infrastructure Deal",
    "Initiatives to impact cable and broadband deployment and adoption, including proposals in the COVID relief packages and broader infrastructure initiatives. Policies related to broadband deployment Infrastructure investment and Jobs Act",
    "Initiatives to impact cable and broadband deployment and adoption, including proposals in the COVID relief packages and broader infrastructure initiatives. Policies related to broadband deployment Infrastructure investment and Jobs Act Broadband mapping Permitting reform",
    "Implementation of BEAD program Future of the ACP program US supply chain matters affecting telecommunications equipment Policies impacting Multichannel Video Programming Distributors (MVPDs) FCC rule making impacting broadband providers Bulk Billing Order",
    "Funding and oversight related to broadband infrastructure deployment and affordability programs FY25 appropriations",
    "Implementation of BEAD program Future of the ACP program US supply chain matters affecting telecommunications equipment Policies impacting Multichannel Video Programming Distributors (MVPDs) FCC rule making impacting broadband providers Rule making and proceedings at the FTC impacting broadband providers Education regarding impacts of FCCs bulk-billing press announcement",
    "Funding and oversight related to broadband infrastructure deployment and affordability programs FY25 appropriations Oversight of FCC rulemakings",
    "Implementation of BEAD program Future of the ACP program US supply chain matters affecting telecommunications equipment Policies impacting Multichannel Video Programming Distributors (MVPDs) FCC rule making impacting broadband providers Rule making and proceedings at the FTC impacting broadband providers",
    "Funding and oversight related to broadband infrastructure deployment and affordability programs Oversight of FCC rulemakings",
    "Implementation of BEAD program Future of the ACP program US supply chain matters affecting telecommunications equipment Policies impacting Multichannel Video Programming Distributors (MVPDs) FCC rule making impacting broadband providers Rule making and proceedings at the FTC impacting broadband providers USF Reform",
    "Implementation of BEAD program US supply chain matters affecting telecommunications equipment Policies impacting Multichannel Video Programming Distributors (MVPDs) FCC rule making impacting broadband providers Rule making and proceedings at the FTC impacting broadband providers USF Reform"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 33,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 435000,
  "peakYear": 2019,
  "lobbyistCount": 8,
  "firmCount": 1,
  "issueCount": 2
}