{
  "id": 207603,
  "name": "ACADIA PHARMACEUTICALS, INC.",
  "slug": "acadia-pharmaceuticals-inc",
  "state": "CA",
  "description": "Biopharmaceutical company.",
  "totalSpending": 1360000,
  "filings": 17,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 320000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 160000
    }
  ],
  "firms": [
    "TIBER CREEK GROUP"
  ],
  "lobbyists": [
    "JONATHON JONES",
    "JOHN GONZALEZ",
    "ANDREW MCKECHNIE",
    "ASHLI PALMER",
    "BRYANT HALL",
    "COREY MALMGREN",
    "JOHN TWOMEY"
  ],
  "issues": [
    "HCR",
    "MMM",
    null,
    "TAX"
  ],
  "sampleDescriptions": [
    "Issues affecting the pharmaceutical industry.",
    "Issues related to the U.S. Food and Drug Administration (FDA); Issues related to drug pricing; Issues related to Medicare reform.",
    "Issues related to the U.S. Food and Drug Administration (FDA); Issues related to drug pricing; Issues related to nursing home quality measurement.",
    "Issues related to drug pricing in H.R. 5376 - the Build Back Better Act; Issues related to nursing home quality measurement.",
    "Issues related to drug pricing pricing reforms; Issues related to nursing home quality measurement and broader nursing home reforms.",
    "Issues related to drug pricing reforms; Issues related to nursing home quality measurement and broader nursing home reforms.",
    "Issues related to drug pricing pricing reforms; Issues related to nursing home quality measurement and broader nursing home reforms; Inflation Reduction Act of 2022 (PL 117-169).",
    "Issues related to drug pricing reforms; Issues related to nursing home quality measurement and broader nursing home reforms; Inflation Reduction Act of 2022 (PL 117-169).",
    "Issues related to drug pricing reforms; Issues related to nursing home quality measurement and broader nursing home reforms. Inflation Reduction Act of 2022 (PL 117-169). Issues related to prescription drugs and the Food and Drug Administration in Consolidated Appropriations Act, 2023 (PL 117-328).",
    "Issues related to drug pricing reforms; Issues related to nursing home quality measurement and broader nursing home reforms. Inflation Reduction Act of 2022 (PL 117-169).",
    "Issues related to drug pricing reforms; Implementation of the Inflation Reduction Act of 2022 (PL 117-169); Issues impacting rare disease treatments, including rare disease research incentives and the Creating Hope Reauthorization Act of 2024, H.R. 7384.",
    "Issues related to drug pricing reforms; Implementation of the Inflation Reduction Act of 2022 (PL 117-169).",
    "Issues impacting rare disease treatments, including rare disease research incentives, H.R.7384/S.4583 - Creating Hope Reauthorization Act of 2024, and H.R.3433 - Give Kids a Chance Act of 2024.",
    "Issues impacting rare disease treatments, including rare disease research incentives; H.R. 7384/S. 4583 - Creating Hope Reauthorization Act of 2024; H.R. 3433 - Give Kids a Chance Act of 2024; American Relief Act of 2025 (PL 118-158).",
    "Issues related to the orphan drug tax credit.",
    "Issues related to rare disease treatments, including rare disease research incentives; Issues related to H.R. 1262/S. 932 - Give Kids a Chance Act. Issues related to Medicaid changes in the One Big Beautiful Bill Act (PL 119-21).",
    "Issues related to rare disease treatments, including rare disease research incentives; Issues related to H.R. 1262/S. 932 - Give Kids a Chance Act; Issues related to Medicaid changes in the One Big Beautiful Bill Act (PL 119-21); Issues related to drug pricing reforms."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -50,
  "trajectory": "reducing",
  "yearsActive": 5,
  "avgAnnualSpending": 272000,
  "peakYear": 2021,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 3,
  "industry": "healthcare"
}