{"id":202249,"name":"ACHIEVE","slug":"achieve","state":"CA","description":"Consumer debt relief and lending","totalSpending":1697000,"filings":26,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":320000},{"year":2020,"income":320000},{"year":2021,"income":237000},{"year":2022,"income":200000},{"year":2024,"income":100000},{"year":2025,"income":200000}],"firms":["ALLON ADVOCACY, LLC"],"lobbyists":["STEVEN BOMS","REBECCA MULHOLLAND","KATHERINE FLOCKEN"],"issues":["FIN","BAN","TAX","BNK"],"sampleDescriptions":["Marketplace lending issues, including H.R. 3299, The Protecting Consumers' Access to Credit Act","H.R. 10, The Financial CHOICE Act, S. 2155, The Economic Growth, Regulatory Relief, and Consumer Protection Act, issues related to consumer unsecured debt settlement and marketplace lending","Monitoring of implementation of H.R. 1, an Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (monitored).","Issues related to consumer debt relief, debt settlement, and debt consolidation.","H.R. 10, The Economic Growth, Regulatory Relief, and Consumer Protection Act, issues related to consumer unsecured debt settlement and marketplace lending","Issues related to consumer debt relief, debt settlement and debt consolidation","Issues related to consumer unsecured debt settlement and marketplace lending","Marketplace lending issues","Issues related to consumer debt relief, debt settlement and debt consolidation for unsecured consumer debt.","Issues related to consumer debt relief, debt settlement and debt consolidation for unsecured consumer debt; H.R. 6201, the Families First Coronavirus Response Act; H.R. 748, The CARES Act","Issues related to consumer unsecured debt settlement","Issues related to consumer debt relief, debt settlement and debt consolidation for unsecured consumer debt; PL 116-136 and PL 116-123","Issues related to consumer debt relief, debt settlement, and debt consolidation for unsecured consumer debt; PL 116-136 and PL 116-123","Issues related to consumer unsecured debt settlement.","Issues related to consumer unsecured debt relief.","Issues related to student debt relief and unsecured consumer debt relief."],"years":[2018,2019,2020,2021,2022,2024,2025]}