{"id":136029,"name":"AIDS HEALTHCARE FOUNDATION","slug":"aids-healthcare-foundation","state":"CA","description":null,"totalSpending":1740000,"filings":29,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":120000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":180000}],"firms":["PARRY, ROMANI, DECONCINI & SYMMS"],"lobbyists":["ROMANO ROMANI","STEVE SYMMS","THADDEUS STROM","JAMES ROCK"],"issues":["MED","HCR","BAN","CSP","HOU","IMM","FOR",null],"sampleDescriptions":["Department of Labor, Health, Human Services, and Education, and Related Agencies Appropriations Act, FY 2018 - Support funding for medical treatments for HIV positive patients.","340B Drug Pricing Program.","340B Drug Pricing Program","Department of Labor, Health, Human Services, and Education, and Related Agencies.....Appropriations ACT, FY2018 - Support Funding for medical treatments for HIV positive patients.","Advocacy Regarding Middle Income Country Designation","To Address Pharmacy DIR fees in next CoVid19 package.\n\nH.R.1034 the Phair Drug Pricing Act of 2019.\nS640 the Phair Drug Pricing Act of 2019.\n\nS2543 Grassley/Wyden's Prescription Drug Pricing Reduction Act of 2019","To Address Pharmacy DIR fees in next CoVid19 package.\n\nAdd DIR report language to the Labor-HHS Appropriations Bill 2021\n\nS2543 Grassley/Wyden's Prescription Drug Pricing Reduction Act of 2019","To Address Pharmacy DIR fees in next CoVid19 package.\n\nH.R.1034/S.640, The Phair Pricing Act of 2019\n\nH.R. 7838- To provide for certain temporary waivers with respect to the 340B drug discount program due to COVID-19 public health emergency, and for other purposes.\n\nS.4160- A bill to enable certain hospitals that were participating in or applied for the drug discount program under section 340B of the Public Health Service Act prior to the COVID-19 public health emergency to temporarily maintain eligibility for such program, and for other purposes.\n\nS.2543 Grassley/Wyden's Prescription Drug Pricing Reduction Act of 2019\n\nExecutive Order on insulin and Epi-Pen","H.R. 133 Consolidated Appropriations Act to address pharmacy DIR fees. \n\nContacted House members urging to Co-Sign a Bipartisan Letter to HHS About Proposed Changes to the 340B Drug Discount Program.  \n\nContacted House members urging them to ask questions at the Oversight & Government Reform Committee Drug Pricing Hearing regarding the PhRMA initiatives  and 340B","Contacted offices to find out what is going on with PEPFAR.\n\nRequested that Ryan White clinics be used to administer vaccines.","Contacted the Senate regarding the Competition and Anti trust Law Enforcement Reform Act- The Antitrust problems posed by vertical integration and megafirms in the healthcare industry.","Discuss ways in which the federal government can help us and others create and offer desperately needed low income housing for people suffering from HIV, homelessness and the many other ills associated with abject poverty. Get both the Committee and the HHS Department to prioritize the Section 8 SRO program.","Contacted offices to support maintaining the 340B program and stop any legislation to curtail it.","PBMs (pharmacy benefit managers) pricing policy.","1.Contacted offices to support maintaining the 340B program and stop any legislation to curtail it.\n\n2. COVID access.","Check on USCIS case status.","1.Check on USCIS case status.\n\n2.Check on Visa application.","1.Contacted offices to support maintaining the 340B program and stop any legislation to curtail it.\n\n2. Urge Senators to sigh three letters to each of the major vaccine developers (Pfizer, Moderna and J&J) regarding barriers to global COVID vaccination efforts and implement additional strategies to expand access to vaccines.","1.Contacted offices to support maintaining the 340B program and stop any legislation to curtail it. 2.Urge Senators and Congresspersons to sigh three letters to each of the major vaccine developers (Pfizer, Moderna and J&J) regarding barriers to global COVID vaccination efforts and implement additional strategies to expand access to vaccines. 3.Contacted Senate to help get a meeting with the new head of HRSA which is the office within HHS that oversees the Ryan White program. 4. Contacted the Director of Health Resources and Services Administration to request a meeting to discuss data collection for the Ryan White program.","1. Ask Senators to help us get a meeting with the Office of Foreign Assets Control at the Treasury Department so that we can find a legal way to pay employees in Russia running afoul of US sanctions. 2. Contacted the Office of Foreign Assets Control Director to determine what steps AHF must take to ensure that it is compliant with U.S. sanctions on Russia."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}