{"id":109323,"name":"AIR CONDITIONING HEATING & REFRIGERATION INSTITUTE (FKA AIR CONDITIONING AND R)","slug":"air-conditioning-heating-refrigeration-institute-fka-air-conditioning-and-r","state":"VA","description":null,"totalSpending":2165000,"filings":26,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":180000},{"year":2020,"income":320000},{"year":2021,"income":400000},{"year":2022,"income":350000},{"year":2024,"income":440000},{"year":2025,"income":295000}],"firms":["BRACEWELL LLP"],"lobbyists":["ANNA KARAKITSOS","SCOTT SEGAL","JOHN LEE","LIAM DONOVAN","EDWARD KRENIK","TIM URBAN","DYLAN PASIUK","HOLT EDWARDS"],"issues":["ENG","CHM","DEF","CSP"],"sampleDescriptions":["Work related to energy legislation and energy efficiency issues","Advocacy related to various HFC legislative proposals","Advocacy related to DOD's use of VRF Systems","Advocacy related to various HFC legislative proposals; COVID-19 response issues; AIM Act","Work related to energy legislation and energy efficiency issues; COVID-19 response issues; AIM Act","Work related to energy legislation and energy efficiency issues; COVID-19 response issues; AIM Act; M1 transition compliance","Work related to energy legislation and energy efficiency issues; COVID-19 response issues; AIM Act implementation; M1 transition compliance; water heater efficiency guidelines; energy tax and infrastructure items, including the GREEN Act and Clean Energy for America Act","Advocacy related to various HFC legislative proposals; COVID-19 response issues; AIM Act implementation","Work related to energy legislation and energy efficiency issues; COVID-19 response issues; AIM Act implementation; M1 transition compliance; water heater efficiency guidelines; energy tax and infrastructure items, including the Inflation Reduction Act (H.R.5376)","Advocacy related to various HFC legislative proposals; COVID-19 response issues; AIM Act implementation; ratification of Kigali protocol","Work related to energy legislation and energy efficiency issues; AIM Act implementation; water heater efficiency guidelines; energy tax and infrastructure items, including the Inflation Reduction Act (HR 5376)implementation.","Advocacy related to AIM Act implementation","outreach and advocacy on gas furnace and boiler rule.","Work related to energy legislation and energy efficiency issues; AIM Act implementation; water heater efficiency guidelines; energy tax and infrastructure items, including the Inflation Reduction Act (HR 5376) implementation.","outreach and advocacy on gas furnace and boiler rule and related topics."],"years":[2018,2019,2020,2021,2022,2024,2025]}