{"id":186713,"name":"AIRBNB","slug":"airbnb","state":"CA","description":"Online marketplace for travel and tourism.","totalSpending":1420000,"filings":24,"yearlySpending":[{"year":2018,"income":100000},{"year":2019,"income":300000},{"year":2020,"income":240000},{"year":2021,"income":180000},{"year":2022,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":180000}],"firms":["KOUNTOUPES DENHAM CARR & REID, LLC"],"lobbyists":["JULIE CARR","MARY REID","DAVID PELUSO","ROSE SULLIVAN (LISTED IN ERROR)","LISA KOUNTOUPES","LORI DENHAM","MJ KENNY","ADAM HECHAVARRIA","CLAYTON HAYES","DENISE MOUSOURIS"],"issues":["TEC","ECN","TOU","HCR","DIS","BUD","CSP","FOR","TAX","SCI"],"sampleDescriptions":["Travel and tourism policy.","Issues related to policies that impact individuals with disabilities.","Issues related to federal disaster recovery.","Issues related to tourism and travel and the sharing economy. Issues related to privacy and platform liability.","Issues related to travel and tourism and the sharing economy.","Issues related to tourism and travel.","FY2020 funding provisions.","Issues related to tourism and travel and the sharing economy.  Issues related to privacy and platform liability.","Issues related to domestic and international travel and toursim and the sharing economy, and issues related to the West Bank.","Issues related to tourism and travel and the sharing economy.  Issues related to privacy and platform liability.  H. R. 4232, Protecting Local Authority and Neighborhoods (PLAN) Act.","Issues related to domestic and international travel and tourism and the sharing economy.","Issues related combating human trafficking.","Issues related to domestic and international travel and tourism.  Issues related to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including Small Business Administration loans and income provisions.","Issues related to federal disaster recovery. Issues related to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including Small Business Administration loans and income provisions.","Issues related to tourism and travel.  Issues related to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including Small Business Administration loans and income provisions.","Issues related to tourism and travel and the sharing economy.  Issues related to privacy and platform liability.  H. R. 4232, Protecting Local Authority and Neighborhoods (PLAN) Act.  S.3398, EARN IT Act of 2020.","Issues related to tourism and travel.  Issues related to PL 116-136, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including Small Business Administration loans and income provisions.","Issues related to tourism and travel and the sharing economy.  Issues related to platform liability.    S.3398, EARN IT Act of 2020.","Issues related to tourism and travel.  Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021, including Small Business Administration loans and income provisions.","Issues related to tech policy, data privacy, platform liability and antitrust."],"years":[2018,2019,2020,2021,2022,2024,2025]}