{"id":202279,"name":"AIRPORTS COUNCIL INTERNATIONAL - NORTH AMERICA","slug":"airports-council-international-north-america","state":"DC","description":"Trade association","totalSpending":1940000,"filings":25,"yearlySpending":[{"year":2018,"income":20000},{"year":2019,"income":240000},{"year":2020,"income":320000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":320000},{"year":2024,"income":240000},{"year":2025,"income":320000}],"firms":["HILL EAST GROUP, LLC"],"lobbyists":["BRAD GENTILE","ZACHARY HOWELL","ERIN O'CONNOR ELLIOTT","JOHN KATKO","TYLER GUTCHESS"],"issues":["TRA","AVI",null],"sampleDescriptions":["Issues related to transportation security issues and screening, Transportation Security Administration - H.R. 302, FAA Reauthorization Act of 2018 (Division K, Transportation Security).\n\nIssues related to TSA funding for existing programs - H.R. 6776/S.3109, Department of Homeland Security Appropriations Act, 2019; H.R. 695, Department of Defense Appropriations Act, 2018.","Issues related to transportation security issues and screening, Transportation Security Administration - H.R. 302, FAA Reauthorization Act of 2018 (Division K, Transportation Security).\n\nIssues related to airport infrastructure - no specific legislation.","Issues related to aviation and transportation security, funding for security operations at airports, Transportation and Security Administration, Customs and Border Protection, airport infrastructure and the Passenger Facility Charge (PFC) - no specific legislation.","Issues related to aviation and transportation security - no specific legislation. \nFunding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; airport infrastructure and the Passenger Facility Charge (PFC); environmental and firefighting provisions contained in H.R.2500 - National Defense Authorization Act for Fiscal Year 2020.","Issues related to aviation and transportation security, funding for security operations at airports, Transportation and Security Administration, Customs and Border Protection, airport infrastructure and the Passenger Facility Charge (PFC) - no specific legislation. \n\nIssues related to implementation of REAL ID Act of 2005 - no specific legislation. \n\nIssues related to unmanned aircraft systems (UAS) and security at airports - no specific legislation.","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation; airport infrastructure and the Passenger Facility Charge (PFC) - no specific legislation. \nIssues related to implementation of REAL ID Act of 2005 and H.R. 5827, the Trusted Traveler REAL ID Relief Act of 2020.\nAirport provisions contained in the CARES Act: S.3548, H.R.748.","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation; airport infrastructure projects: H.R. 2, the Moving Forward Act.\n\nIssues related to implementation of REAL ID Act of 2005 and H.R. 5827, the Trusted Traveler REAL ID Relief Act of 2020.\n\nAirport provisions contained in the CARES Act: S.3548, H.R.748.","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation; airport infrastructure projects - no specific legislation.\n\nIssues related to implementation of REAL ID Act of 2005 and H.R. 5827, the Trusted Traveler REAL ID Relief Act of 2020. \n\nAirport provisions, including airport payroll support funding: S.3548, H.R. 748, CARES Act.","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation; airport infrastructure projects - no specific legislation.\n\nIssues related to implementation of REAL ID Act of 2005 and H.R. 5827, the Trusted Traveler REAL ID Relief Act of 2020. \n\nIssues related to securing funding and support for airports during the COVID-19 crisis including H.R. 133 - United States-Mexico Economic Partnership Act (Consolidated Appropriations Act, 2021).","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation at airports; airport infrastructure financing issues; implementation of the airport provisions contained in the CARES Act, Pub. L. 116-136; implementation of related provisions in Consolidated Appropriations Act, 2021, Pub. L. 116-260; airport payroll support provisions contained in H.R. 1319 - American Recovery Plan Act of 2021.","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation at airports; airport infrastructure financing issues generally; implementation of the airport provisions contained in the CARES Act, Pub. L. 116-136; implementation of related provisions in Consolidated Appropriations Act, 2021, Pub. L. 116-260; airport payroll support provisions contained in H.R. 1319 - American Recovery Plan Act of 2021; H.R. 3340: The Transportation and Infrastructure Financing and Innovation Act for Airports;  H.R. 3213: the Expanding Private Airport Security Screening Act.","Issues related to aviation and transportation security; funding for security operations at airports, Transportation and Security Administration, and Customs and Border Protection; UAS mitigation at airports; airport infrastructure financing issues generally; implementation of the airport provisions contained in the CARES Act, Pub. L. 116-136; implementation of related provisions in Consolidated Appropriations Act, 2021, Pub. L. 116-260; airport payroll support provisions contained in H.R. 1319 - American Recovery Plan Act of 2021; H.R. 3340: The Transportation and Infrastructure Financing and Innovation Act for Airports;  H.R. 3213: the Expanding Private Airport Security Screening Act; airport funding included in H.R.3684 - Infrastructure Investment and Jobs Act; Trusted Traveler Reconsideration and Restoration Act (H.R. 473). HR 4094 - the One Stop Pilot Program Act; S.2717 the Funding for Aviation Screeners and Threat Elimination Restoration Act.","Issues related to aviation and transportation security; funding and appropriations for security operations at airports, issues related to Transportation and Security Administration, and Customs and Border Protection; UAS mitigation at airports; airport infrastructure financing issues generally; implementation of the airport provisions contained in the CARES Act: S.3548 and H.R. 133 - United States-Mexico Economic Partnership Act Consolidated Appropriations Act, 2021. H.R. 3340 - The Transportation and Infrastructure Financing and Innovation Act for Airports (entire legislation); airport funding included in H.R. 3684 - Infrastructure Investment and Jobs Act. Trusted Traveler Reconsideration and Restoration Act (H.R. 473) (entire legislation). HR 4094 - the One Stop Pilot Program Act (entire legislation). S.2717 the Funding for Aviation Screeners and Threat Elimination Restoration Act (entire legislation).","Issues related to disposal of PFAS-containing firefighting foam and replacement with PFAS-free alternatives within H.R. 7900 - National Defense Authorization Act for Fiscal Year 2023. Issues related to airports contained in H.R. 8294 - Transportation, Housing and Urban Development, Agriculture, Rural Development, Energy and Water Development, Financial Services and General Government, Interior, Environment, Military Construction, and Veterans Affairs Appropriations Act, 2023. Issues related to airport security contained in H.R. 8257 - Department of Homeland Security Appropriations Bill, 2023.","Issues related to aviation and transportation security; funding and appropriations for security operations at airports, issues related to Transportation and Security Administration, and Customs and Border Protection; UAS mitigation at airports; airport infrastructure financing issues generally; implementation of the airport provisions contained in the CARES Act: S.3548 and H.R. 133 - United States-Mexico Economic Partnership Act Consolidated Appropriations Act, 2021; H.R. 3340 - The Transportation and Infrastructure Financing and Innovation Act for Airports (entire legislation); airport funding included in H.R. 3684 - Infrastructure Investment and Jobs Act. Trusted Traveler Reconsideration and Restoration Act (H.R. 473) (entire legislation). HR 4094 - the One Stop Pilot Program Act (entire legislation).","Issues related to disposal of PFAS-containing firefighting foam and replacement with PFAS-free alternatives within: H.R. 7900 - National Defense Authorization Act for Fiscal Year 2023; S. 4543 - James M. Inhofe National Defense Authorization Act for FY 2023. Issues related to airports contained in H.R. 8294 - Transportation, Housing and Urban Development, Agriculture, Rural Development, Energy and Water Development, Financial Services and General Government, Interior, Environment, Military Construction, and Veterans Affairs Appropriations Act, 2023. Issues related to airport security contained in H.R. 8257 - Department of Homeland Security Appropriations Bill, 2023.","Issues related to aviation and transportation security; funding and appropriations for security operations at airports, issues related to Transportation Security Administration, and Customs and Border Protection; UAS mitigation at airports; airport infrastructure financing issues generally; implementation of the airport provisions contained in H.R. 3340 - The Transportation and Infrastructure Financing and Innovation Act for Airports (entire legislation); airport funding included in H.R. 3684 - Infrastructure Investment and Jobs Act; H.R. 437 - Trusted Traveler Reconsideration and Restoration Act; H.R. 4094 - the One Stop Pilot Program Act. S.2717 - FASTER Act. Cyber security issues impacting airports (no specific legislation).","Issues related to disposal of PFAS-containing firefighting foam and replacement with PFAS-free alternatives within: H.R. 7900 - National Defense Authorization Act for Fiscal Year 2023; S. 4543 - James M. Inhofe National Defense Authorization Act for FY 2023. Issues related to airports contained in H.R. 2617 - the Consolidated Appropriations Act, 2023.","Issues related to aviation worker screening; issues related to federal funding for airport infrastructure; issues related to reauthorization of the Federal Aviation Administration; issues related to aviation and transportation security contained in the FAA Reauthorization Act; funding and appropriations for security operations at airports; issues related to Transportation and Security Administration and funding of Customs and Border Protection; issues related to cybersecurity requirements for U.S. airports; issues related to the transitioning to the use of fluorine-free firefighting foam at American airports: H.R. 3935 - Securing Growth and Robust Leadership in American Aviation Act; H.R. 5969 - Improving Travel for Families Act; S. 1939, The FAA Reauthorization Act of 2023.","Issues related to the transitioning to the use of fluorine-free firefighting foam at American airports; issues related to the use of biometrics and facial recognition technology at American airports; domestic counter-drone authorities and security issues posed by drones: H.R. 8610, Counter-UAS Authority Security, Safety, and Reauthorization Act of 2024; S.1631, Safeguarding the Homeland from the Threats Posed by Unmanned Aircraft Systems Act of 2023."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}