{"id":123115,"name":"ALLIANCE FOR PHARMACY COMPOUNDING","slug":"alliance-for-pharmacy-compounding","state":"TX","description":"Non-profit association promoting the practice of pharmacy compounding","totalSpending":1320000,"filings":23,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":180000},{"year":2022,"income":230000},{"year":2024,"income":50000},{"year":2025,"income":200000}],"firms":["HANCE SCARBOROUGH"],"lobbyists":["JIM TURNER","MICHAEL TOMBERLIN","ROBERT PORE","THERESA REED"],"issues":["HCR","PHA","BUD"],"sampleDescriptions":["Issues related to the regulation of pharmacy compounding.  HR2871 Preserving Patient Access to Compounded Mediations Act","Issues related to the regulation of pharmacy compounding.  HR2871 Preserving Patient Access to Compounded Mediations Act.","Issues related to the regulation of pharmacy compounding.  HR 1959 Preserving Patient Access to Compounded Medications Act.","Issues related to the regulation of pharmacy compounding.  \n\nHR 1959 Preserving Patient Access to Compounded Medications Act.\n\nCARES Act H.R. 748","Issues related to the regulation of pharmacy compounding.\n\nIssues related to preserving patient access to compounded medications.\n\nFiscal Year 2022 Appropriations","Issues related to the regulation of pharmacy compounding.\n\nIssues related to preserving patient access to compounded medications.\n\nFiscal Year 2022 Appropriations\n\nHR3662, the Patient Access to Urgent Use Compounded Medication Act","Issues related to the regulation of pharmacy compounding. Issues related to preserving patient access to compounded medications. Fiscal Year 2022 Appropriations HR3662, the Patient Access to Urgent Use Compounded Medication Act","Issues related to the regulation of pharmacy compounding. Issues related to preserving patient access to compounded medications. Fiscal Year 2023 Appropriations HR3662, the Patient Access to Urgent Use Compounded Medication Act","Issues related to the regulation of pharmacy compounding. Issues related to preserving patient access to compounded medications. Fiscal Year 2025 Appropriations HR167, the Patient Access to Urgent Use Compounded Medication Act","Issues Related to the regulation of pharmacy compounding. Issues related to preserving patient access to compounded medications. Fiscal Year 2025 Appropriations. HR167, the Patient Access to Urgent Use Compounded Medication Act","Issues Related to the regulation of pharmacy compounding. Issues related to preserving patient access to compounded medications. Fiscal Year 2026 Appropriations. Drug Shortages","Issues Related to the regulation of pharmacy compounding. Issues related to preserving patient access to compounded medications. Fiscal Year 2026 Appropriations."],"years":[2018,2019,2020,2021,2022,2024,2025]}