{"id":198399,"name":"ALLIANCE FOR RURAL HOSPITAL ACCESS","slug":"alliance-for-rural-hospital-access","state":"DC","description":"Coalition of Rural Referral Centers and Sole Community Hospitals","totalSpending":2010000,"filings":31,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":250000},{"year":2022,"income":340000},{"year":2023,"income":240000},{"year":2024,"income":340000},{"year":2025,"income":280000}],"firms":["MCDERMOTT+ LLC"],"lobbyists":["ERIC ZIMMERMAN","ERICA STOCKER","PIPER NIETERS SU","RACHEL STAUFFER","MARGARET GILLEY","PRIYA RATHAKRISHNAN","JOSH JORGENSEN"],"issues":["MMM","PHA",null],"sampleDescriptions":["Medicare reimbursement for rural referral centers and sole community hospitals.","Amendments to Section 340B of the Public Health Service Act to gain eligibility for rural referral centers and sole community hospitals in the federal discount drug purchasing program.","Amendments to Section 340B of the Public Health Service Act regarding eligibility for rural referral centers and sole community hospitals in the federal discount drug purchasing program.","Medicare reimbursement for rural referral centers (RRCs), sole community hospitals (SCHs) and Medicare dependent hospitals (MDHs).","Issues relating to Medicare reimbursement for rural referral centers (RRCs), sole community hospitals (SCHs) and Medicare dependent hospitals (MDHs), including the Rural Hospital Support Act (H.R. 1887) and the RURAL HELP Act (H.R. 1749).","Amendments to Section 340B of the Public Health Service Act regarding eligibility for rural referral centers and sole community hospitals in the federal discount drug purchasing program, including the Closing Loopholes for Orphan Drugs Act (H.R. 853).","Issues relating to Medicare reimbursement for rural referral centers (RRCs), sole community hospitals (SCHs) and Medicare dependent hospitals (MDHs), including the Rural Hospital Support Act (H.R. 1887/S. 4009), the RURAL HELP Act (H.R. 1749), and the ARCH Act (H.R. 8747).","Issues relating to Medicare reimbursement for rural referral centers (RRCs), sole community hospitals (SCHs) and Medicare dependent hospitals (MDHs), including the Rural Hospital Support Act (S.1110) and the Assistance for Rural Community Hospitals Act (H.R. 6430).","Issues relating to Medicare reimbursement for rural referral centers (RRCs), sole community hospitals (SCHs) and Medicare dependent hospitals(MDHs), including the Rural Hospital Support Act (S.335) and the Assistance for Rural Community Hospitals Act (H.R.1805).","Amendments to Section 340B of the Public Health Service Act regarding eligibility for rural referral centers and sole community hospitals in thefederal discount drug purchasing program."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}