{"id":202186,"name":"ALLSTATE INSURANCE COMPANY","slug":"allstate-insurance-company","state":"DC","description":"Personal lines insurance.","totalSpending":1940000,"filings":33,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":320000},{"year":2025,"income":180000}],"firms":["FEDERAL HALL POLICY ADVISORS, LLC"],"lobbyists":["CLIFFORD ROBERTI","CHRISTOPHER MATTHIESEN","DOUGLAS NAPPI","KAROLINA ARIAS","SAATHVIK ALETY","KATIE PHILLIPS","BRIAN CONLAN"],"issues":["DIS","INS","ACC",null],"sampleDescriptions":["H.R. 4460, the Disaster Recovery and Relief Act (DRRA) and other issues related to disaster recover and mitigation.","Monitoring issues impacting domestic and international property and casualty insurance companies. \nH.R. 1422, Flood Insurance Market Parity and Modernization Act. \nH.R. 10, Financial CHOICE Act. \nH.R. 2874, 21st Century Flood Reform Act.\nH.R. 4537, International Insurance Standards Act \nH.R. 3861, Federal Insurance Office Reform Act  \nH.R.3746, Business of Insurance Regulatory Reform Act \nS. 2155,  Economic Growth, Regulatory Relief, and Consumer Protection Act","Issues related to The Financial Accounting Standards Board's standard setting process.","Issues related to insurance regulation - both domestic and internationally. Specific bills include: \nH.R. 1756 - Preventing Credit Score Discrimination in Auto Insurance Act","Issues related to mitigation and disaster planning","Issues related to FASB accounting standards.","Issues related to insurance regulation - both domestic and internationally, including H.R. 1756 - Preventing Credit Score Discrimination in Auto Insurance Act. Issues related to flood insurance, including H.R. 3111, the National Flood Insurance Program Administration Reform Act of 2019 and H.R. 3167, the National Flood Insurance Program Reauthorization Act of 2019","Issue related to accounting standards and potential impact on insurance companies.","Issues related to insurance underwriting. Issues related to distracted driving and drug-impaired driving. Issues impacting the state-based system of insurance regulation. Issues related to flood insurance and the National Flood Insurance Program.","Issues related to insurance underwriting. Issues related to distracted driving and drug-impaired driving. Issues impacting the state-based system of insurance regulation. Issues related to flood insurance and the National Flood Insurance Program. Issues related to insurance capital standards.","Issues related to insurance underwriting. Issues impacting the state-based system of insurance regulation. Issues related to flood insurance and the National Flood Insurance Program. Issues related to right to repair. Issues related to natural catastrophic risk.","Issues related to the regulation and supervision of insurance markets - both domestic and internationally."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}