{
  "id": 203229,
  "name": "ALTRIA CLIENT SERVICES",
  "slug": "altria-client-services",
  "state": "DC",
  "description": "Client services for parent company of manufactures tobacco products and wine.",
  "totalSpending": 1440000,
  "filings": 24,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 180000
    },
    {
      "year": 2020,
      "income": 120000
    },
    {
      "year": 2021,
      "income": 180000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "MARSHALL & POPP, LLC"
  ],
  "lobbyists": [
    "MONICA POPP",
    "HAZEN MARSHALL"
  ],
  "issues": [
    "TOB",
    "BUD",
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "Issues related to the regulation of tobacco products, tobacco excise taxes, corporate taxes, and Tobacco to 21 legislation.",
    "Issues related to the regulation of tobacco products, and Tobacco to 21 legislation.",
    "Issues related to the regulation of tobacco products.\n\nH.R.1865: Further Consolidated Appropriations Act, 2020 as it relates to Tobacco to 21 legislation.",
    "Issues related to the COVID-19 pandemic.\n\nH.R.6800: Health and Economic Recovery Omnibus Emergency Solutions Act (HEROES) Act.",
    "Issues related to the COVID-19 pandemic.\n\nIssues related to the regulation of tobacco products.\n\nH.R.2339: Protecting American Lungs and Reversing the Youth Tobacco Epidemic Act of 2020.",
    "Issues related to the COVID-19 pandemic.\n\nH.R.6800: Health and Economic Recovery Omnibus Emergency Solutions Act (HEROES) Act.\n\nS.4775: Delivering Immediate Relief to America's Families, Schools and Small Businesses Act.\n\nH.R.113 [116th]: Consolidated Appropriations Act, 2021.",
    "Issues related to the COVID-19 pandemic, including:\n\n*S.Con.Res. 5, fiscal year 2021 budget resolution.\n\n*H.R.1319: American Rescue Plan Act of 2021.",
    "Issues related to the COVID-19 pandemic.\n\nIssues related to the regulation of tobacco products.",
    "Issues related to the COVID-19 pandemic.",
    "Issues related to the COVID-19 pandemic.\n\nIssues related to the taxation of nicotine, including:\nBudget reconciliation recommendations reported by House committees pursuant to S.Con.Res. 14.",
    "Issues related to the COVID-19 pandemic. Issues related to the regulation of tobacco products.",
    "Issues related to the COVID-19 pandemic. Issues related to the taxation of nicotine, including: H.R.5376, the Build Back Better Act, and budget reconciliation recommendations released by Senate committees pursuant to S.Con.Res. 14.",
    "Issues related to the COVID-19 pandemic. Issues related to the taxation of nicotine, including: H.R.5376 - Inflation Reduction Act of 2022.",
    "Issues related to the COVID-19 pandemic. Issues related to the regulation of tobacco products. H.R. 2617, Consolidated Appropriations Act, 2023, issues related to FDA enforcement and regulation.",
    "Issues related to the COVID-19 pandemic. Issues related to the taxation of nicotine.",
    "Issues related to the COVID-19 pandemic. Issues related to the regulation of tobacco products. ANPRM for Docket No. FDA-2017-N-6189; HR. 2617, Consolidated Appropriations Act, 2023, provisions to fund enforcement to remove unauthorized tobacco products from the market.",
    "Issues related to the FDA regulation of tobacco products.",
    "Issues related to the taxation of nicotine.",
    "H.R.4368 / S. 2131 - Agriculture, Rural Development, FDA and related agencies Appropriations Act and H.R. 4366, FY2024 Consolidated Appropriations Act, issues related to regulating menthol and nicotine levels.",
    "Issues related to the FDA regulation of tobacco products. Issues related to tobacco harm reduction. Issues related to stopping the import and distribution of illegal electronic nicotine products."
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 33,
  "trajectory": "growing",
  "yearsActive": 7,
  "avgAnnualSpending": 205714,
  "peakYear": 2022,
  "lobbyistCount": 2,
  "firmCount": 1,
  "issueCount": 3
}