{"id":163117,"name":"AMERICAN FUEL AND PETROCHEMICAL MANUFACTURERS (AFPM)","slug":"american-fuel-and-petrochemical-manufacturers-afpm","state":"DC","description":"American trade assoc. that represents fuel & petrochemical mfr. in the petroleum Industry","totalSpending":2080000,"filings":26,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":320000},{"year":2020,"income":320000},{"year":2021,"income":240000},{"year":2022,"income":320000},{"year":2024,"income":240000},{"year":2025,"income":320000}],"firms":["CAPITOL TAX PARTNERS, LLP"],"lobbyists":["JACOB TRIOLO","JOSEPH MIKRUT","CAROLINE HARRIS","KATHERINE MONGE"],"issues":["TAX"],"sampleDescriptions":["Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018, and H.R. 1892, Bipartisan Budget Act of 2018.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018, and energy related tax issues.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018, energy related tax issues, H.R. 7065, Bill to amend the Internal Revenue Code of 1986 to establish a new phaseout of the credit for plug-in electric drive motor vehicles, and S. 3582, Bill to amend the Internal Revenue Code of 1986 to establish a new phaseout of the credit for plug-in electric vehicles.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the\nbudget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018, and energy related tax issues.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the\nbudget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018. Various energy related tax issues. S. 617, Tax Extender and Disaster Relief Act of 2019.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the\nbudget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018. Various energy related tax issues. H.R. 1865, Further Consolidated Appropriations Act, 2020.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018. Various energy related tax issues.","Tax issues related to tax reform including H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), S. 1, an original bill to provide for reconciliation pursuant to title II of the concurrent resolution on the budget for fiscal year 2018. Issues related to H.R. 2, the Moving Forward Act. Various energy related tax issues.","American Rescue Plan Act (HR 1319) and the Clean Energy for America Act.","The Clean Energy for America Act and H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14.","Energy issues related to H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14.","Energy issues related to H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14. Additionally, issues regarding the implementation of the Infrastructure Investment and Jobs Act, P.L. 117-58.","Energy issues related to H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14 and H.R. 1, 2025 Budget Reconciliation Bill.","Energy issues related to H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14 and P.L. 119-21."],"years":[2018,2019,2020,2021,2022,2024,2025]}