{"id":169812,"name":"AMERICAN PETROLEUM INSTITUTE (API)","slug":"american-petroleum-institute-api","state":"DC","description":"National trade association representing all facets of the natural gas and oil industry.","totalSpending":1960000,"filings":18,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":405000},{"year":2020,"income":460000},{"year":2021,"income":315000},{"year":2022,"income":525000},{"year":2024,"income":75000}],"firms":["CGCN GROUP, LLC"],"lobbyists":["STEVE CLARK","SAM GEDULDIG","JAY CRANFORD","MIKE NIELSEN","DOUGLAS SCHWARTZ","JOHN STIPICEVIC","KATIE MITCHELL","MICHAEL FREEMAN","JULIANE SULLIVAN","AARON SZABO","ALEX RENJEL","SCOTT RIPLINGER","AMBER KIRCHHOEFER","TIM PATAKI"],"issues":["ENG","FUE","ENV","CAW","TRD","TAX","MAR"],"sampleDescriptions":["Issue affecting the upstream, midstream, and downstream sectors of the oil and gas industry.","Renewable Fuel Standard; EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry.","Renewable Fuel Standard; Issues related to the use of Nationwide Permits for the oil and gas industry; Coast Guard re-authorization; Issues related to COVID-19; including the change in demand for oil and natural gas; Chinas international trade commitments with respect to energy and other related international issues; NDAA.","Chinas international trade commitments with respect to energy and other related international issues.","Renewable Fuel Standard; EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry; Issues related to the use of Nationwide Permits for the oil and gas industry; CEQs final NEPA regulations; PFAS legislative proposals; Issues related to COVID-19, including the change in demand for oil and natural gas; NDAA","Renewable Fuel Standard.","Renewable Fuel Standard; EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry; Issues related to the use of Nationwide Permits for the oil and gas industry; PFAS legislative proposals; Issues related to COVID-19, including the change in demand for oil and natural gas; NDAA","Renewable Fuel Standard; EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry; Issues related to the use of Nationwide Permits for the oil and gas industry; PFAS legislative proposals; Issues related to COVID-19, including the change in demand for oil and natural gas.","Renewable Fuel Standard; Issues related to the use of Nationwide Permits for the oil and gas industry; Issues related to COVID-19; including the change in demand for oil and natural gas; Chinas international trade commitments with respect to energy and other related international issues.","International trade commitments with respect to energy and other related international issues.","Issues related to taxation of methane.","Issues related to COVID-19; including the change in demand for oil and natural gas; International trade commitments with respect to energy and other related international issues.","EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry; PFAS legislative proposals; Issues related to COVID-19, including the change in demand for oil and natural gas.","EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry.","Issues related to COVID-19; including the change in demand for oil and natural gas; international trade commitments with respect to energy and other related international issues; H.R. 4350 National Defense Authorization Act for Fiscal Year 2022 (provisions relating to the energy industry and sanctions policy); H.R. 5376 Build Back Better Act.","Issues related to COVID-19; international trade commitments with respect to energy and other related international issues; H.R. 4350 National Defense Authorization Act for Fiscal Year 2022 (provisions relating to the energy industry and sanctions policy); H.R. 5376 Build Back Better Act.","Issues related to COVID-19; international trade commitments with respect to energy and other related international issues; H.R. 7900 National Defense Authorization Act for Fiscal Year 2023 (provisions relating to the energy industry and sanctions policy); H.R. 5376 Build Back Better Act.","H.R.6865, Coast Guard Authorization Act of 2022, specifically manning and crew provisions.","International trade commitments with respect to energy and other related international issues; H.R. 7900 National Defense Authorization Act for Fiscal Year 2023 (provisions relating to the energy industry and sanctions policy).","EPAs regulation of greenhouse gases and other conventional air pollutants related to the oil and gas industry; PFAS legislative proposals."],"years":[2018,2019,2020,2021,2022,2024]}