{"id":194383,"name":"AMERICAN AIRLINES INC","slug":"american-airlines-inc","state":"DC","description":"Commercial air carrier","totalSpending":1330000,"filings":24,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":150000},{"year":2020,"income":140000},{"year":2021,"income":200000},{"year":2022,"income":260000},{"year":2024,"income":140000},{"year":2025,"income":280000}],"firms":["EMPIRE CONSULTING GROUP"],"lobbyists":["MIKE MCKAY","CHAKA BURGESS","LAVITA LEGRYS","E. GARRETT","EBONY MEEKS-LAIDLEY","BRIAN GREER","INDHIRA MOJICA","MIKE MULLEN","MICHAEL HAYES"],"issues":["AVI","TAR"],"sampleDescriptions":["FAA Reauthorization; passenger facility charges; Fair Fees Act; Continuing Resolution for 2018(provisions related to commercial aviation); Consolidated Appropriations Act of 2018 (provisions related to commercial aviation); and economic, operational and management performance of American Airlines Group.","FAA Reauthorization; passenger facility charges; Fair Fees Act; labor issues relating to the Communications Workers of America; and other issues relating to the economic, operational and management performance of American Airlines Group.","Passenger facility charges; other issues relating to the economic, operational and management performance of American Airlines Group.","Passenger facility charges (PFC); airport infrastructure; American Airlines/Quantas antitrust immunity; issues relating to aircraft safety and certification processes; economic, operational and management performance of American Airlines.","Passenger facility charges (PFC); airport infrastructure; issues related to aircraft safety and certification processes; labor-management relations.","EU-Airbus tariffs","Passenger facility charges (PFC); issues related to aviation safety and certification processes; tax extenders relating to aviation; economic, operational and management performance of American Airlines Inc.","Passenger facility charges (PFC); issues related to aviation safety; Coronavirus Aid, Relief and Economic Security Act (CARES Act) provisions pertaining to aviation industry; and the economic, operational and management performance of American Airlines Inc.","Issues and proposals related to COVID-19 impacting the aviation industry; S.3730-Registered Travelers Act of 2020; TSA temperature checks; issues related to aviation safety; HR 2-Investing in a New Vision for the Environment & Surface Transportation Act (\"Moving Forward Act\"); and the economic, operational and management performance of American Airlines.","Issues and proposals related to COVID-19 impacting the aviation industry including Payroll Support Program; and the economic, operational and management performance of American Airlines.","American Rescue Plan Act of 2021-Payment Support Program; COVID-19 Domestic Air Travel Testing Requirements; and the economic, operational, and management performance of American Airlines.","American Rescue Plan Act of 2021-Payment Support Program; issues related to COVID-19; infrastructure proposals and issues; antitrust issues pertaining to the JetBlue/American Airlines partnership; and the economic, operational, and management performance of American Airlines.","American Rescue Plan Act of 2021-Payment Support Program; issues related to COVID-19, including OSHA mandate for Federal contractors/private sector employers; antitrust issues pertaining to the JetBlue/American Airlines partnership; corporate taxation; and the economic, operational, and management performance of American Airlines.","Issues related to COVID-19; antitrust issues pertaining to the JetBlue/American Airlines partnership; international slots relief; and the economic, operational, and management performance of American Airlines.","Pre-departure testing requirements; antitrust issues pertaining to the JetBlue/American Airlines NEA partnership; Registered Traveler's Act; and the economic, operational, and management performance of American Airlines.","Inflation Reduction Act; antitrust issues pertaining to the JetBlue/American Airlines NEA partnership; Registered Traveler's Act; Continuing Resolution; and the economic, operational, and management performance of American Airlines.","Antitrust issues pertaining to the JetBlue/American Airlines NEA partnership; Omnibus legislation; and the economic, operational, and management performance of American Airlines.","Issues pertaining to Homeland Security/TSA & airport screening. Ongoing labor negotiation issues/NMB. Part 135-380 operations. Issues related to charter flights. Issues related to the economic, operational, and management performance of American Airlines.","Issues pertaining to Homeland Security/TSA & airport screening. Ongoing labor negotiation issues/NMB. Part 135- 380 operations. Issues related to charter flights. Competition & consumer issues. Issues related to the economic, operational, and management performance of American Airlines.","Safety issues at DCA pertaining to military aircraft & commercial aviation. International trade issues. Issues related to the economic, operational, and management performance of American Airlines."],"years":[2018,2019,2020,2021,2022,2024,2025]}