{
  "id": 112997,
  "name": "AMERICAN SHORT LINE & REGIONAL RAILROAD ASSOCIATION",
  "slug": "american-short-line-regional-railroad-association",
  "state": "DC",
  "description": null,
  "totalSpending": 1400000,
  "filings": 12,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 600000
    },
    {
      "year": 2019,
      "income": 600000
    },
    {
      "year": 2020,
      "income": 150000
    },
    {
      "year": 2021,
      "income": 50000
    }
  ],
  "firms": [
    "CHAMBERS, CONLON & HARTWELL, LLC"
  ],
  "lobbyists": [
    "DONALD NORDEN",
    "CHUCK BAKER",
    "KATIE KACHEL",
    "ED MCKECHNIE",
    "MARA STARK-ALCALA",
    "WILL RESCH",
    "CHANNON HANNA",
    "RYAN SOLT",
    "JACOB CARTER",
    "SNJEZANA ARTHUR",
    "ERIN DELANEY",
    "RICHARD SHERMAN"
  ],
  "issues": [
    "TAX",
    "RRR",
    "BUD"
  ],
  "sampleDescriptions": [
    "Support for H.R. 721 and S. 406 - Building Rail Access for Customers and the Economy Act. Support for inclusion of extension of tax credit provisions in P.L. 115-141.",
    "Post-enactment implementation and rulemaking following the Moving Ahead for Progress in the 21st Century Act (PL 112-141) and Fixing Americas Surface Transportation Act (PL 114-94, FAST) including: railroad funding, regulation, and safety provisions; authorizations for national transportation grants, freight rail grants; Positive Train Control implementation deadlines, requirements, and federal rules. Support for funding in FY2018 THUD Appropriations (H.R.3353, H.R.3354, H.Rept. 115-237, S.1655, S.Rept 115-138, H.R. 1625, P.L. 115-141) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 721 and S. 406. Implementation of Positive train control provisions in Railroad Safety and Positive Train Control Extension Act and Surface Transportation Extension Act of 2015 PL 114-73. Congressional outreach and education on issues pending before the Surface Transportation Board. Support for nominees and potential nominees for administrative positions at USDOT and STB. Support for regulatory streamlining and improvement legislation (RAILS Act, S.1451).",
    "Post-enactment implementation and rulemaking following the Fixing Americas Surface Transportation Act (PL 114-94, FAST) including: railroad funding, regulation, and safety provisions; authorizations for national transportation grants, freight rail grants; Positive Train Control implementation deadlines, requirements, and federal rules. Support for funding in FY2019 THUD Appropriations (H.R.6072, H.Rept. 115-750, H.R.6147, House Committee Print 115-81, S.3023, S.Rept 115-268) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 721 and S. 407. Implementation of Positive train control provisions in Railroad Safety and Positive Train Control Extension Act and Surface Transportation Extension Act of 2015 PL 114-73. Congressional outreach and education on issues pending before the Surface Transportation Board. Support for nominees and potential nominees for administrative positions at USDOT and STB. Support for regulatory streamlining and improvement legislation (RAILS Act, S.1451). Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package.",
    "Support for H.R. 721 and S. 407 - Building Rail Access for Customers and the Economy Act. Support for inclusion of extension of tax credit provisions in P.L. 115-141.",
    "Support for H.R. 721 and S. 407 - Building Rail Access for Customers and the Economy Act. Support for inclusion of extension of tax credit provisions in P.L. 115-141 and Rules Committee Print 115-87, the House Amendment to the Senate Amendment to H.R. 88",
    "Support for H.R. 510 and S. 203 - Building Rail Access for Customers and the Economy Act. Support for inclusion of extension of tax credit provisions in H.J. Res. 31 Consolidated Appropriations Act 2019.",
    "Support for funding in FY2019 THUD Appropriations (H.R.6072, S.3023) and FY2020 THUD Appropriations for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in appropriations legislation.",
    "Post-enactment implementation and rulemaking following the Fixing Americas Surface Transportation Act (PL 114-94, FAST) including: railroad funding, regulation, and safety provisions; authorizations for national transportation grants, freight rail grants. Support for funding in FY2019 THUD Appropriations (H.R.6072, H.Rept. 115-750, H.R.6147, House Committee Print 115-81, S.3023, S.Rept 115-268) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203. Congressional outreach and education on issues pending before the Surface Transportation Board. Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package.",
    "Support for H.R. 510 and S. 203 - Building Rail Access for Customers and the Economy Act. Support for inclusion of extension of tax credit provisions in must-pass budget legislation.",
    "Post-enactment implementation and rulemaking following the Fixing Americas Surface Transportation Act (PL 114-94, FAST) including: railroad funding, regulation, and safety provisions; authorizations for national transportation grants, freight rail grants. Support for funding in FY2020 THUD Appropriations (H.R.3163; no Senate bill) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203. Congressional outreach and education on issues pending before the Surface Transportation Board. Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package.",
    "Support for funding in FY2020 THUD Appropriations (H.R.3163, no Senate bill) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in appropriations legislation.",
    "Support for funding in FY2020 THUD Appropriations (H.R.3163, S.2520) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in appropriations legislation.",
    "Post-enactment implementation and rulemaking following the Fixing Americas Surface Transportation Act (PL 114-94, FAST) including: railroad funding, regulation, and safety provisions; authorizations for national transportation grants, freight rail grants. Support for funding in FY2020 THUD Appropriations (H.R.3163; S. 2520) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203. Congressional outreach and education on issues pending before the Surface Transportation Board. Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package.",
    "Support for funding in FY2020 THUD Appropriations (H.R.3163, S.2520, H.R. 1865) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in appropriations legislation.",
    "Post-enactment implementation and rulemaking following the Fixing Americas Surface Transportation Act (PL 114-94, FAST) including: railroad funding, regulation, and safety provisions; authorizations for national transportation grants, freight rail grants. Support for funding in FY2020 THUD Appropriations (H.R.3163; S. 2520) for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203. Congressional outreach and education on issues pending before the Surface Transportation Board. Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package. Oppose minimum Train Crew Size legislation (H.R. 1748, S. 1979)",
    "Support for H.R. 510 and S. 203 - Building Rail Access for Customers and the Economy Act. Support for inclusion of extension of tax credit provisions in must-pass budget legislation (H.R. 1865)",
    "Support for H.R. 510 and S. 203 - Building Rail Access for Customers and the Economy Act. Support for inclusion of any must pass legislation, including potential surface transportation reauthorization.",
    "No bill number -  Support for funding in FY2021 THUD Appropriations for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. No bill number - Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203. Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package or surface transportation reauthorization. Oppose minimum Train Crew Size legislation (H.R. 1748, S. 1979)",
    "H.R. 7617, support for funding in FY2021 THUD Appropriations for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations. No bill number - Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203. Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package or surface transportation reauthorization. Oppose minimum Train Crew Size legislation (H.R. 1748, S. 1979)",
    "H.R. 7617 and P.L. 116-620 -  Support for funding in FY2021 THUD Appropriations for rail safety, research, development and training, National Infrastructure Investment grants, CRISI grants, RRIF appropriations, and maintain grant set asides for rural areas and small projects. No bill number - Opposition to the inclusion of increased truck size and weights in legislation. Support for the Building Rail Access for Customers and the Economy Act H.R. 510 and S. 203 (added in PL 116-620). Support for regulatory streamlining and improvement legislation. Provisions impacting freight rail and infrastructure financing programs in potential new infrastructure package or surface transportation reauthorization. Oppose minimum Train Crew Size legislation and prohibiting of transporting LNG in tank cars (H.R. 1748, S. 1979)"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021
  ],
  "growthRate": -92,
  "trajectory": "declining",
  "yearsActive": 4,
  "avgAnnualSpending": 350000,
  "peakYear": 2018,
  "lobbyistCount": 12,
  "firmCount": 1,
  "issueCount": 3,
  "industry": "technology"
}