{"id":184917,"name":"AMERICAN INTERNATIONAL GROUP, INC.","slug":"american-international-group-inc","state":"DC","description":"Global insurance company","totalSpending":1820000,"filings":26,"yearlySpending":[{"year":2018,"income":280000},{"year":2019,"income":210000},{"year":2020,"income":280000},{"year":2021,"income":280000},{"year":2022,"income":280000},{"year":2024,"income":210000},{"year":2025,"income":280000}],"firms":["INVARIANT LLC"],"lobbyists":["ANNE PALISI","STEPHEN BAILEY","MARY STANTON","HEATHER PODESTA","PATRICE WILLOUGHBY","LARISSA MARTINEZ","CAROLYN CODA","QUINCY ENOCH","MATTHEW RUSSELL","JOEY SMITH","NOAH MARINE","JOSEPH VAUGHAN"],"issues":["TAX","BUD","INS","RET","FIN","CPI","ENV"],"sampleDescriptions":["Monitor implementation of P.L. 115-97, the Tax Cuts and Jobs Act.","Monitor H.R. 1625, the Consolidated Appropriations Act of 2018 (P.L. 115-141).","Educate Members on AIG and Dodd-Frank Wall Street Reform and Consumer Protection Act; monitor H.R. 4061, the Financial Stability Oversight Council Improvement Act of 2017.","Monitor and discuss retirement proposals S. 2526 / H.R. 5285, the Retirement Enhancement and Savings Act of 2018, H.R. 4524, the Retirement Plan Simplification and Enhancement Act of 2017, and H.R. 4604, the Increasing Access to a Secure Retirement Act of 2017.","Educate Members on AIG and Dodd-Frank Wall Street Reform and Consumer Protection Act; monitor H.R. 4061, the Financial Stability Oversight Council Improvement Act of 2017; monitor regulatory activities at the Securities and Exchange Commission related to the proposed Regulation Best Interest Standard.","Monitor implementation of P.L. 115-97, the Tax Cuts and Jobs Act; discuss international taxation regulations with Treasury Department.","Monitor and discuss retirement proposals H.R. 1007, the Retirement Enhancement and Savings Act of 2019, and H.R. 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019 (SECURE Act).","Educate Members of Congress on AIG and Dodd-Frank Wall Street Reform and Consumer Protection Act; monitor S. 603, the Financial Stability Oversight Council Improvement Act of 2019; monitor and discuss regulatory activities at the Department of Labor and the Securities and Exchange Commission related to the proposed Regulation Best Interest Standard; educate Members of Congress on the Terrorism Risk Insurance Act.","Support and discuss retirement proposals H.R. 1007, the Retirement Enhancement and Savings Act of 2019, and H.R. 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019 (SECURE Act).","Educate Members of Congress on AIG and Dodd-Frank Wall Street Reform and Consumer Protection Act; educate Members of Congress on the Terrorism Risk Insurance Act; monitor cannabis legislation; monitor H.R. 1865 and reauthorization of the Terrorism Risk Insurance Program.","Monitor cannabis legislation; monitor efforts to examine travel insurance and pandemic insurance; monitor and educate about risk retention groups expanded authority in H.R. 4523, the Nonprofit Property Protection Act.","Monitor proposals related to financial technology; educate on impact of LIBOR transition.","Monitor implementation of P.L. 115-97, the Tax Cuts and Jobs Act; monitor tax proposals in COVID legislation.","Monitor proposals on data privacy and data protection.","Monitor proposals on data privacy, data protection, and artificial intelligence.","Monitor cannabis legislation; monitor efforts to examine travel insurance and pandemic insurance, including H.R. 7011, the Pandemic Risk Insurance Act of 2020; H.R. 6494, the Business Interruption Insurance Coverage Act of 2020; and H.R. 6497, the Never Again Small Business Protection Act of 2020.","Monitor proposals related to financial technology.","Monitor retirement proposals in COVID-19 legislation.","Monitor efforts to examine travel insurance and pandemic insurance, including H.R. 7011, the Pandemic Risk Insurance Act of 2020; H.R. 6494, the Business Interruption Insurance Coverage Act of 2020; and H.R. 6497, the Never Again Small Business Protection Act of 2020; monitor cannabis legislation.","Monitor retirement proposals as it relates to the American Rescue Plan Act of 2021 (P.L. 117-2) and other draft legislation."],"years":[2018,2019,2020,2021,2022,2024,2025]}