{
  "id": 201769,
  "name": "AMERICAN HOSPITAL ASSOCIATION",
  "slug": "american-hospital-association",
  "state": "DC",
  "description": "Association of hospitals",
  "totalSpending": 1380000,
  "filings": 23,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 240000
    },
    {
      "year": 2019,
      "income": 180000
    },
    {
      "year": 2020,
      "income": 180000
    },
    {
      "year": 2021,
      "income": 180000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 120000
    }
  ],
  "firms": [
    "PLURUS STRATEGIES, LLC"
  ],
  "lobbyists": [
    "SARAH LITKE",
    "DAVID LEITER",
    "GEORGETTE KERR",
    "JEAN CORNELL"
  ],
  "issues": [
    "HCR",
    "MMM",
    "BUD",
    "TEC",
    "IMM",
    "TAX",
    "LBR",
    null
  ],
  "sampleDescriptions": [
    "General issues related to federal health policies",
    "General issues related to hospitals",
    "General issues related to rural broadband access for health care providers",
    "General issues related to immigration requirements for foreign educated nurses",
    "General issues related to drug pricing, including surprise medical bills and S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; and issues related to the Affordable Care Act",
    "General issues related to FY20 appropriations to prevent or minimize hospital cuts",
    "General issues related to Medicare for All; issues related to 340b, drug pricing, and price transparency policies, including S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; issues related to the Affordable Care Act; issues related to the Medicaid disproportionate share hospital (DSH) cuts",
    "General issues related to FY20 appropriations to prevent or minimize hospital cuts and issues related to healthcare extenders",
    "General issues related to healthcare extenders",
    "General issues related to drug pricing, including surprise medical bills and S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; issues related to the Affordable Care Act; and issues related to healthcare extenders",
    "General issues related to FY21 appropriations to prevent or minimize hospital cuts and issues related to healthcare extenders",
    "General issues related to healthcare extenders and COVID-19 response efforts, including H.R. 748, the CARES Act",
    "General issues related to drug pricing, including surprise medical bills and related legislation, including H.R. 5826, the Consumer Protections Against Surprise Medical Bills Act, H.R. 3630, the No Surprises Act, and H.R. 5800, the Ban Surprise Billing Act, as well as S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; issues related to hospitals and healthcare in COVID-19 response efforts, including H.R. 748, the CARES Act; issues related to the Affordable Care Act (ACA); and issues related to healthcare extenders",
    "General issues related to Medicare for All; issues related to 340b, drug pricing, and price transparency policies, including S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; issues related to surprise medical bills, including H.R. 5826, the Consumer Protections Against Surprise Medical Bills Act, H.R. 3630, the No Surprises Act, and H.R. 5800, the Ban Surprise Billing Act; issues related to hospitals and healthcare in COVID-19 response efforts, including H.R. 748, the CARES Act; issues related to the Affordable Care Act (ACA); issues related to the Medicaid disproportionate share hospital (DSH) cuts",
    "General issues related to healthcare extenders and COVID-19 response efforts",
    "General issues related to drug pricing, including surprise medical bills and related legislation, including H.R. 5826, the Consumer Protections Against Surprise Medical Bills Act, H.R. 3630, the No Surprises Act, and H.R. 5800, the Ban Surprise Billing Act, as well as S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; issues related to hospitals and healthcare in COVID-19 response efforts; issues related to the Affordable Care Act (ACA); and issues related to healthcare extenders",
    "General issues related to Medicare for All; issues related to 340b, drug pricing, and price transparency policies, including S. 1895, the Lower Health Care Costs Act; issues related to rural hospitals; issues related to surprise medical bills, including H.R. 5826, the Consumer Protections Against Surprise Medical Bills Act, H.R. 3630, the No Surprises Act, and H.R. 5800, the Ban Surprise Billing Act; issues related to hospitals and healthcare in COVID-19 response efforts; issues related to the Affordable Care Act (ACA); issues related to the Medicaid disproportionate share hospital (DSH) cuts",
    "General issues related to FY21 appropriations to prevent or minimize hospital cuts; issues related to COVID-19 response efforts; and issues related to healthcare extenders",
    "General issues related to hospitals and healthcare in COVID-19 response efforts, including H.R. 1319, the American Rescue Plan Act; issues related to drug pricing, including H.R. 3, the Lower Drug Costs Now Act; issues related to the Medicare sequester, including H.R. 1868, An Act to prevent across-the-board direct spending cuts, and for other purposes; issues related to rural hospitals; and issues related to the Affordable Care Act (ACA)",
    "General issues related to hospitals and healthcare in COVID-19 response efforts, including H.R. 1319, the American Rescue Plan Act; issues related to drug pricing, including H.R. 3, the Lower Drug Costs Now Act; issues related to the Medicare sequester, including H.R. 1868, An Act to prevent across-the-board direct spending cuts, and for other purposes; issues related to rural hospitals; issues related to the Affordable Care Act (ACA); and issues related to Medicare for All and the public option"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024
  ],
  "growthRate": -50,
  "trajectory": "reducing",
  "yearsActive": 7,
  "avgAnnualSpending": 197143,
  "peakYear": 2018,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 7,
  "industry": "healthcare"
}