{
  "id": 178520,
  "name": "AMERICAN DENTAL ASSOCIATION",
  "slug": "american-dental-association",
  "state": "DC",
  "description": "Professional association of dentists.",
  "totalSpending": 1678750,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 318750
    },
    {
      "year": 2019,
      "income": 180000
    },
    {
      "year": 2020,
      "income": 180000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 250000
    }
  ],
  "firms": [
    "THE NICKLES GROUP, LLC"
  ],
  "lobbyists": [
    "MARY SAVARY TAYLOR",
    "RACHEL JONES HENSLER",
    "EMILY PORTER",
    "JEFF CHOUDHRY",
    "STEPHANIE BADGER",
    "DONALD KENT",
    "BRETT BAKER",
    "GREG D'ANGELO"
  ],
  "issues": [
    "DEF",
    "TAX",
    "HCR",
    "MMM",
    "BUD",
    "FOR",
    "SMB",
    "LBR",
    "FIN",
    "HOM",
    "GOV",
    null,
    "BAN",
    "EDU",
    "VET",
    "IMM"
  ],
  "sampleDescriptions": [
    "H.R. 1625, Consolidated Appropriations Act of 2018, H.R. 1892, Bipartisan Budget Act of 2018 and issues related to military dental research funding.",
    "Monitor implementation of H.R. 1, The Tax Cut and Jobs Act, as it relates to small businesses. Issues related to the medical device excise tax and limitations on contributions to FSAs.",
    "H.R. 1606, The Dental and Optometric Care Access Act. H.R. 2422, Action for Dental Health Act of 2017 and issues regarding access to dental services. S.2315, Over-the-Counter Drug Safety, Innovation, and Reform Act; H.R.5333, Over-the-Counter Monograph Safety, Innovation, and Reform Act of 2018 and issues related to over the counter medications. H.R. 4894, The  Harmful Tax Prevention Act.",
    "Issues regarding Medicare enrollment for dentists who provide prescriptions for Medicare beneficiaries. Issues concerning opioid prescribing.",
    "H.R. 1625, Consolidated Appropriations Act of 2018, H.R. 1892, Bipartisan Budget Act of 2018 and issues related to medical dental research funding and access to dental services.",
    "H.R. 1606, The Dental and Optometric Care Access Act. H.R. 2422, Action for Dental Health Act of 2017 and issues regarding access to dental services. S.2315, Over-the-Counter Drug Safety, Innovation, and Reform Act; H.R.5333, Over-the-Counter Monograph Safety, Innovation, and Reform Act of 2018 and issues related to over the counter medications. H.R. 4894, The  Harmful Tax Prevention Act. S. 1827, Kids Act of 2017 and H.R. 195, Extension of Continuing Appropriations Act, 2018 as they relate to reauthorization of CHIP.",
    "Issues related to military dental research funding.",
    "Issues concerning opioid prescribing.",
    "Monitor implementation of The Tax Cut and Jobs Act, as it relates to small businesses and the treatment of pass-through businesses. Issues related to the medical device excise tax and limitations on contributions to FSAs.",
    "H.R. 1606, The Dental and Optometric Care Access Act. H.R. 2422, Action for Dental Health Act of 2017, S. 3016, Action for Dental Health Act of 2018 and issues regarding access to dental services. S.2315, Over-the-Counter Drug Safety, Innovation, and Reform Act; H.R.5333, Over-the-Counter Monograph Safety, Innovation, and Reform Act of 2018 and issues related to over the counter medications. Issues related to opioids, including prescription fill limits, prescription drug monitoring programs and mandatory compulsory education. H.R 6, SUPPORT for Patients and Communities Act. S. 2680, The Opioid Crisis Response Act of 2018.",
    "H.R. 6157, Department of Defense Appropriations Act of 2019, issues related to medical dental research funding and access to dental services.",
    "Monitor implementation of The Tax Cut and Jobs Act, as it relates to small businesses and the treatment of pass-through businesses. Issues related to the medical device excise tax and limitations on contributions to FSAs. H.R. 6760, Protecting Family and Small Business Tax Cuts Act of 2018, as it relates to the sect. 199A business deduction. H.R. 6757, the Family Savings Act, as it relates to sect. 529 savings plans.",
    "Issues regarding medically necessary oral & dental treatment.",
    "H.R. 1606, The Dental and Optometric Care Access Act. H.R. 2422, Action for Dental Health Act of 2017, S. 3016, Action for Dental Health Act of 2018 and issues regarding access to dental services. S.2315, Over-the-Counter Drug Safety, Innovation, and Reform Act; H.R.5333, Over-the-Counter Monograph Safety, Innovation, and Reform Act of 2018 and issues related to over the counter medications. Issues related to opioids, including prescription fill limits, prescription drug monitoring programs, mandatory compulsory education and prescriber patterns. H.R 6, SUPPORT for Patients and Communities Act. S. 2680, The Opioid Crisis Response Act of 2018.",
    "Monitor implementation of The Tax Cut and Jobs Act, as it relates to small businesses and the treatment of pass-through businesses. H.R. 88, as it relates to the medical device excise tax. Issues related to limitations on contributions to FSAs. H.R. 6760, Protecting Family and Small Business Tax Cuts Act of 2018, as it relates to the sect. 199A business deduction. H.R. 6757, the Family Savings Act, as it relates to sect. 529 savings plans.",
    "Monitored issues related to H.R. 7217, IMPROVE Act.  H.R. 2422, Action for Dental Health Act of 2017, S. 3016, Action for Dental Health Act of 2018 and issues regarding access to dental services. S.2315, Over-the-Counter Drug Safety, Innovation, and Reform Act; H.R.5333, Over-the-Counter Monograph Safety, Innovation, and Reform Act of 2018 and issues related to over the counter medications. Issues related to opioids, including prescription fill limits, prescription drug monitoring programs, mandatory compulsory education and prescriber patterns. H.R 6, SUPPORT for Patients and Communities Act. S. 2680, The Opioid Crisis Response Act of 2018.",
    "Issues regarding dental services in Medicare.",
    "Monitored H.R. 951, United States-Mexico Tourism Improvement Act of 2019.",
    "Monitor implementation of The Tax Cut and Jobs Act, as it relates to small businesses and the treatment of pass-through businesses. S. 692, Protect Medical Innovation Act, as it relates to the medical device excise tax. Issues related to limitations on contributions to FSAs. H.R. 217, Permanent Tax Relief for Working Families Act,as it relates to the sect. 199A business deduction. H.R. 3301, Taxpayer Certainty and Disaster Tax Relief Act of 2019, as it relates to the medical device tax and sect. 199A business deduction. H.R. 3300, Economic Mobility Act of 2019, as it relates to transportation fringe benefits.",
    "Issues regarding access to dental services. S. 1379 / H.R. 269, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2019, as it relates to the over the counter medication user fee issue. Issues regarding Community Health Center funding. Monitored H.R. 1835, Consensual Donation and Research Integrity Act of 2019. S. 1895, Lower Health Care Costs Act of 2019 and issues regarding surprise billing and exempt benefits."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -22,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 209844,
  "peakYear": 2018,
  "lobbyistCount": 8,
  "firmCount": 1,
  "issueCount": 15
}