{
  "id": 194242,
  "name": "AMERICAN HONEY PRODUCERS ASSOCIATION",
  "slug": "american-honey-producers-association",
  "state": "MT",
  "description": "Agricultural industry trade association",
  "totalSpending": 1700000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 240000
    },
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 180000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 180000
    },
    {
      "year": 2025,
      "income": 180000
    }
  ],
  "firms": [
    "NORTH SOUTH GOVERNMENT STRATEGIES, FKA JDM PUBLIC STRATEGIES, LLC"
  ],
  "lobbyists": [
    "ERIC SILVA"
  ],
  "issues": [
    "TRD",
    "ENV",
    "AGR",
    "TRA",
    "FOO",
    null
  ],
  "sampleDescriptions": [
    "recovery of interest and other payments to CBP owed to the domestic production industry, enforcement of existing AD/CVD laws against Chinese imports of honey",
    "continuation of pollinator risk assessment, labeling of hazards for pollinators on products, and federal policies to encourage communication and mitigation of harm to honeybees",
    "lobbying for conservation/habitat, livestock disaster insurance, research, and honey labeling in the 2018 Farm Bill for the honey production and pollination services industries",
    "lobbying for exemptions for truck drivers on hours of service and ELOG requirements that are not feasible when hauling managed honeybees cross country",
    "continuation of pollinator risk assessment, labeling of hazards for pollinators on products, and federal policies to encourage communication among stakeholders and mitigation of harm to honeybees",
    "issues related to added sugar labels on honey and FDA guidance re same",
    "lobbying for conservation/habitat, livestock disaster assistance, research, and honey labeling in the 2018 Farm Bill for the honey production and pollination services industries",
    "lobbying congress and CBP re CBP enforcement of trade laws to protect the honey market",
    "lobbying USDA re implementation of the 2018 Farm Bill research, conservation and disaster assistance titles with regard to pollinators and honeybees.",
    "lobbying Congress to delay ELD provisions at DOT until DOT can come up with a workable HOS requirement for hauling livestock and honeybees",
    "no activity this quarter; lobbied in Q4 2018 to include a requirement in the Farm Bill for FDA to change nutrition labels so that honey labels do not include \"added sugar\".",
    "lobbying congress and CBP re CBP enforcement of trade laws to protect the honey market and the need for additional testing technologies and frequencies to detect and enforce against fraud.",
    "Lobbying Congress for oversight of implementation of 2018 Farm Bill provisions regarding FDA changes to nutrition labels so that honey labels do not include \"added sugar\" and to clarify other aspects of the label",
    "lobbying USDA and Congress re implementation of the 2018 Farm Bill research, conservation and disaster assistance titles with regard to pollinators and honeybees.",
    "Lobbying Congress and the FDA for oversight of implementation of 2018 Farm Bill provisions regarding FDA changes to nutrition labels so that honey labels do not include \"added sugar\" and to clarify other aspects of the label",
    "lobby EPA to host a research summit on state of science related to honeybees and interaction with regulated checals",
    "Issues related to CBP enforcement of trade laws to protect the honey market and the need for additional testing technologies and frequency of testing to detect and enforce against fraud.",
    "Issues related to implementation of the 2018 Farm Bill research, conservation and disaster assistance titles with regard to pollinators and honeybees; FY 2021 appropriations for the same provisions, including research and the Emergency Livestock Assistance Program; issues related to COVID relief for industry; oversight of APHIS bio-control agent releases on forage beneficial to honeybees.",
    "Issues related to ELD provisions at DOT until DOT can come up with a workable HOS requirement for hauling livestock and honeybees; Monitor the highway surface transportation Act re the same.",
    "issues related to a research summit on state of science related to honeybees and interaction with regulated chemicals"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -25,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 212500,
  "peakYear": 2018,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 5
}