{"id":189838,"name":"AMERICAN MARITIME OFFICERS SERVICE (AMOS)","slug":"american-maritime-officers-service-amos","state":"DC","description":"American Maritime Officers Service is a bus. association of U.S.-flagged merchant vessels.","totalSpending":1160000,"filings":29,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":160000},{"year":2020,"income":160000},{"year":2021,"income":160000},{"year":2022,"income":160000},{"year":2024,"income":120000},{"year":2025,"income":160000}],"firms":["OTTERSON LLC"],"lobbyists":["BRENDA OTTERSON"],"issues":["MAR"],"sampleDescriptions":["H.R.1625, Consolidated Appropriations for FY18, Maritime Security Program, Military Sealift Command; Transportation Appropriations for Maritime Security Program, Military Sealift Command;  S.1129- The Coast Guard Authorization Act of 2017,vessel discharge provisions; H.R.2, Agriculture and Nutrition Act of 2018, PL 480 (Food for Peace Program);H.R. 5515, National Defense Authorization Act, Maritime Security Program, Military Sealift; Cargo Preference Enforcement; Maritime Safety revisions, Jones Act;  USA Maritime Sail-In meetings with Members of Congress and staffs on all US maritime legislative issues listed above.","H.R.1625, consolidated Appropriations for FY18, Maritime Security Program, Military Sealift Command; Transportation Appropriations for Maritime Security Program, Military Sealift Command; S.1119-The Coast Guard Authorization Act of 2017, vessel discharge provisions; H.R.2, Agriculture and Nutrition Act of 2018, PL 480 (Food for Peace Program); H.R. 5515 - National Defense Authorization Act, Maritime Security Program, Military Sealift; Cargo Preference Enforcement; Maritime Safety revisions, Jones Act; USA Maritime Sail-In meetings with Members of Congress and staffs on all US maritime legislative issues listed above.","H.R.2, Agriculture and Nutrition Act of 2018: PL480, Food for Peace Program, cargo preference.\nS. 3042, Agriculture Improvement Act of 2018: Food for Peace Program, cargo preference.\nAgriculture Appropriations FY 19: PL 480, Food for Peace Program.\nTransportation and HUD Appropriations FY19: Maritime Security Program; Ready Reserve Fleet.\nH.R. 5515, National Defense Authorization Act FY19: Maritime Security Program; Ready Reserve Fleet.\nH.R. 6175, Maritime Safety Act of 2018.\nH.R. 5893, Energizing American Shipbuilding Act of 2018; S. 2916, Energizing American Shipbuilding Act of 2018.  \nH.R. 2518, Coast Guard Reauthorization Act; Vessel Incidental Discharge Act.\nThe Jones Act: Jones Act-Puerto Rico.\nExecutive Office of The White House: Cargo Preference.","H.R.2, Agriculture and Nutrition Act of 2018: PL480, Food for Peace Program, cargo preference.\nS. 3042, Agriculture Improvement Act of 2018: Food for Peace Program, cargo preference.\nAgriculture Appropriations FY 19: PL 480, Food for Peace Program.\nTransportation and HUD Appropriations FY19: Maritime Security Program; Ready Reserve Fleet.\nH.R. 5515, National Defense Authorization Act FY19: Maritime Security Program; Ready Reserve Fleet.\nH.R. 6175, Maritime Safety Act of 2018.\nH.R. 5893, Energizing American Shipbuilding Act of 2018; S. 2916, Energizing American Shipbuilding Act of 2018.  \nH.R. 2518, Coast Guard Reauthorization Act; Vessel Incidental Discharge Act.\nThe Jones Act: Jones Act-Puerto Rico.\nExecutive Office of the White House: Cargo preference.","H.R.2, Agriculture and Nutrition Act of 2018: PL480, Food for Peace Program, cargo preference.\nS. 3042, Agriculture Improvement Act of 2018: Food for Peace Program, cargo preference.\nAgriculture Appropriations FY 19: PL 480, Food for Peace Program.\nTransportation and HUD Appropriations FY19: Maritime Security Program.\nH.R. 5515, National Defense Authorization Act FY19: Maritime Security Program, Ready Reserve Fleet.\nH.R. 6175, Maritime Safety Act of 2018.\nH.R. 5893, Energizing American Shipbuilding Act of 2018; S. 2916, Energizing American Shipbuilding Act of 2018.  \nH.R. 2518, Coast Guard Reauthorization Act; Vessel Incidental Discharge Act.\nThe Jones Act: Jones Act-Puerto Rico.\nCoast Guard non-operating Personnel Exception draft legislation; Weather Service and NOAA changes in forecast products affecting the maritime industry.","H.R. 2-Agriculture and Nutrition Act of 2018; PL 480, Food for Peace Program;\nS.140- Frank LoBiondo Coast Guard Authorization Act of 2018, Vessel Incidental Discharge Act;\nJones Act-Puerto Rico; FY19 Appropriations- Agriculture, PL 480-Food for Peace; \nFY 19 Transportation Appropriations - Maritime Security Program.","FY 20 Appropriations: Transportation-Maritime Security Program; Agriculture-Food for Peace, PL 480;  McGovern-Dole-Food for Progress (U.S. House and Senate).\nHouse Armed Services Committee: National Defense Authorization Act (NDAA) for FY 20-Maritime Security Program and Maritime Sealift Command. \nTransportation and Infrastructure Committee: Jones Act-Puerto Rico, Domestic LNG transportation. USA Maritime Sail-In (educational advocacy to Members of Congress).","H.R. 550, Merchant Marines of WW II Gold Medal; H.R. 3409, The Coast Guard Authorization Act of 2019 - Jones Act Waivers; H.R. 2500, National Defense Authorization Act FY 2020 - Maritime Security Program (MSP), Maritime Security Program Tanker Fleet and Cable Vessels; H.R. 2440 - Harbor Maintenance Trust Fund; H.R. 3055, Transportation Appropriations FY 20 - Maritime Security Program, Agriculture Appropriations FY 20 - Food For Peace Program (PL 480); The Jones Act; The Jones Act - Puerto Rico; Harbor Maintenance Tax; U.S. Coast Guard regarding U.S. Global Positioning System & Global Navigational Satellite Systems.","H.R. 2500 and S. 1790, National Defense Authorization Act FY 20: Maritime Security Program; Tanker Program; Cable vessels program; \nFY 20 Appropriations Agriculture: P.L. 480, Food for Peace Program. FY 20:Appropriations Transportation: Maritime Security Program'\nH.R. 550, S.153: Merchant Marines of WWII Gold Medal Act 2019.\nH.R. 3829, S. 2167: Energizing American Shipbuilding Act.\nH. R. 5351: Short Sea Shipping Act 2019.\nThe Jones Act: Customs And Border Protection (CBP) heavy lift rulings.\nH. R. 3409, The Coast Guard Reauthorization Act of 2019.","House and Senate\n\n&#239;&#187;&#191;HR 5671 and S.133 - Merchant Mariners WWII Gold Medal Act; House and Senate\nFY 21 Appropriations - Transportation, Maritime Security Program, Maritime Administration,\nAgriculture, PL 480, Food for Peace Program;\nNDAA FY 21 - Maritime Security Program, Military Sealift Command, Tanker Program;\nHR 5351 - Short Sea Shipping Act; HR 3829 and S. 2167 - Energizing American Shipbuilding Act;\nHR 3409 - Coast Guard Authorization  Act FY 20; S. 2297 - Coast Guard Authorization  Act of 2019-2020;\nJones Act coastwise waivers; \n\nMARAD - Coronavirus Cares Acts Implementations.","FY 21 Appropriations:  Agriculture, PL 480, Food for Peace; McGovern-Dole Program.\nFY 21 Appropriations: Transportation,  Maritime Security Program (MSP); Tanker Program; COVID-19 emergency relief.\nH.R. 6395 - NDAA FY 21:  Maritime Security Program (MSP) annual funding; Maritime Security Program COVID-19 emergency funding and 320 day waiver request; Tanker Security Program. \nS.4049 - NDAA FY 21:  Maritime Security Program Covid-19 emergency funding. \nS. 3930, Maritime Administration Authorization and Improvement Act. \nS. 2297, Coast Guard Reauthorization Act 2019-2020. \nH. R. 3409, Coast Guard Authorization Act of 2019, Jones Act Coastwise Waivers. \nJones Act Centennial.\nMaritime Administration: Covid-19 affects and needs in the US domestic and US international industries; Maritime Security Program emergency relief.","Appropriations FY 21: Transportation,  Maritime Security Program, Agriculture, PL 480,  Food for Peace Program and McGovern- Dole.\nH.R. 6395, National Defense Authorization Act FY 21 and S. 4049, National Defense Authorization Act FY 21- Maritime Security Program, Maritime Administration Authorization, Coast Guard Authorization, Maritime Tanker Program. \nH. R. 6800, The Heroes Act, Maritime Security Program, Covid -19 relief. \nH. R. 4447, Clean Economy Jobs and Innovation Act, Garamendi and Lowenthal amendment on OCSLA.","H.R. 6395, National Defense Authorization Act FY21; Maritime Security Program; Tanker Security Fleet; Maritime Administration Authorization; U.S. Coast Guard Authorization; Jones Act Administrative Waivers; Maritime Training and Education; Cargo Prference Study; Outer Continental Shelf Activities; Military Sealift; Veto Override on H.R. 6395, House and Senate.","FY 22 National Defense Authorization Act (NDAA), Maritime Security Program; Maritime TankerFleet; FY 22 Appropriations, Maritime Security Program; Food For Peace; PL 480; Maritime Tanker Fleet; The Jones Act; Cargo Preference Laws; Covid 19 Vaccinations; HR 1819, To require a certainpercentage of natural gas and crude oil exports be transported on US built and US flagged vessels; MARAD: Fair and reasonable rates for MSP carriers; Tanker Security Fleet; Cargo Preference Laws.","House and Senate:\n&#239;&#187;&#191;Appropriations FY22 Transportation: Maritime Security Program; Maritime Tanker Fleet Program; Maritime Cable Fleet; Military Sealift; Appropriations FY22 Agriculture: Food for Peace Program, PL480.\nNational Defense Authorization Act FY 22:  Maritime Security Program; Maritime Tanker Fleet Program; Cable Vessels; H.R. 1561, Great Lakes Winter Commerce Act; S. 576, Great Lakes Winter Commerce Act. \n\nJones Act waivers\n\nMaRad: Maritime Tanker Fleet, Cargo Preference and PL480, Food for Peace Program.","House Armed Services Committee: H.R. 4350, FY 22 National Defense Authorization Act, Maritime Security Program; H.R. 4996, Ocean Shipping Reform Act; Tanker Security Program (TSP); Maritime Administration, Authorization to Purchase Duplicate Medals for WWII Merchant Mariners. \n\nFY 22 Appropriations, Transportation, Housing & Urban Development: Maritime Security Program ; Tanker Security Program;  \n\nFY22 Agriculture Appropriations: PL 480, Food for Peace Program. \n\nHouse Transportation and Infrastructure Committee: Reconciliation Portion, Great Lakes Icebreakers; \n\nHouse Transportation and Infrastructure Committee and Senate Commerce, Science and Transportation Committee: U.S. Coast Guard credentialing issues; Jones Act coastwise waivers; Cargo Preference laws enforcement.  \n\nMaritime Administration: Regulatory issues relating to PL 480, Food for Peace. Cargo preference; Maritime Security Program and Tanker Security Program.","Appropriations FY 22, Transportation: Maritime Security Program; Tanker Security Program. Maritime Administration Appropriations FY22 Agriculture: PL.480, Food for Peace Program. National Defense Authorization Act FY 22: Maritime Security Program; Tanker Security Program, Maritime Administration authorization. H.R. 4996, the Ocean Shipping Reform Act. The Jones Act, coastwise waivers.","H.R. 6865, the Don Young Coast Guard Authorization Act of 2022; H.R. 4996, Ocean Shipping Reform Act; S. 3580, Ocean Shipping Reform Act; Jones Act Waivers; Cargo Preference laws; National Defense Authorization Act (NDAA): Maritime Security Program, Maritime Tanker Security Fleet.","FY 23 NDAA-Maritime Administration; Maritime Security Program; Tanker Security Program; Cable Vessels; Military Sealift; Cargo preference amendment. FY 23 Transportation Appropriations- Maritime Security Program; Tanker Security Program; FY 23 Agriculture Appropriations- Food for Peace, PL480; McGovern-Dole Programs. Jones Act waivers; Cargo Preference Food aid, House Concurrent Resolution 92, and Senate Concurrent Resolutions 37 and 38. Coast Guard Reauthorization 2022, H.R. 6865.","NDAA FY23: Maritime Security Program; Tanker Security Program; Coast Guard Reauthorization; Military Sealift. FY 23 Appropriations: Maritime Security Program; Tanker Security Program; Food For Peace Program, P.L. 480. Cargo Preference Laws. House Concurrent Resolution 92 & Senate Concurrent Resolution 92, Humanitarian Aid to Ukraine. H.R. 9102, Rebuilding The U.S. Flag International Fleet - Committee on Transportation & Infrastructure; House Armed Services Committee. Homeland Security and Maritime Administration: Jones Act waivers for Puerto Rico."],"years":[2018,2019,2020,2021,2022,2024,2025]}