{
  "id": 102640,
  "name": "AMERICAN ASSOCIATION OF NURSE ANESTHETISTS",
  "slug": "american-association-of-nurse-anesthetists",
  "state": "DC",
  "description": null,
  "totalSpending": 1720000,
  "filings": 8,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 190000
    },
    {
      "year": 2021,
      "income": 1310000
    },
    {
      "year": 2022,
      "income": 220000
    }
  ],
  "firms": [
    "AMERICAN ASSOCIATION OF NURSE ANESTHETISTS"
  ],
  "lobbyists": [
    "RALPH KOHL",
    "ROMY GELB-ZIMMER",
    "RANDI GOLD",
    "MATTHEW THACKSTON",
    "JONATHAN MASON",
    "A. CATHARINE HARRIS",
    "JACK MCGLYNN",
    "BETH MULLEN",
    "INGRIDA LUSIS",
    "KRISTINA WEGER",
    "MAX SEIFERT",
    "GREGORY CRAIG",
    "EMILY CHAMPLIN",
    "KRISTEN BATSTONE"
  ],
  "issues": [
    "MMM",
    "HCR",
    "VET",
    "INS",
    "EDU",
    "MED",
    "BUD",
    "LBR",
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "Medicare reimbursement and scope of practice issues",
    "HR 1783, Improving Veterans Access to Quality Care Act of 2017\nHR 959, Title VIII Nursing Workforce Reauthorization Act of 2017\nChronic Pain management\nRural access to anesthesiologists services act\nNursing Workforce Development\nHR 1628, HR 277 The American Health Care Act\nBudget Reconciliation Improvement Act\nNational Defense Authorization Act\nLabor Health and Human Services Budget",
    "HR 1783, Improving Veteran Access to Quality Care Act\nCRNA Full Practice Authority in the Veterans Health Administration",
    "Provider non discrimination\nCRNA reimbursement and coverage issues\nScope of Practice issues",
    "Nursing Workforce Development programs\nAppropriate recognition of Certified Registered Nurse Anesthetists",
    "HR 1783, Improving Veterans Access to Quality Care Act\nHR 959 Title VIII Reauthorization Act\nHR 1628, HR 277, the American Health Care Act\nMedicare reimbursement\nChronic Pain management\nNursing workforce development",
    "Reimbursement, Scope of Practice, Full practice authority",
    "Full practice authority, scope of practice issues",
    "Scope of practice and reimbursement issues",
    "Scope of Practice and reimbursement issues",
    "Nursing workforce development funding",
    "Health Care policy and reimbursement issues",
    "Reimbursement, scope of practice",
    "Scope of practice, reimbursement, regulatory barriers, COVID related legislation and regulation, drug shortages",
    "Scope of practice, Veterans Access to care, Covid response",
    "Provider non-discrimination, Full practice authority in the department of veterans affairs, removal of regulatory barriers",
    "Full practice authority, Veterans timely access to high quality care",
    "Removal of Medicare Part A conditions of participation for hospitals and ambulatory surgical centers, physician supervision of CRNA requirements.",
    "Provider non-discrimination",
    "Improving Access to Behavioral Health Integration Act (S. 4306) Coronavirus Frontline Workers Fair Pay Act (H.R. 3020) - Issues pertaining to relief for providers during COVID-19 Black Maternal Health Momnibus Act of 2021 (H.R. 959/S.346) United States Cadet Nurse Corps Service Recognition Act 0f 2021 (H.R. 2568/S. 1220) Proposed Patient Centered Outcomes Research Trust Fund - Issues pertaining to permanent removal of physician supervision CDC Clinical Practice Guidelines for Prescribing Opioids - Issues pertaining to CRNA reimbursement and practice FDA Draft Guidance on Development of Non-Opioid Analgesics for Acute Pain - Issues pertaining to CRNA Practice Nominations to HHS agency councils: AHRQ National Advisory Council for Healthcare Research and Quality, CDC Healthcare Infection Control Practices Advisory Committee, and National Advisory Council on Nurse Education and Practice Nomination to GAO agency council: Physician-Focused Payment Model Technical Advisory Committee Surprise Billing CRNA Scope of Practice CRNA Reimbursement Rural Healthcare Extension of CMS waivers beyond public health emergency Nursing Workforce Opioid Epidemic/Opioid-sparing treatments/MATs Provider nondiscrimination"
  ],
  "years": [
    2020,
    2021,
    2022
  ],
  "growthRate": 16,
  "trajectory": "stable",
  "yearsActive": 3,
  "avgAnnualSpending": 573333,
  "peakYear": 2021,
  "lobbyistCount": 14,
  "firmCount": 1,
  "issueCount": 9
}