{"id":184469,"name":"AMERICAN RETIREMENT ASSOCIATION (FORMERLY ASPPA)","slug":"american-retirement-association-formerly-asppa","state":"VA","description":"Educator and policy advocate for retirement plan industry","totalSpending":1590000,"filings":27,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":240000},{"year":2020,"income":90000},{"year":2021,"income":180000},{"year":2022,"income":360000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["CAPITOL COUNSEL LLC"],"lobbyists":["SHANNON FINLEY","AARON COHEN","CHARLES FRENCH","JAMES MCCRERY","JOHN RAFFAELLI","JOSH KARDON","DAVID OLANDER","JILL HOFFMAN","ANN JABLON","CAITLIN CANTER","STACIE AMAN","WARREN TRYON","JOSEPH EANNELLO","PATRICK RAFFANIELLO","JEFFREY CARROLL","DE'ANA DOW","MONIQUE FRAZIER","DAVID BRIDGES","ADAM CARASSO"],"issues":["HCR","TAX","SMB","FIN"],"sampleDescriptions":["Legislative issues relating to health savings accounts.","Legislative issues related to tax reform and pension plans; legislative issues related to tax reform and pension plans, including S. 2526 - the Retirement Enhancement and Savings Act of 2018.","Legislative issues related to implementation of tax reform; legislative issues related to pension plans, including S. 2526 - the Retirement Enhancement and Savings Act of 2018.  Legislative proposals to modify the IRS's Employee Plan Compliance Resolution System.","Legislative issues related to implementation of tax reform; legislative issues related to pension plans, including S. 2526 - the Retirement Enhancement and Savings Act of 2018.  Legislative proposals to modify the IRS's Employee Plan Compliance Resolution System; legislative issues pertaining to  S. 3219 - A bill to amend the Internal Revenue Code of 1986 and the Employee Retirement Income Security Act of 1974 and H.R. 6757 - Family Savings Act of 2018.","Legislative issues related to implementation of tax reform;  legislative issues related to pension plans, including H.R. 1007 - the Retirement Enhancement and Savings Act of 2019; legislative proposals to modify the IRS's Employee Plan Compliance Resolution System; legislative issues pertaining to H.R. 1994 (SECURE Act) and issues related to financial transactions tax.","Taxation/Internal Revenue Code:  Legislative issues related to implementation of tax reform; legislative issues related to pension plans, including H.R. 1994 - Setting Every Community Up for Retirement Enhancement (SECURE) Act of 2019; legislative proposals to modify the IRS's Employee Plan Compliance Resolution System; legislative issues related to financial transactions tax.","Legislative issues related to implementation of tax reform; legislative issues related to pension plans; legislative proposals to modify the IRS's Employee Plan Compliance Resolution System; legislative issues related to financial transactions tax.","Issues related to H.R. 748 - Coronavirus Aid, Relief, and Economic Security Act (CARES Act).","Legislative issues related to pension plans; legislative issues related to financial transactions tax; legislative issues related to H.R.133 - Consolidated Appropriations Act, 2021.","Issues related to H.R. 748 - Coronavirus Aid, Relief, and Economic Security Act (CARES Act) and H.R.133 - Consolidated Appropriations Act, 2021.","Legislative issues related to pension plans; legislative issues related to financial transactions tax.","Legislative issues related to pension plans, financial transactions tax, retirement security and changes to securities laws.","The provision proposed in SECURE 2.0 would provide federal securities law exemptions for certain investments by retirement plans under Section 403(b) of the Internal Revenue Code (the Code) to achieve parity with the exemptions provided for investments by other types of retirement plans.","Issues related to 403B provisions of the Internal Revenue Code.","Legislative issues related to retirement and pension plans, financial transactions tax, retirement security and changes to securities laws."],"years":[2018,2019,2020,2021,2022,2024,2025]}