{
  "id": 116145,
  "name": "AMERICAN BENEFITS COUNCIL",
  "slug": "american-benefits-council",
  "state": "DC",
  "description": null,
  "totalSpending": 1620000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 210000
    },
    {
      "year": 2019,
      "income": 210000
    },
    {
      "year": 2020,
      "income": 290000
    },
    {
      "year": 2021,
      "income": 220000
    },
    {
      "year": 2022,
      "income": 250000
    },
    {
      "year": 2023,
      "income": 210000
    },
    {
      "year": 2024,
      "income": 100000
    },
    {
      "year": 2025,
      "income": 130000
    }
  ],
  "firms": [
    "DAVIS & HARMAN LLP"
  ],
  "lobbyists": [
    "RANDOLF HARDOCK",
    "KENT MASON",
    "BARBARA PATE",
    "THOMAS DAVIS",
    "MICHAEL HADLEY",
    "CHRIS GASTON",
    "ROBERT DAVIS",
    "ADAM MCMAHON"
  ],
  "issues": [
    "RET",
    "TAX",
    "LBR",
    "FIN",
    null
  ],
  "sampleDescriptions": [
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to \"Rothification\". Proposals related to the establishment of savings accounts for emergencies. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable. H.R. 4610, the RETIRE Act. H.R. 4158, the Retirement Plan Modernization Act. H.R. 4523, the Automatic Retirement Plan. H.R. 4524, the Retirement Plan Simplification and Enhancement Act. S. 2474, Retirement Savings Lost and Found Act. Proposals related to disaster relief. Issues related to P.L. 115-97. S. 2526/H.R. 5282, Retirement Enhancement and Savings Act. H.R. 1625, Consolidated Appropriations Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to \"Rothification\". Proposals related to the establishment of savings accounts for emergencies. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable. H.R. 4610, the RETIRE Act. H.R. 4158, the Retirement Plan Modernization Act. H.R. 4523, the Automatic Retirement Plan. H.R. 4524, the Retirement Plan Simplification and Enhancement Act. S. 2474, Retirement Savings Lost and Found Act. Proposals related to disaster relief. Issues related to P.L. 115-97. S. 2526/H.R. 5282, Retirement Enhancement and Savings Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable. H.R. 4610, the RETIRE Act. H.R. 4158, the Retirement Plan Modernization Act. H.R. 4523, the Automatic Retirement Plan. H.R. 4524, the Retirement Plan Simplification and Enhancement Act. S. 2474/H.R. 6540, Retirement Savings Lost and Found Act. Proposals related to disaster relief. Issues related to P.L. 115-97. S. 2526/H.R. 5282, Retirement Enhancement and Savings Act. Proposals related to self correcting inadvertent plan errors. H.R. 6757, Family Savings Act. Executive Order 13847, Strengthening Retirement Security in America. H.R. 6690, the Portable Retirement and Investment Account Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable. H.R. 4610/S. 3795, the RETIRE Act. H.R. 4158, the Retirement Plan Modernization Act. H.R. 4523, the Automatic Retirement Plan. H.R. 4524, the Retirement Plan Simplification and Enhancement Act. S. 2474/H.R. 6540, Retirement Savings Lost and Found Act. Proposals related to disaster relief. Issues related to P.L. 115-97. S. 2526/H.R. 5282, Retirement Enhancement and Savings Act. Proposals related to self correcting inadvertent plan errors. H.R. 6757, Family Savings Act. Executive Order 13847, Strengthening Retirement Security in America. H.R. 6690, the Portable Retirement and Investment Account Act. H.R. 88, Retirement, Savings and Other Tax Relief Act. S. 3771, Retirement Parity for Student Loans Act. H.R. 4604, Increasing Access to a Secure Retirement Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress). S. 2474/H.R. 6540, Retirement Savings Lost and Found Act (115th Congress). Proposals related to disaster relief. Issues related to P.L. 115-97. S. 2526, Retirement Enhancement and Savings Act (115th Congress). Proposals related to self correcting inadvertent plan errors. Executive Order 13847, Strengthening Retirement Security in America. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). S. 3771, Retirement Parity for Student Loans Act (115th Congress). H.R. 4604, Increasing Access to a Secure Retirement Act (115th Congress). H.R. 1007, Retirement Enhancement and Savings Act. H.R. 1994, Setting Every Community Up for Retirement Enhancement Act. S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. S. 2526, H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress). S. 2474/H.R. 6540, Retirement Savings Lost and Found Act (115th Congress). Retirement Enhancement and Savings Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 4604, Increasing Access to a Secure Retirement Act (115th Congress). H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. H.R. 1994, Setting Every Community Up for Retirement Enhancement Act (SECURE). S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress). S. 2474/H.R. 6540, Retirement Savings Lost and Found Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 1439, Increasing Access to a Secure Retirement Act. H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. H.R. 1994, Setting Every Community Up for Retirement Enhancement Act (SECURE). S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act. S. 1431, Retirement Security and Savings Act. S. 2370, Automatic IRA Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress). S. 2474/H.R. 6540, Retirement Savings Lost and Found Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 1439, Increasing Access to a Secure Retirement Act. H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. H.R. 1994, Setting Every Community Up for Retirement Enhancement Act (SECURE). S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act. S. 1431, Retirement Security and Savings Act. S. 2370, Automatic IRA Act. H.R. 1865, Further Consolidated Appropriations Act 2020.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress). S. 2474/H.R. 6540, Retirement Savings Lost and Found Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 1439, Increasing Access to a Secure Retirement Act. H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act. S. 1431, Retirement Security and Savings Act. S. 2370, Automatic IRA Act. H.R. 748, CARES Act. H.R. 6201, Families First Coronavirus Response Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress). S. 2474/H.R. 6540, Retirement Savings Lost and Found Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 1439, Increasing Access to a Secure Retirement Act. H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act. S. 1431, Retirement Security and Savings Act. S. 2370, Automatic IRA Act. H.R. 748, CARES Act. H.R. 6201, Families First Coronavirus Response Act. H.R. 6800, HEROES Act. S. 3814, RESTART Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress).  Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 1439, Increasing Access to a Secure Retirement Act. H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act. S. 1431, Retirement Security and Savings Act. S. 2370, Automatic IRA Act. S. 4192/H.R. 7439, Retirement Savings Lost and Found Act. H.R. 748, CARES Act. H.R. 6201, Families First Coronavirus Response Act. H.R. 6800, HEROES Act (H.R. 925). S. 3814, RESTART Act. No Bill #, Health, Economic Assistance, Liability Protection, and Schools Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues.  Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Kids Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to P.L. 115-97. H.R. 3910, to amend the Internal Revenue Code of 1986 to make lifetime income and managed account options of defined contribution retirement savings plans portable (115th Congress). H.R. 4610/S. 3795, the RETIRE Act (115th Congress). H.R. 4158, the Retirement Plan Modernization Act (115th Congress). H.R. 4523, the Automatic Retirement Plan Act (115th Congress). H.R. 4524, the Retirement Plan Simplification and Enhancement Act (115th Congress).  Proposals related to self-correcting inadvertent plan errors. H.R. 6690, the Portable Retirement and Investment Account Act (115th Congress). H.R. 88, Retirement, Savings and Other Tax Relief Act (115th Congress). H.R. 1439, Increasing Access to a Secure Retirement Act. H.R. 1007/ S. 972, Retirement Enhancement and Savings Act. S. 322, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act. S. 1428, Retirement Parity for Student Loans Act. S. 1431, Retirement Security and Savings Act. S. 2370, Automatic IRA Act. S. 4192/H.R. 7439, Retirement Savings Lost and Found Act. H.R. 748, CARES Act. H.R. 6201, Families First Coronavirus Response Act. H.R. 6800, HEROES Act (H.R. 925). S. 3814, RESTART Act. S. 1624, Health, Economic Assistance, Liability Protection, and Schools Act. S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration. H.R. 8696, Securing A Strong Retirement Act.  H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to environmental, social, and governance plan investments and proxy voting. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals to increase PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Child Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. H.R. 4523, the Automatic Retirement Plan Act (115th Congress).  Proposals related to self-correcting inadvertent plan errors. H.R. 1439, Increasing Access to a Secure Retirement Act (116th Congress). S. 322, SIMPLE Plan Modernization Act (116th Congress). H.R. 1084, Family Savings Act (116th Congress). S. 1428, Retirement Parity for Student Loans Act (116th Congress). S. 1431, Retirement Security and Savings Act (116th Congress). S. 2370, Automatic IRA Act (116th Congress). S. 4192/H.R. 7439, Retirement Savings Lost and Found Act (116th Congress). S. 3814, RESTART Act (116th Congress). S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration (116th Congress). H.R. 8696, Securing A Strong Retirement Act (116th Congress). H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes (116th Congress). H.R. 409/H.R. 423, Emergency Pension Plan Relief Act. H.R. 1319, the American Rescue Plan Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to environmental, social, and governance plan investments and proxy voting. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals related PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Child Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. H.R. 4523, the Automatic Retirement Plan Act (115th Congress).  Proposals related to self-correcting inadvertent plan errors. H.R. 1439, Increasing Access to a Secure Retirement Act (116th Congress). S. 270/H.R. 761, Pension and Budget Integrity Act (115th Congress). H.R. 3596, Rightsizing Pension Premiums Act (115th Congress). S. 1272, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act (116th Congress). S. 1443/H.R. 2917, Retirement Parity for Student Loans Act. S. 1770, Retirement Security and Savings Act. S. 2370, Automatic IRA Act (116th Congress). S. 1730, Retirement Savings Lost and Found Act. S. 3814, RESTART Act (116th Congress). S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration (116th Congress). H.R. 2954, Securing A Strong Retirement Act. H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes (116th Congress). H.R. 409/H.R. 423, Emergency Pension Plan Relief Act. H.R. 1319, the American Rescue Plan Act. S 1870, Enhancing Emergency and Retirement Savings Act of 2021.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to nonqualified deferred compensation. Work regarding automatic plans and backdoor Roth contributions. Issues related to Internal Revenue Code Section 162(m). Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to environmental, social, and governance plan investments and proxy voting. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals related PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Child Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to paid family and medical leave. Work regarding 15% pension minimum tax issue. H.R. 4523, the Automatic Retirement Plan Act (115th Congress).  Proposals related to self-correcting inadvertent plan errors. H.R. 1439, Increasing Access to a Secure Retirement Act (116th Congress). H.R. 4830, Pension and Budget Integrity Act. H.R. 3596, Rightsizing Pension Premiums Act (115th Congress). S. 1272, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act (116th Congress). S. 1443/H.R. 2917, Retirement Parity for Student Loans Act. S. 1770, Retirement Security and Savings Act. S. 2370, Automatic IRA Act (116th Congress). S. 1730, Retirement Savings Lost and Found Act. S. 3814, RESTART Act (116th Congress). S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration (116th Congress). H.R. 2954, Securing A Strong Retirement Act. H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes (116th Congress). H.R. 409/H.R. 423, Emergency Pension Plan Relief Act. H.R. 1319, the American Rescue Plan Act. S 1870, Enhancing Emergency and Retirement Savings Act of 2021. H.R. 4678/S. 2446, Women's Retirement Protection Act. H.R. 5376, Build Back Better Act. H.R. 5891, Retirement Improvement and Savings Enhancement Act.",
    "Issues related to paid family and medical leave. H.R. 5376, Build Back Better Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to nonqualified deferred compensation. Work regarding automatic plans and backdoor Roth contributions. Issues related to Internal Revenue Code Section 162(m). Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to environmental, social, and governance plan investments and proxy voting. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals related PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Child Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to paid family and medical leave. Work regarding 15% pension minimum tax issue. H.R. 4523, the Automatic Retirement Plan Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 1439, Increasing Access to a Secure Retirement Act (116th Congress). H.R. 4830, Pension and Budget Integrity Act. H.R. 3596, Rightsizing Pension Premiums Act (115th Congress). S. 1272, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act (116th Congress). S. 1443/H.R. 2917, Retirement Parity for Student Loans Act. S. 1770, Retirement Security and Savings Act. S. 2370, Automatic IRA Act (116th Congress). S. 1730, Retirement Savings Lost and Found Act. S. 3814, RESTART Act (116th Congress). S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration (116th Congress). H.R. 2954, Securing A Strong Retirement Act. H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes (116th Congress). H.R. 409/H.R. 423, Emergency Pension Plan Relief Act. H.R. 1319, the American Rescue Plan Act. S 1870, Enhancing Emergency and Retirement Savings Act of 2021. H.R. 4678/S. 2446, Women's Retirement Protection Act. H.R. 5376, Build Back Better Act. H.R. 5891, Retirement Improvement and Savings Enhancement Act. H.R. 6912, Pooled Employer Plan Fix Act. H.R.2741, Public Service Retirement Fairness Act of 2021. H.R. 5877/S. 3746, Pension Risk Transfer Accountability Act. H.R. 7310, Protecting Americas Retirement Security Act. H.R. 6782/S. 3712, Auto Reenrollment Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to nonqualified deferred compensation. Work regarding automatic plans and backdoor Roth contributions. Proposals related to plan amendment deadlines. Proposals related to PEP service crediting. Proposals related to Section 401(h) surplus and VEBA surplus. Issues related to Internal Revenue Code Section 162(m). Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to environmental, social, and governance plan investments and proxy voting. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals related PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Child Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to paid family and medical leave. Work regarding 15% pension minimum tax issue. H.R. 4523, the Automatic Retirement Plan Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 1439, Increasing Access to a Secure Retirement Act (116th Congress). H.R. 4830, Pension and Budget Integrity Act. H.R. 3596, Rightsizing Pension Premiums Act (115th Congress). S. 1272, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act (116th Congress). S. 1443/H.R. 2917, Retirement Parity for Student Loans Act. S. 1770, Retirement Security and Savings Act. S. 2370, Automatic IRA Act (116th Congress). S. 1730, Retirement Savings Lost and Found Act. S. 3814, RESTART Act (116th Congress). S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration (116th Congress). H.R. 2954, Securing A Strong Retirement Act. H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes (116th Congress). H.R. 409/H.R. 423, Emergency Pension Plan Relief Act. H.R. 1319, the American Rescue Plan Act. S 1870, Enhancing Emergency and Retirement Savings Act of 2021. H.R. 4678/S. 2446, Women's Retirement Protection Act. H.R. 5376, Build Back Better Act. H.R. 5891, Retirement Improvement and Savings Enhancement Act. H.R. 6912, Pooled Employer Plan Fix Act. H.R.2741, Public Service Retirement Fairness Act of 2021. H.R. 5877/S. 3746, Pension Risk Transfer Accountability Act. H.R. 7310, Protecting Americas Retirement Security Act. H.R. 6782/S. 3712, Auto Reenrollment Act. S. 4154, Simplifying Small Business Retirement Savings Act. S. 4153, Incentivizing Small Business Retirement Savings Act. Enhancing American Retirement Now (EARN) Act, as approved by the Senate Finance Committee. S. 4353, RISE & SHINE Act. S. 4219/H.R. 7740, Employee and Retiree Access to Justice Act. H.R. 7780, Mental Health Matters Act.",
    "Proposals related to retirement plan enhancements. Proposals relating to defined benefit plans, including plan funding and multiemployer plan issues. Issues related to nonqualified deferred compensation. Work regarding automatic plans and backdoor Roth contributions. Proposals related to plan amendment deadlines. Proposals related to PEP service crediting. Proposals related to Section 401(h) surplus and VEBA surplus. Issues related to Internal Revenue Code Section 162(m). Issues related to tax incentives for retirement savings. Issues related to electronic notarization. Proposals related to environmental, social, and governance plan investments and proxy voting. Proposals related to stemming leakage from retirement plans through reform of plan loan rules. Proposals related to stable value investment offerings in defined contribution plans. Proposals related to phased retirement. Proposals related PBGC premiums. Proposals related to retirement target date funds. Issues related to the Department of Labor's proposed regulation defining fiduciary for investment advice purposes. Proposals and regulations related to cash balance, pension equity, and other hybrid pension plans. Issues related to PBGC collections and PBGC disclosure and mediation issues. Proposals related to electronic disclosure of information under ERISA. Proposals regarding compliance of retirement plans. Issues related to Form 5500 filing and missing participants. Issues related to the use of brokerage windows in defined contribution plans. Proposals to reform the multiple employer plan rules. Proposals to modify required minimum distribution rules. Proposals that would modify limits on retirement plan contributions. Proposals related to stretch IRAs. Issues related to access to death master file. Issues related to government issued mortality tables. Proposals to amend the nondiscrimination provisions to protect older, longer service employees. Issues related to swap, margin, and capital rules. State-administered retirement plan initiatives. Annuitization with respect to defined benefit plans. QLACs. Effects of corporate integration on retirement plans. Proposals that would consolidate various retirement and IRA types. Proposals to create a retirement lost and found. Child Savings Accounts. Proposals related to the establishment of savings accounts for emergencies. Proposals related to disaster relief. Issues related to paid family and medical leave. Work regarding 15% pension minimum tax issue. H.R. 4523, the Automatic Retirement Plan Act (115th Congress). Proposals related to self-correcting inadvertent plan errors. H.R. 1439, Increasing Access to a Secure Retirement Act (116th Congress). H.R. 4830, Pension and Budget Integrity Act. H.R. 3596, Rightsizing Pension Premiums Act (115th Congress). S. 1272, SIMPLE Plan Modernization Act. H.R. 1084, Family Savings Act (116th Congress). S. 1443/H.R. 2917, Retirement Parity for Student Loans Act. S. 1770, Retirement Security and Savings Act. S. 2370, Automatic IRA Act (116th Congress). S. 1730, Retirement Savings Lost and Found Act. S. 3814, RESTART Act (116th Congress). S. 5064, A bill to amend the Internal Revenue Code of 1986 to increase retirement savings, to improve retirement plan administration (116th Congress). H.R. 2954, Securing A Strong Retirement Act. H.R. 8606, To defer the tax of certain sales of employer stock and reduce certain retirement-related excise taxes (116th Congress). H.R. 409/H.R. 423, Emergency Pension Plan Relief Act. H.R. 1319, the American Rescue Plan Act. S 1870, Enhancing Emergency and Retirement Savings Act of 2021. H.R. 4678/S. 2446, Women's Retirement Protection Act. H.R. 5376, Inflation Reduction Act. H.R. 5891, Retirement Improvement and Savings Enhancement Act. H.R. 6912, Pooled Employer Plan Fix Act. H.R.2741, Public Service Retirement Fairness Act of 2021. H.R. 5877/S. 3746, Pension Risk Transfer Accountability Act. H.R. 7310, Protecting Americas Retirement Security Act. H.R. 6782/S. 3712, Auto Reenrollment Act. S. 4154, Simplifying Small Business Retirement Savings Act. S. 4153, Incentivizing Small Business Retirement Savings Act. S. 4808, Enhancing American Retirement Now (EARN) Act. S. 4353, RISE & SHINE Act. S. 4219/H.R. 7740, Employee and Retiree Access to Justice Act. H.R. 7780, Mental Health Matters Act. S 4087, INFORM Act.",
    "Proposals related to 403(b) plan investments. S. 4808, Enhancing American Retirement Now (EARN) Act. H.R. 2954, Securing A Strong Retirement Act."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -38,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 202500,
  "peakYear": 2020,
  "lobbyistCount": 8,
  "firmCount": 1,
  "issueCount": 4
}