{"id":204432,"name":"AMERICAN ASSOCIATION OF INTERNATIONAL HEALTHCARE RECRUITMENT","slug":"american-association-of-international-healthcare-recruitment","state":"FL","description":"AAIHR promotes Legal, Ethical, and Socially-Responsible Global Healthcare Recruitment","totalSpending":1250000,"filings":14,"yearlySpending":[{"year":2020,"income":480000},{"year":2021,"income":480000},{"year":2022,"income":150000},{"year":2024,"income":120000},{"year":2025,"income":20000}],"firms":["DENTONS US LLP"],"lobbyists":["JOHN RUSSELL","MARGEAUX PLAISTED","VALERIE NELSON","GARY LAPAILLE","GARY GOLDBERG","CALLAN SMITH"],"issues":["IMM","HCR"],"sampleDescriptions":["Work visas for certain health care professionals; HR 1044, Fairness for High-Skilled Immigrants Act of 2017; S 386, Fairness for High-Skilled Immigrants Act of 2017.","Work visas for certain health care professionals; HR 1044, Fairness for High-Skilled Immigrants Act of 2019; S 386, Fairness for High-Skilled Immigrants Act of 2019.","Work visas for certain health care professionals; HR 1044, Fairness for High-Skilled Immigrants Act of 2019; S 386, Fairness for High-Skilled Immigrants Act of 2019. COVID 4 package of legislation;","Work visas for certain health care professionals; HR 1044, Fairness for High-Skilled Immigrants Act of 2019; S 386, Fairness for High-Skilled Immigrants Act of 2019. COVID 19 response legislation.","Work visas for certain health care professionals; HR 1044, Fairness for High-Skilled Immigrants Act of 2019; S 386, Fairness for High-Skilled Immigrants Act of 2019. COVID 19 response legislation. Omnibus Appropriations bill;","Work visas for certain health professionals; S 1024 and HR HR 2255, legislation to enhance the US s nurse and physician workforce during the COVID-19 crisis by recapturing unused immigrant visas. \n COVID Response legislation; American Recovery Act of 2021; FY 22 Appropriations.","Work visas for certain health professionals; S 1024 and HR HR 2255, legislation to enhance the US s nurse and physician workforce during the COVID-19 crisis by recapturing unused immigrant visas. \n COVID Response legislation; American Recovery Act of 2021; FY 22 Appropriations.   Reconciliation package.","Work visas for certain health professionals; S 1024 and HR HR 2255, legislation to enhance the US s nurse and physician workforce during the COVID-19 crisis by recapturing unused immigrant visas. Implementation of COVID Response legislation; American Recovery Act of 2021; FY 23 Appropriations.","Work visas for certain health professionals; S 1024 and HR HR 2255, legislation to enhance the US s nurse and physician workforce during the COVID-19 crisis by recapturing unused immigrant visas. Implementation of COVID Response legislation; Implementation of American Recovery Act of 2021; FY 23 Appropriations.","Nurse shortages; Work visas for certain health care professionals; any legislation to address nursing shortages; FY 24 appropriations.","Nurse shortages; Work visas for certain health care professionals; any legislation to address nursing shortages; FY 25 appropriations.","Nurse shortages; Work visas for certain health professionals; any legislation addressing nursing shortages; FY 25 appropriations;"],"years":[2020,2021,2022,2024,2025]}