{
  "id": 204220,
  "name": "ANSCHUTZ ENTERTAINMENT GROUP INC.",
  "slug": "anschutz-entertainment-group-inc",
  "state": "CA",
  "description": "Sports and live entertainment company",
  "totalSpending": 1640000,
  "filings": 20,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 380000
    },
    {
      "year": 2021,
      "income": 30000
    },
    {
      "year": 2022,
      "income": 140000
    },
    {
      "year": 2023,
      "income": 660000
    },
    {
      "year": 2024,
      "income": 210000
    },
    {
      "year": 2025,
      "income": 220000
    }
  ],
  "firms": [
    "HOGAN LOVELLS US LLP"
  ],
  "lobbyists": [
    "AARON CUTLER",
    "ADAM FRIDMAN",
    "KEVIN WYSOCKI",
    "EDUARDO ZAPIEN",
    "NORM COLEMAN",
    "MICHAEL BELL",
    "CHARLES GARRISON"
  ],
  "issues": [
    "ECN",
    "CSP",
    "SPO",
    "ART",
    "AVI",
    "TRA",
    null
  ],
  "sampleDescriptions": [
    "Boss Act (H.R. 3248/ S. 1850); S.3548 - CARES Act, Division C, Title I; promoting the interests of The Coalition to Rescue American Event Workers",
    "Boss Act (H.R. 3248/ S. 1850); H.R. 748 - CARES Act; promoting the interests of The Coalition to Rescue American Event Workers",
    "Boss Act (H.R. 3248/S.1850); SOS Act (H.R. 7806/S.4258); promoting the interests of The Coalition to Rescue American Event Worker.",
    "H.R.5827 - Protecting Outdoor Concerts Act",
    "Issues relating to outdoor advertising displays",
    "Issues relating to competition in the live event ticketing industry",
    "Issues related to live event ticketing industry; TICKET ACT (S.1303 / H.R. 3950), all provisions relating to transparency, speculative ticketing, and competition issues; Fans First Act (S.3457), all provisions related to transparency, speculative ticketing, and competition issues; Unlock Ticketing Markets Act (S. 1321 / S.1326), all provisions relating to transparency, speculative ticketing, and competition issues; and BOSS and SWIFT Act (S. 2975 / H.R. 3660), all provisions relating to transparency, speculative ticketing, and competition issues; Speculative Ticketing Oversight and Prohibition Act (H.R. 6568), all provisions related to transparency, speculative ticketing, and competition issues",
    "Issues related to drones and flight restrictions for outdoor concert venues.",
    "Issues related to drones and flight restriction for outdoor concert venues",
    "Issues related to live event ticketing industry; TICKET ACT (S.1303 / H.R. 3950) all provision relating transparency, speculative ticketing",
    "Issues related to live event ticketing industry; TICKET ACT (S.1303 / H.R. 3950) all provision relating transparency, speculative ticketing; H.R.10445 Further Continuing Appropriations and Disaster Relief Supplemental Appropriations Act, 2025, all provisions relating to TITLE XV-TRANSPARENCY IN CHARGES FOR KEY EVENTS TICKETING",
    "Issues related to drones and flight restriction for outdoor concert venues; H.R.9949, Protecting Outdoor Concerts Act of 2024",
    "Issues related to the live event ticketing industry; TICKET Act (S. 430, S. 281, H.R. 1402), all provisions relating to transparency and speculative ticketing; MAIN Event Ticketing Act (S. 196), all provisions related to BOTs Act obligations and enforcement; issues related to Department of Justice nominations",
    "Issues related to manned and unmanned flight restrictions; Protecting Outdoor Concert Act (H.R. 9949, 118th Congress), all provisions related to manned flight restrictions",
    "Issues related to the live ticketing industry; TICKET Act (S. 430, S. 281, H.R. 1402), all provisions relating to transparency and speculative ticketing; MAIN Event Ticketing Act (S. 196, H.R. 2713), all provisions related to BOTs Act obligations and enforcement; issues related to Department of Justice nominations",
    "Issues related to manned and unmanned flight restrictions, Protecting Outdoor Concert Act (H.R. 2887), all provisions related to manned flight restrictions."
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -42,
  "trajectory": "reducing",
  "yearsActive": 6,
  "avgAnnualSpending": 273333,
  "peakYear": 2023,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 6,
  "industry": "technology"
}