{"id":199154,"name":"APPLE INC.","slug":"apple-inc","state":"DC","description":"Consumer Electronics, Computer Software, Personal Computers","totalSpending":2170000,"filings":23,"yearlySpending":[{"year":2018,"income":360000},{"year":2019,"income":360000},{"year":2020,"income":360000},{"year":2021,"income":90000},{"year":2022,"income":280000},{"year":2024,"income":360000},{"year":2025,"income":360000}],"firms":["FIERCE GOVERNMENT RELATIONS"],"lobbyists":["WILLIAM BLALOCK","MICHAEL CHAPPELL","KIRSTEN CHADWICK","ALEIX JARVIS","KATE HULL","WILLIAM PIPER","TYLER STEPHENS","ERIC ZULKOSKY","PATRICK CLIFTON","JACOBUS VREEBURG"],"issues":["CPI","CSP","TAX","TRD","IMM","LBR","TRA","TEC"],"sampleDescriptions":["Cyber-Security, Encryption, S. 1693- Stop Enabling Sex Traffickers Act of 2017, International data sharing issues","Responding to Congressional inquires regarding battery performance in certain products","Repatriation","General System Preferences, S. 2108- Miscellaneous Tariff Bill Act of 2017","Immigration Reform","Cyber-Security, Encryption,International data sharing issues, Issues related to electronic health records, Privacy","International Tax","Issues related to workforce development, Administration proposals to increase worker training","Cyber-Security, Encryption,International data sharing issues, Issues related to electronic health records, Privacy, Issues related to standard essential patents","Cyber-Security, Encryption,International data sharing issues, Issues related to electronic health records, Privacy, Issues related to standard essential patents, Supply Chain, 5G","Cyber-security, Encryption, International data sharing issues, Issues related to electronic health records, Privacy, Issues related to standard essential patents, Supply Chain, 5G, S. 2- Fair Trade with China Enforcement Act","Cyber-security, Encryption, Privacy, Issues related to standard essential patents and patent litigation, Supply Chain, Competition issues related to digital services","China Tariffs","Cyber-security, Encryption, Privacy, Issues related to standard essential patents and patent litigation, Supply Chain, Competition issues related to digital services, Issues related to Export Control Regulations","Cyber-security, Encryption, Privacy, Issues related to standard essential patents and patent litigation, Supply Chain, Competition issues related to digital services, Market access issues","Autonomous Vehicles","S. 386- Fairness for High-Skilled Immigrants Act of 2019","Encryption, Supply Chain and Supplier Responsibility, S. 3398- EARN IT Act of 2020","Supply Chain and Supplier Responsibility, COVID-19 Response, Contact Tracing, S. 3649-ORE Act, S. 4049- National Defense Authorization Act, Semiconductor Manufacturing, S. 3933- A bill to restore American leadership in semiconductor manufacturing by increasing Federal incentives in order to enable advanced research and development, secure the supply chain, and ensure long-term national security and economic competitiveness, Privacy, App Store","Issues related to spectrum allocations"],"years":[2018,2019,2020,2021,2022,2024,2025]}