{"id":144309,"name":"ASTCT","slug":"astct","state":"DC","description":"Healthcare Society","totalSpending":1590000,"filings":29,"yearlySpending":[{"year":2019,"income":200000},{"year":2020,"income":300000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2023,"income":200000},{"year":2024,"income":210000},{"year":2025,"income":280000}],"firms":["SMITHBUCKLIN CORPORATION"],"lobbyists":["ALYCIA MALONEY","MOLLY FORD"],"issues":["MMM","GOV","EDU","PHA","HCR","INS","MED",null],"sampleDescriptions":["Healthcare, Medicare, CMS, hospital policy, insurance, education, research","CMS coding and billing clarity for CAR-T therapies; CMS engagement on National Coverage Decision for CAR-T therapies","Appropriations, CAR-T Therapy clarification","ASTCT appropriations; billing and coding; CAR-T Therapy clarifications","Appropriations, CAR-T Therapy clarification\nH.R. 2498, the PACT Act","CMS coding and billing clarity for CAR-T therapies; CMS engagement on National Coverage Decision for CAR-T therapies\nH.R. 2498, the PACT Act","ASTCT appropriations; billing and coding; CAR-T Therapy clarifications\nH.R. 2498, the PACT Act","CMS coding and billing clarity for CAR-T therapies; CMS engagement on FY2021 new DRG for CAR-T Therapies\n\nH.R. 2498, the PACT Act","CMS coding and billing clarity for CAR-T therapies; CMS engagement on FY2021 new DRG for CAR-T Therapies","CMS coding and billing clarity for CAR-T therapies; CMS engagement and follow up on FY2021 new MS-DRG for CAR-T Therapies","Appropriations, CAR-T Therapy clarification, Cures 2.0 Engagement","ASTCT appropriations; billing and coding; CAR-T Therapy clarifications, Cures 2.0 engagement","ASTCT Appropriations\nBilling and Coding\nCAR-T Therapy Clarifications\nCures 2.0 Engagement\nRevaccination of Immunosuppressed Patients","ASTCT Appropriations Billing and Coding CAR-T Therapy Clarifications Cures 2.0 Engagement Revaccination of Immunosuppressed Patients","ASTCT Appropriations Billing and Coding CAR-T Therapy Clarifications Cures 2.0 Engagement Revaccination of Immunosuppressed Patients Covid funding Patient-Care Episode Financial Toxicity","CMS coding and billing clarity for CAR-T therapies; CMS engagement and follow up on FY2021 new MS-DRG for CAR-T Therapies Covid funding, Patient Care Episode, Financial Toxicity","ASTCT Appropriations Billing and Coding CAR-T Therapy Clarifications Cures 2.0 Engagement Revaccination of Immunosuppressed Patients Covid funding Patient-Care Episode Financial Toxicity Cancer Moonshot","- CMS coding and billing clarity for CAR-T therapies - CMS engagement and follow up on FY2021 new MS-DRG for CAR-T Therapies - Covid funding - Patient Care Episode - Financial Toxicity - Cancer Moonshot","- Appropriations - CAR-T Therapy clarification - Cures 2.0 Engagement - Cancer Moonshot","ASTCT Appropriations Billing and Coding CAR-T Therapy Clarifications Cures 2.0 Engagement Revaccination of Immunosuppressed Patients Patient-Care Episode Financial Toxicity NIH Funding Cancer Moonshot Donor Leave Act The Accelerating Kids Access to Care Act Alleviating Barriers to Care Act"],"years":[2019,2020,2021,2022,2023,2024,2025]}