{
  "id": 184541,
  "name": "AT&T SERVICES, INC.",
  "slug": "at-t-services-inc",
  "state": "DC",
  "description": "Telecommunications issues",
  "totalSpending": 2400000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 120000
    },
    {
      "year": 2019,
      "income": 170000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "CAPITOL COUNSEL LLC"
  ],
  "lobbyists": [
    "WARREN TRYON",
    "JENNIFER DEBES BANG",
    "JOSEPH EANNELLO",
    "LYNDON BOOZER",
    "ROBERT DIAMOND",
    "GENEVIEVE BELTRONE",
    "JEFFREY CARROLL"
  ],
  "issues": [
    "FIN",
    "TRD",
    "TAX",
    "TEC",
    null,
    "BUD"
  ],
  "sampleDescriptions": [
    "General issues related to telecommunication and set-top box proposal.",
    "Monitoring trade related issues.",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY 20.",
    "Monitoring tax related issues.",
    "Issues related to implementation of the  First Responder Network; intellectual property and  deployment of 5G communication services.  Issues related to net neutrality, privacy and STELA reauthorization (Satellite Television Extension and Localism Act).",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY 2021.",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY2022.",
    "Issues related to implementation of the  First Responder Network; intellectual property and  deployment of 5G communication services.",
    "Issues related to implementation of the First Responder Network; intellectual property and deployment of 5G communication services.",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY2023.",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY2024.",
    "Advocacy for Affordable Connectivity Program appropriations",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY2025.",
    "General issues related to telecommunications; issues related to televisions and telecommunications and the Financial Services and General Government appropriations bill FY2025 (H.R.8773/S. 4928).",
    "Advocacy for Affordable Connectivity Program appropriations.",
    "Issues related to implementation of the First Responder Network; intellectual property and deployment of 5G communication services. Advocacy for Affordable Connectivity Program.",
    "Advocacy for Affordable Connectivity Program appropriations. Issues Related to the implementation of the First Responder Network.",
    "General issues related to telecommunications; issues related to televisions and telecommunications, and the FY2026 Financial Services and General Government appropriations bill.",
    "Monitoring tax-related issues.",
    "Issues related to the implementation of the First Responder Network."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 100,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 216250,
  "peakYear": 2020,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 5
}