{"id":147574,"name":"ATHENAHEALTH, INC.","slug":"athenahealth-inc","state":"MA","description":"Provider practice management and electronic medical record software and services.","totalSpending":1415000,"filings":29,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":150000},{"year":2021,"income":200000},{"year":2022,"income":150000},{"year":2023,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":115000}],"firms":["VAN NESS FELDMAN, LLP"],"lobbyists":["JORDAN SMITH","JAMES BAYOT","NANCY MCNALLY"],"issues":["BUD","HCR",null],"sampleDescriptions":["Issues pertaining to the role of the Office of the National Coordinator for Health Information Technology (ONC) in the marketplace","Issues related to health information technology, including interoperability, care coordination, information blocking, certification, the Meaningful Use program and implementation of the Merit-Based Incentive Payment System (MIPS); Issues pertaining to Stark Law and Anti-Kickback Statute Reform; Issues related to use of Medicare claims data.","Issues pertaining to the role of the Office of the National Coordinator for Health Information Technology (ONC) in the marketplace.","Issues related to health information technology, including interoperability, care coordination, information blocking, and certification.","S1512 / HR 2903 \"CONNECT for Health Act of 2021,\" all provisions. Issues pertaining to the implementation of Public Law No: 114-255 \"21st Century Cures Act,\" all provisions relating to the role of health information technology in care coordination, interoperability, information blocking, and certification. Issues pertaining to the implementation of Public Law No: 114-10 \"Medicare Access and CHIP Reauthorization Act of 2015,\" all provisions relating to implementation of the Merit-Based Incentive Payment System (MIPS) and Advanced Payment Models (APMs). Issues pertaining to data privacy bills and hearings. Issues pertaining to the role of the Office of the National Coordinator for Health Information Technology (ONC) and the health IT industry. HR 2474 \"Strengthening Medicare for Patients and Providers Act,\" all provisions relating to Medicare Physician Medicare Physician Fee Schedule.","S1512 / HR 2903 \"CONNECT for Health Act of 2021,\" all provisions. Issues pertaining to the implementation of Public Law No: 114-255 \"21st Century Cures Act,\" all provisions relating to the role of health information technology in care coordination, interoperability, information blocking, and certification. Issues pertaining to the implementation of Public Law No: 114-10 \"Medicare Access and CHIP Reauthorization Act of 2015,\" all provisions relating to implementation of the Merit-Based Incentive Payment System (MIPS) and Advanced Payment Models (APMs). Issues pertaining to data privacy bills and hearings. Issues pertaining to the role of the Office of the National Coordinator for Health Information Technology (ONC) and the health IT industry. HR 2474 \"Strengthening Medicare for Patients and Providers Act,\" all provisions relating to Medicare Physician Medicare Physician Fee Schedule. - Issues pertaining to artificial intelligence in healthcare.","Issues pertaining to the implementation of Public Law No: 114-10 \"Medicare Access and CHIP Reauthorization Act of 2015,\" all provisions relating to implementation of the Merit-Based Incentive Payment System (MIPS) and Advanced Payment Models (APMs). Issues pertaining to the role of the Office of the National Coordinator for Health Information Technology (ONC) and the health IT industry. HR 2474 \"Strengthening Medicare for Patients and Providers Act,\" all provisions relating to Medicare Physician Fee Schedule. S 4935 \"Physician Fee Stabilization Act,\" all provisions relating to Medicare Physician Fee Schedule. S. 4862 \"A bill to ensure that new advances in artificial intelligence are ethically adopted to improve the health of all individuals, and for other purposes,\" all provisions.","Issues pertaining to the implementation of Public Law No: 114-10 \"Medicare Access and CHIP Reauthorization Act of 2015,\" all provisions relating to implementation of the Merit-Based Incentive Payment System (MIPS) and Advanced Payment Models (APMs). Issues pertaining to the role of the Office of the National Coordinator for Health Information Technology (ONC) and the health IT industry. H.R. 879, Medicare Patient Access and Practice Stabilization Act, all provisions relating to Medicare Physician Fee Schedule."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}