{
  "id": 136832,
  "name": "ATRIUM HEALTH WAKE FOREST BAPTIST",
  "slug": "atrium-health-wake-forest-baptist",
  "state": "NC",
  "description": "Private University",
  "totalSpending": 2150000,
  "filings": 19,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 480000
    },
    {
      "year": 2019,
      "income": 390000
    },
    {
      "year": 2020,
      "income": 520000
    },
    {
      "year": 2021,
      "income": 440000
    },
    {
      "year": 2022,
      "income": 320000
    }
  ],
  "firms": [
    "SQUIRE PATTON BOGGS"
  ],
  "lobbyists": [
    "CHARLES BRERETON",
    "BETH GOLDSTEIN",
    "KATHRYN NOVARIA",
    "AUBREY ROTHROCK",
    "KAMERON SIMMONS",
    "KARA-MARIE URBAN"
  ],
  "issues": [
    "BUD",
    "HCR"
  ],
  "sampleDescriptions": [
    "FY 18 budget and appropriations relating to transportation and infrastructure projects for Piedmont Triad Research Park.",
    "Issues related to healthcare reform legislation and regulatory implementation; pediatric trauma and brain injury issues.",
    "FY 19 budget and appropriations relating to transportation and infrastructure projects for Piedmont Triad Research Park.",
    "FY 20 budget and appropriations relating to transportation and infrastructure projects for Piedmont Triad Research Park.",
    "FY 21 budget and appropriations relating to transportation and infrastructure projects for Piedmont Triad Research Park.",
    "Issues related to healthcare reform legislation and regulatory implementation.",
    "FY 22 budget and appropriations relating to transportation and infrastructure projects for Piedmont Triad Research Park.",
    "FY 23 budget and appropriations relating to transportation and infrastructure projects for Piedmont Triad Research Park.",
    "FY 2023 Community Project Funding and Congressionally Directed Spending for health and infrastructure projects in North Carolina and Georgia."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022
  ],
  "growthRate": -33,
  "trajectory": "reducing",
  "yearsActive": 5,
  "avgAnnualSpending": 430000,
  "peakYear": 2020,
  "lobbyistCount": 6,
  "firmCount": 1,
  "issueCount": 2,
  "industry": "healthcare"
}