{"id":208033,"name":"BATTERY MATERIALS AND TECHNOLOGY COALITION","slug":"battery-materials-and-technology-coalition","state":"DC","description":"a coalition of companies working on battery materials and technologies in North America.","totalSpending":1440000,"filings":15,"yearlySpending":[{"year":2020,"income":50000},{"year":2021,"income":320000},{"year":2022,"income":420000},{"year":2024,"income":280000},{"year":2025,"income":370000}],"firms":["VENN STRATEGIES"],"lobbyists":["ERIK OLSON","BENJAMIN STEINBERG","MATTHEW SCOTT","EMMA BISHOP","CARLY GOOD","DOUG MACGILLIVRAY","CHARLES LEVINGS","ANDREW THEUT"],"issues":["TRD","AUT","NAT","FOR","MAN","TRA","DEF","TAX"],"sampleDescriptions":["Matters related to the extraction, processing, and manufacturing of battery materials and associated technologies for the transportation and industrial markets in North America.","Matters related to the extraction, processing, and manufacturing of battery materials and associated technologies for the transportation and industrial markets in North America, including the President's Executive Order on America's supply chains and the American Jobs Plan.","Matters related to the extraction, processing, and manufacturing of battery materials and associated technologies for the transportation and industrial markets in North America, including the President's Executive Order on America's supply chains and the Infrastructure Innovation and Jobs Act.","Matters related to the extraction, processing, and manufacturing of battery materials and associated technologies for the transportation and industrial markets in North America and abroad, including the President's Executive Order on America's supply chains and the Infrastructure Innovation and Jobs Act.","Matters related to the extraction, processing, and manufacturing of battery materials and associated technologies for the transportation and industrial markets in North America and abroad.","Engaged agencies on battery supply chain trade priorities, including advocacy for support of domestic battery material production.","Advocating for credits that support the domestic battery supply chain, including protecting and modifying existing investment and production tax credits, and creating new credits for the sector.","Matters related to the promotion of extraction, processing, recycling, and manufacturing of battery materials and associated technologies in North America and abroad.","Matters related to the extraction, processing, recycling, and manufacturing of battery materials and technologies for the defense and industrial base economy, including advocacy on the reconciliation package.","Matters related to trade policy supporting the domestic, Canadian, and allied markets for the battery supply chain.","Matters related to protecting and modifying tax credits for the battery supply chain, critical minerals, and associated technologies, including informing the related tax provisions included in the One Big Beautiful Bill Act (OBBBA).","Matters related to the securing the battery supply chain for the defense and industrial base economy, including advocacy on non-Foreign Entity of Concern content requirements.","Matters related to implementing the One Big Beautiful Bill (OBBBA) tax credits for the battery supply chain, critical minerals, and associated technologies."],"years":[2020,2021,2022,2024,2025]}