{"id":193820,"name":"BAVARIAN NORDIC INC.","slug":"bavarian-nordic-inc","state":"DC","description":"Biotechnology pharmaceutical product discovery and development.","totalSpending":1215000,"filings":25,"yearlySpending":[{"year":2018,"income":90000},{"year":2019,"income":135000},{"year":2020,"income":180000},{"year":2021,"income":135000},{"year":2022,"income":270000},{"year":2024,"income":225000},{"year":2025,"income":180000}],"firms":["EAST END GROUP, LLC"],"lobbyists":["MICHAEL WOODY","ANDREW HAWKINS","DAVID MOHLER","KELLY CHILDRESS LANGE"],"issues":["HCR"],"sampleDescriptions":["General health care coverage and reimbursement for prescription drugs; Regulatory issues related to biodefense vaccine development and procurement; Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act; and the Food and Drug Administration legislative and regulatory issues.","General health care coverage and reimbursement for prescription drugs; Regulatory issues related to biodefense vaccine development and procurement; H.R. 6378, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2018; Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act; and the Food and Drug Administration legislative and regulatory issues.","The re-authorization of the Pandemic and All-Hazards Preparedness Act. Funding for the Biomedical Advanced Research and Development Authority in the LHHS Appropriations bill.","Legislatives issues related to biodefense preparedness and response. Funding for the Biomedical Advanced Research and Development Authority in the LHHS Appropriations bill.","Legislatives issues related to biodefense preparedness and response. Funding for the Biomedical Advanced Research and Development Authority in the LHHS Appropriations bill and Supplemental Appropriations.","Legislatives issues related to biodefense preparedness and response, and the reauthorization of the Pandemic and All-Hazards Preparedness Act. Funding for the Biomedical Advanced Research and Development Authority in the LHHS Appropriations bill.","Legislatives issues related to biodefense preparedness and response. Reauthorization of the Pandemic and All-Hazards Preparedness Act. Funding for the Biomedical Advanced Research and Development Authority in the LHHS Appropriations bill and Supplemental Appropriations."],"years":[2018,2019,2020,2021,2022,2024,2025]}