{
  "id": 178507,
  "name": "BAXTER HEALTHCARE CORPORATION",
  "slug": "baxter-healthcare-corporation",
  "state": "IL",
  "description": null,
  "totalSpending": 1610000,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 180000
    },
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 260000
    },
    {
      "year": 2025,
      "income": 220000
    }
  ],
  "firms": [
    "THE NICKLES GROUP, LLC"
  ],
  "lobbyists": [
    "DONALD KENT",
    "RACHEL JONES HENSLER",
    "MARY SAVARY TAYLOR",
    "EMILY PORTER",
    "KATHERINE RAAB",
    "JEFF CHOUDHRY",
    "GREG D'ANGELO",
    "BRETT BAKER",
    "MOLLY FROMM"
  ],
  "issues": [
    "HOM",
    "TAX",
    "HCR",
    "BUD",
    "MMM",
    "VET",
    "GOV",
    "LBR",
    null,
    "TRD"
  ],
  "sampleDescriptions": [
    "Disaster recovery infrastructure issues related to the hurricanes.",
    "Monitor implementation of H.R. 1, The Tax Cut and Jobs Act, and issues related to corporate tax reform and the taxation of U.S. multinational corporations. Issues related to Puerto Rico. Issues related to the medical device tax.",
    "Monitored issues related to pharmaceutical prices. H.R. 1625, Consolidated Appropriations Act of 2018. H.R. 1892, Bipartisan Budget Act of 2018. Issues related to the Puerto Rico recovery efforts. Issues related to ESRD payment.",
    "H.R. 1892, Bipartisan Budget Act of 2018, H.R. 1625, Consolidated Appropriations Act of 2018 and issues related to telehealth and remote monitoring of patients.",
    "S. 870, Creating High-Quality Results and Outcomes Necessary to Improve Chronic Care Act of 2017, H.R. 3178, Medicare Part B Improvement Act of 2017, H.R. 1892, Bipartisan Budget Act of 2018 and issues regarding care for chronic diseases, including telehealth issues such as home as originating site and remote monitoring of home dialysis patients. Issues related to ESRD PPS. H.R. 1625, Consolidated Appropriations Act of 2018.",
    "Issues related to ESRD PPS and innovative device reimbursement policies.",
    "Monitor implementation of The Tax Cut and Jobs Act as it relates to corporate tax reform and the taxation of U.S. multinational corporations. Issues related to Puerto Rico. Issues related to the medical device tax.",
    "Monitored issues related to pharmaceutical prices. Issues related to the Puerto Rico recovery efforts. Issues related to ESRD payment. H.R. 6, SUPPORT for Patients and Communities Act, S. 2680, Opioid Crisis Response Act of 2018. Issues related to Pandemic and All-Hazards Preparedness and S. 2852, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2018 (PAHPAI); monitored issues involving drug shortages. Issues regarding the Strategic National Stockpile inventory.",
    "Monitor implementation of The Tax Cut and Jobs Act as it relates to corporate tax reform and the taxation of U.S. multinational corporations. Issues related to the medical device tax.",
    "Monitored issues related to pharmaceutical prices. Issues related to the Puerto Rico recovery efforts. Issues related to ESRD payment. H.R. 6, SUPPORT for Patients and Communities Act, S. 2680, Opioid Crisis Response Act of 2018. Issues related to Pandemic and All-Hazards Preparedness and S. 2852 / H.R. 6378, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2018 (PAHPA); monitored issues involving drug shortages. Issues regarding the Strategic National Stockpile inventory.",
    "Monitored H.R. 6157, Department of Defense and Labor, Health and Human Services, and Education Appropriations Act and Continuing Appropriations Act. Monitored H.R. 695, Further Additional Continuing Appropriations Act of 2019",
    "Monitor implementation of The Tax Cut and Jobs Act as it relates to corporate tax reform and the taxation of U.S. multinational corporations. H.R. 88, as it relates to the medical device tax moratorium.",
    "Monitored issues related to pharmaceutical prices. Monitored issues related to H.R 7217, IMPROVE Act. Issues related to ESRD payment. H.R. 6, SUPPORT for Patients and Communities Act, S. 2680, Opioid Crisis Response Act of 2018. Issues related to Pandemic and All-Hazards Preparedness, S. 2852 / H.R. 6378, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2018 (PAHPA); monitored issues involving drug shortages. Issues regarding the Strategic National Stockpile inventory. Issues related to home dialysis.",
    "Monitored issues related to pharmaceutical prices. Issues related to ESRD payment. Issues related to Pandemic and All-Hazards Preparedness. H.R. 269, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2019 (PAHPA); monitored issues involving drug shortages. Issues regarding the Strategic National Stockpile inventory. Issues related to home dialysis.",
    "Monitored issues related to the conference report accompanying H.J.Res. 31.",
    "Monitor implementation of The Tax Cut and Jobs Act as it relates to corporate tax reform and the taxation of U.S. multinational corporations. S. 692, Protect Medical Innovation Act of 2019, as it relates to the medical device tax.",
    "Issues related to ESRD PPS and innovative device reimbursement policies. H.R. 2710, Patient Access to ESRD New Innovative Devices Act. Issues regarding dialysis in the home.",
    "Monitor implementation of The Tax Cut and Jobs Act as it relates to corporate tax reform and the taxation of U.S. multinational corporations. S. 692, Protect Medical Innovation Act of 2019 and H.R. 3301, Taxpayer Certainty and Disaster Tax Relief Act of 2019, as they relate to the medical device tax.",
    "Monitored issues related to pharmaceutical prices. Monitored H.R. 2296, METRIC Act of 2019. Issues related to ESRD payment. H.R. 2710, Patient Access to ESRD New Innovative Devices Act. Issues related to Pandemic and All-Hazards Preparedness. S. 1379 / H.R. 269, Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2019 (PAHPA). S. 1895, Lower Health Care Costs Act of 2019. Issues involving drug shortages. Issues regarding the Strategic National Stockpile inventory. Issues related to home dialysis.",
    "Monitored H.R. 4378, the Continuing Appropriations Act of 2020, and Health Extenders Act of 2019."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 22,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 201250,
  "peakYear": 2024,
  "lobbyistCount": 9,
  "firmCount": 1,
  "issueCount": 9,
  "industry": "healthcare"
}