{"id":183681,"name":"BAY AREA RAPID TRANSIT DISTRICT","slug":"bay-area-rapid-transit-district","state":"CA","description":null,"totalSpending":1460000,"filings":25,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":180000},{"year":2024,"income":180000},{"year":2025,"income":200000}],"firms":["CJ LAKE, LLC"],"lobbyists":["EMILY BACQUE DA SILVA","LYNNETTE JACQUEZ","ANDREW LUND","PATRICK BYRNE","CURTIS ERDMANN","JOHN ASSINI","NADIAH COOPER","KEVIN FORGETT"],"issues":["LBR","DIS","HOM","TRA","TAX","BUD","LAW"],"sampleDescriptions":["Support DOL's workforce development funding in transit industry. Support S.862, The American Apprenticeship Act.","Support federal funding for earthquake early warning system, FY18 Interior Appropriations (HR 1625).","Support robust funding for FEMA Transit Security Grant funding. Support H.R. 549, the Transit Security Grant Flexibility Act. Oppose cuts to VIPR teams.","Support State of Good Repair and Core Capacity. Support funding for rail cars. Support Core Capacity project proposal. Support FAST Act Implementation.Oppose cuts in the President's FY18 budget related to the Capital Investment Grant program and other transportation programs. Support HR 549, Transit Security Grant Flexibility Program Act. Support passage of an infrastructure package that includes funding for transit.","Support HR 1664, Investing in America: A Penny for Progress Act. Support HR 1670, The Infrastructure 2.0 Act.","FY18 (HR 1625) Transportation HUD appropriations bill, support funding for purchase of rail cars, support funding for core capacity grants.\nFY18 (HR 1625) Homeland Security appropriations bill, support funding for Transit Security grants, oppose cuts to VIPR funding.\nFY18 (HR 1625) Interior & Environment appropriations bill, support funding for Earthquake Early Warning System.\nFY18 (HR 1625) Commerce, Justice, Science appropriations bill, support use of COPS funding for technology.\nOppose cuts in the President's FY18 budget related to the Departments of Transportation, Justice, Homeland Security, and Interior.","Support State of Good Repair and Core Capacity. Support funding for rail cars. Support Core Capacity project proposal. Support FAST Act Implementation.Oppose cuts in the President's FY19 budget related to the Capital Investment Grant program and other transportation programs. Support HR 549, Transit Security Grant Flexibility Program Act. Support passage of an infrastructure package that includes funding for transit.","FY19 (HR 6072) Transportation HUD appropriations bill, support funding for purchase of rail cars, support funding for core capacity grants.\nFY19 Homeland Security appropriations bill, support funding for Transit Security grants, oppose cuts to VIPR funding.\nFY19 (HR 6147) Interior & Environment appropriations bill, support funding for Earthquake Early Warning System.\nOppose cuts in the President's FY19 budget related to the Departments of Transportation, Justice, Homeland Security, and Interior.","Support federal funding for earthquake early warning system, FY19 Interior Appropriations (HR 6147).","FY19 (HR 6147) Transportation HUD appropriations bill, support funding for purchase of rail cars, support funding for core capacity grants.\nFY19 (HR 6776) Homeland Security appropriations bill, support funding for Transit Security grants, oppose cuts to VIPR funding.\nFY19 (HR 6147) Interior & Environment appropriations bill, support funding for Earthquake Early Warning System.\nOppose cuts in the President's FY19 budget related to the Departments of Transportation, Justice, Homeland Security, and Interior.","Support federal funding for earthquake early warning system, FY20 Interior appropriations.","Support DOL's workforce development funding in transit industry.","Support State of Good Repair and Core Capacity. Support funding for rail cars. Support Trans Bay Core Capacity project proposal. Support FAST Act implementation. Oppose cuts in the President's FY20 budget related to the Capital Investment Grant program and other transportation programs. Support passage of an infrastructure package that includes funding for transit.","FY20 Transportation HUD appropriations bill, support funding for purchase of rail cars, support funding for core capacity grants.\nFY20 Homeland Security appropriations bill, support funding for Transit Security grants, oppose cuts to VIPR funding.\nFY20 Interior and Environment appropriations bill, support funding for Earthquake Early Warning System.\nOppose cuts in the President's FY20 budget related to the Departments of Transportation, Justice, Homeland Security and Interior.","Support robust funding for FEMA Transit Security Grant funding. Support the Transit Security Grant Flexibility Act. Oppose cuts to VIPR teams.","Support federal funding for earthquake early warning system, FY20 Interior appropriations (H.R. 3055).","FY20 Transportation HUD appropriations bill (H.R. 3055), support funding for purchase of rail cars, support funding for core capacity grants.\nFY20 Homeland Security appropriations bill, support funding for Transit Security grants, oppose cuts to VIPR funding.\nFY20 Interior and Environment appropriations bill (H.R. 3055), support funding for Earthquake Early Warning System.\nOppose cuts in the President's FY20 budget related to the Departments of Transportation, Justice, Homeland Security and Interior.","Support DOL's workforce development funding in transit industry. Support certification of employee protective provisions of transit grants.","Support robust funding for FEMA Transit Security Grant funding. Support the Transit Security Grant Flexibility Act. Oppose cuts to VIPR teams. Support BART application for FY19 TSGP funding.","Support State of Good Repair and Core Capacity. Support funding for rail cars. Support Trans Bay Core Capacity project proposal. Support FAST Act implementation. Oppose cuts in the President's FY21 budget related to the Capital Investment Grant program and other transportation programs. Support passage of an infrastructure package that includes funding for transit."],"years":[2018,2019,2020,2021,2022,2024,2025]}