{
  "id": 171543,
  "name": "BECHTEL NATIONAL, INC.",
  "slug": "bechtel-national-inc",
  "state": "VA",
  "description": "global engineering, procurement, and construction company",
  "totalSpending": 1680000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 180000
    },
    {
      "year": 2020,
      "income": 180000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 300000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 300000
    }
  ],
  "firms": [
    "OWEN EVANS INGOLS"
  ],
  "lobbyists": [
    "ADAM INGOLS",
    "BRUCE EVANS",
    "DARYL OWEN"
  ],
  "issues": [
    "ENG",
    "DIS",
    "DEF",
    null
  ],
  "sampleDescriptions": [
    "Issues associated with nuclear power; issues associated with the DOE environmental management program; issues associated with the DOE laboratory complex",
    "Issues associated with the Waste Treatment Plant at Hanford; issues related to nuclear energy R&D; H.R. 2740 - Energy and Water Appropriations",
    "Issues associated with the Waste Treatment Plant at Hanford; issues related to nuclear energy R&D; H.R. 2960 & S. 2470 - Energy & Water Development appropriations, 2020",
    "Issues related to infrastructure recovery and restoration",
    "Issues associated with the Waste Treatment Plant at Hanford; issues related to nuclear energy R&D; H.R. 1865, Domestic Priorities and International Assistance Appropriations Minibus, and H.R. 1158, National Security Appropriations Minibus",
    "Issues associated with the Waste Treatment Plant at Hanford; issues related to nuclear energy R&D; H.R.6201 - Families First Coronavirus Response Act; H.R.748 - CARES Act",
    "Issues related to the operation and management of the national laboratory complex and the DOE environmental management program, particularly the Waste Treatment Plant in Hanford, WA; issues related to infrastructure development;\nHR 7613 - Energy and Water Development appropriations and Senate companion legislation",
    "Issues related to the operation and management of the national laboratory complex and the DOE environmental management program, particularly the Waste Treatment Plant in Hanford, WA; issues related to infrastructure development;\nHR 7613 - Energy and Water Development appropriations and Senate companion legislation; issues related to SCADA system security",
    "Relevant Issues related to H.R.1319 - American Rescue Plan Act of 2021; general issues concerning energy (particularly commercial nuclear) infrastructure and environmental restoration activities.",
    "General issues concerning energy (particularly commercial nuclear) infrastructure and environmental restoration activities; House and Senate Energy and Water Development appropriations bills",
    "Issues associated with House and Senate CJS appropriations",
    "Issues associated with House and Senate CJS appropriations (HR 4505 and Senate companion)",
    "General issues concerning energy infrastructure and environmental restoration activities; issues involving Department of Energy test reactors; House and Senate Energy and Water Development appropriations bills (HR 4549 and S. 2605)",
    "General issues concerning energy infrastructure and environmental management and restoration activities; issues involving Department of Energy test reactors; House and Senate Energy and Water Development appropriations bills (HR 4549 and S. 2605)",
    "General issues concerning energy infrastructure and environmental management and restoration activities; issues related to federal financial support programs via the Infrastructure Investment and Jobs Act",
    "Issues associated with engineering projects and House and Senate CJS appropriations",
    "General issues concerning energy infrastructure and environmental management and restoration activities; issues related to federal financial support programs via the Infrastructure Investment and Jobs Act; issues related to HR 2471 - Consolidated Appropriations Act for FY 2022",
    "Issues associated with engineering projects and House and Senate CJS appropriations; issues related to HR 2471 - Consolidated Appropriations Act for FY 2022",
    "General issues concerning energy infrastructure and environmental management and restoration activities; issues related to federal financial support programs via the Infrastructure Investment and Jobs Act; issues related to House and Senate Energy and Water Appropriations (HR. 8255 and the Senate companion)",
    "Issues associated with engineering projects and NASA launch systems; House and Senate Commerce, Science, and Justice Appropriations (HR 8256 and Senate companion)"
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 67,
  "trajectory": "growing",
  "yearsActive": 7,
  "avgAnnualSpending": 240000,
  "peakYear": 2022,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 3
}