{"id":184466,"name":"BIOTECHNOLOGY INNOVATION ORGANIZATION (FORMERLY BIOTECHNOLOGY INDUSTRY ORG.)","slug":"biotechnology-innovation-organization-formerly-biotechnology-industry-org","state":"DC","description":"Represent organizations that promote research and support growth of biotechnology industry","totalSpending":1850000,"filings":29,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":200000},{"year":2020,"income":280000},{"year":2021,"income":360000},{"year":2022,"income":250000},{"year":2023,"income":200000},{"year":2024,"income":290000},{"year":2025,"income":150000}],"firms":["CAPITOL COUNSEL LLC"],"lobbyists":["SHANNON FINLEY","DAVID OLANDER","CHARLES FRENCH","DREW GOESL","DENISE HENRY MORRISEY","AARON COHEN","LUKE HATZIS","ANN JABLON","CAITLIN CANTER","JOSEPH EANNELLO","JEFFREY CARROLL","MICHELLE MATHY","JOHN MARTIN","ADAM CARASSO","CHARLES MICHAELS","KAREN STONE"],"issues":["TAX","HCR","MMM","TRD","BUD",null],"sampleDescriptions":["Legislative issues related to the implementation of tax reform, legislative provisions of H.R.6756, the American Innovation Act of 2018, and regulatory issues affecting innovation.","Patient access to biotechnology treatments.","Medicare Parts B and coverage and reimbursement issues for biotechnology treatments and issues related to the Medicare Part D coverage.","Medicare Part B coverage and reimbursement issues for biotechnology treatments and issues related to the Medicare Part D coverage.","Legislative issues related to the implementation of tax reform; regulatory issues affecting innovation.","Legislative issues related to the implementation of tax reform; legislative and regulatory issues affecting innovation.","Patient access to biotechnology treatments; Coronavirus response efforts, including related provisions in: (1) H.R. 6074, the Coronavirus Preparedness and Response Supplemental Appropriations Act; (2) H.R. 6201, the Families First Coronavirus Response Act; and (3) H.R. 748, the Coronavirus Aid, Relief, and Economic Security Act.","Legislative and regulatory issues affecting innovation; legislative issues related to  H.R.133 - Consolidated Appropriations Act, 2021.","Medicare Part B coverage and reimbursement issues for biotechnology treatments and issues related to the Medicare Part D coverage, CMS Most Favored Nation Model.","Patient access to biotechnology treatments; Coronavirus response efforts, including related provisions in: (1) H.R. 6074, the Coronavirus Preparedness and Response Supplemental Appropriations Act (P.L. 116-123); (2) H.R. 6201, the Families First Coronavirus Response Act (P.L. 116-127);  (3) H.R. 748 - Coronavirus Aid, Relief, and Economic Security (CARES) Act (P.L. 116-136);  (4) H.R.133 - Consolidated Appropriations Act, 2021 (P.L. 116-260); and (5) H.R. 1319, the American Rescue Plan Act (P.L. 117-2).","Legislative and regulatory issues affecting innovation; legislative issues related to  H.R.133 - Consolidated Appropriations Act, 2021 (P.L. 116-260).","Legislative and regulatory issues affecting innovation.","Issues related to TRIPS waivers (Trade-Related Aspects of Intellectual Property Rights).","Items related to USDA, FDA, genetic engineering, and regulations associated with biotechnology in the Agriculture/Rural Development/Food and Drug Administration proposed Appropriation measures for FY 2022","Items related to USDA, FDA, genetic engineering, and regulations associated with biotechnology in the Agriculture/Rural Development/Food and Drug Administration proposed Appropriation measures for FY 2023 (House/Senate).","Medicare Part B coverage and reimbursement issues for biotechnology treatments and issues related to the Medicare Part D coverage. Medicaid coverage issues.","Legislative and regulatory issues affecting innovation, including vaccines.","Items related to USDA, FDA, genetic engineering, and regulations associated with biotechnology in the Agriculture/Rural Development/Food and Drug Administration proposed Appropriation measures for FY 2024 (House/Senate).","Public health issues impacting patient access to treatments. Updates and reforms to regulation of treatment development and research.","Issues related to TRIPS waivers (Trade-Related Aspects of Intellectual Property Rights) and supply chain resiliency."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}