{"id":172555,"name":"BLACKROCK FUNDS SERVICES GROUP LLC (FORMERLY BLACKROCK CAPITAL MANAGEMENT INC.)","slug":"blackrock-funds-services-group-llc-formerly-blackrock-capital-management-inc","state":"NY","description":"Investment and risk management.","totalSpending":2120000,"filings":30,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":160000},{"year":2020,"income":320000},{"year":2021,"income":240000},{"year":2022,"income":500000},{"year":2024,"income":240000},{"year":2025,"income":420000}],"firms":["RICH FEUER ANDERSON"],"lobbyists":["PETER RICH","MITCHELL FEUER","JOHN ANDERSON","ALEX TEEL","SARAH BROWN","ANDREW PALMER","THOMAS KOONCE","JARED SAWYER","AMANDA SLATER","RASHAWN MITCHELL","BEN HARNEY","JUSTIN SOK","STEVE DONALDSON"],"issues":["BAN","FIN","HOU","RET","TAX"],"sampleDescriptions":["Implementation of the \"Dodd-Frank Wall Street Reform and Consumer Protection Act,\" including fund naming provisions; S. 2155, the \"Economic Growth, Regulatory Relief, and Consumer Protection Act;\" H.R. 3093, the \"Investor Clarity and Bank Parity Act;\" and H.R. 10, the \"Financial CHOICE Act.\"  Regulation of asset managers as systemically important financial institutions.","Implementation of the \"Dodd-Frank Wall Street Reform and Consumer Protection Act,\" including international coordination of financial regulation; fund naming provisions; S. 2155, the \"Economic Growth, Regulatory Relief, and Consumer Protection Act;\" H.R. 3093, the \"Investor Clarity and Bank Parity Act;\" and H.R. 10, the \"Financial CHOICE Act.\"  Regulation of asset managers as systemically important financial institutions.  Regulation of exchange-traded funds.","Housing finance reform, including including operation of the Federal government-sponsored housing enterprises.","Legislative and regulatory issues pertaining to asset management.","Implementation of the \"Dodd-Frank Wall Street Reform and Consumer Protection Act,\" including fund naming provisions; S. 2155, the \"Economic Growth, Regulatory Relief, and Consumer Protection Act;\" H.R. 3093, the \"Investor Clarity and Bank Parity Act.\"Regulation of asset managers as systemically important financial institutions.  Regulation of money market funds, including H.R. 2319 and S. 1117, the \"Consumer Financial Choice and Capital Markets Protection Act of 2017.\"","Regulation of asset managers as systemically important financial institutions.  Regulation of money market funds, including H.R. 2319 and S. 1117, the \"Consumer Financial Choice and Capital Markets Protection Act of 2017.\"","Issues related to retirement security and savings, including retirement income products, retirement income disclosures, S.2526 and H.R.5282, the \"Retirement Enhancement and Savings Act of 2018,\" and S.3781, the \"Retirement Security and Savings Act of 2018.\"","Issues related to retirement security and savings, including retirement income products, retirement income disclosures, and H.R.1007, the \"Retirement Enhancement and Savings Act of 2019.\"","Regulation of asset managers as systemically important financial institutions.  Regulation of money market funds, including S.733, the \"Consumer Financial Choice and Capital Markets Protection Act of 2019.\"","Regulation of asset managers as systemically important financial institutions.  Regulation of money market funds, including S.733 and H.R.4492, the \"Consumer Financial Choice and Capital Markets Protection Act of 2019.\"","Regulation of asset managers as systemically important financial institutions.  Regulation of money market funds, including S.733 and H.R.4492, the \"Consumer Financial Choice and Capital Markets Protection Act of 2019.\"  Regulation of exchange-traded funds.","Issues related to retirement security and savings, including retirement income products, retirement income disclosures, H.R.1007, the \"Retirement Enhancement and Savings Act of 2019,\" S.972, the \"Retirement Enhancement and Savings Act of 2019,\" H.R. 1994, the \"SECURE Act,\" S.1431, the \"Retirement Security and Savings Act of 2019,\" S.1574, the \"Lifetime Income Disclosure Act,\" and H.R.397, the Rehabilitation for Multiemployer Plans Act.","Issues related to retirement security and savings, including retirement income products, and retirement income disclosures.","Regulation of asset management products and activities as systemically important.  Regulation of money market funds.","Regulation of asset management products and activities as systemically important.  Regulation of money market funds and exchange-traded funds.","Issues related to retirement security and savings, including retirement income products and retirement income disclosures and H.R.2594, the \"Securing a Strong Retirement Act of 2021.\"","Tax treatment of in-kind redemptions by registered investment companies.","Regulation of asset management products and activities as systemically important. Regulation of money market funds.","Regulation of asset management products and activities as systemically important. Regulation of money market funds and exchange-traded funds.","Regulation of asset management products and activities."],"years":[2018,2019,2020,2021,2022,2024,2025]}