{
  "id": 204575,
  "name": "BLOCK, INC.",
  "slug": "block-inc",
  "state": "CA",
  "description": "Financial services, merchant services aggregator and mobile payments",
  "totalSpending": 1680000,
  "filings": 21,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 320000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "CAPITOL TAX PARTNERS, LLP"
  ],
  "lobbyists": [
    "LAWRENCE WILLCOX",
    "JONATHAN TALISMAN",
    "RICHARD GRAFMEYER",
    "PATRICK HECK",
    "SARAH SHIVE",
    "WILLIAM DAVIS"
  ],
  "issues": [
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "Issues related to the CARES Act.",
    "Issues related to the CARES Act, H.R. 8406, the HEROES Act, and Amendment to S. 178, Health, Economic Assistance, Liability Protection, and Schools (HEALS) Act.",
    "Issues related to H.R. 133, Consolidated Appropriations Act, 2021.",
    "Legislative services related to issues in H.R. 1319, American Rescue Plan Act.",
    "Legislative services related to financial services tax issues.",
    "Legislative services related to financial services tax issues, H.R. 3684, Infrastructure Investment and Jobs Act, and H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14.",
    "Legislative services related to financial services tax issues, H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14, H.R. 6006, Keep Innovation in America Act, H.R. 6582 Virtual Currency Tax Fairness Act and legislation related to third party settlement organization information reporting requirements.",
    "Legislative services related to financial services tax issues, H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14, legislation related to third party settlement organization information reporting requirements, and virtual currency taxation.",
    "Legislative services related to financial services tax issues, H.R. 2617, Consolidated Appropriations Act, 2023, legislation related to third party settlement organization information reporting requirements, and virtual currency taxation.",
    "Legislative services related to financial services tax issues, legislation related to third party settlement organization information reporting requirements, virtual currency taxation, and H.R. 7024, Tax Relief for American Families and Workers Act of 2024.",
    "Legislative services related to financial services tax issues, legislation related to third party settlement organization information reporting requirements, virtual currency taxation, and H.R. 1882, Saving Gig Economy Taxpayers Act.",
    "Legislative services related to financial services tax issues, virtual currency taxation, and P.L. 119-21.",
    "Legislative and regulatory services related to financial services tax issues, virtual currency taxation, and implementation of P.L. 119-21."
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 6,
  "avgAnnualSpending": 280000,
  "peakYear": 2022,
  "lobbyistCount": 6,
  "firmCount": 1,
  "issueCount": 1
}