{"id":186702,"name":"BLOOD CANCER UNITED (FORMERLY REPORTED ASTHE LEUKEMIA AND LYMPHOMA SOCIETY)","slug":"blood-cancer-united-formerly-reported-asthe-leukemia-and-lymphoma-society","state":"DC","description":"Non profit dedicated to funding blood cancer research.","totalSpending":1540000,"filings":30,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":350000},{"year":2020,"income":100000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2023,"income":200000},{"year":2024,"income":160000},{"year":2025,"income":180000}],"firms":["KOUNTOUPES DENHAM CARR & REID, LLC"],"lobbyists":["LORI DENHAM","JULIE CARR","ROSE SULLIVAN (LISTED IN ERROR)","DENISE MOUSOURIS","MARY BEAL","DENISE NORTHRUP","LESLIE ZELENKO"],"issues":["MMM","PHA","BUD","HCR",null,"TAX"],"sampleDescriptions":["Issues related to Medicare Part D as related to blood cancer beneficiaries.","Issues related to the cost of care and protecting patient access to blood cancer treatment.  Issues related to specialty drug tiers.","Issues related to blood cancer research funding included in H. R. 1625, the Consolidated Appropriations Act of 2018.","Issues related to blood cancer research, diagnosis, treatment and cures including coverage and reimbursement of cancer treatment therapies and issues related to H. R.1409 the Cancer Drug Parity Act of 2017.  Issues related to patient protections for blood cancer patients.  Issues related to insurance market stabilization.  Issues related to pediatric cancer, including H. R. 820, the Childhood Cancer STAR Act.  Issues related to \"right-to-try\" legislation, including H. R. 878 and S.204 the Right to Try Act of 2017.","Issues related to blood cancer research funding included in the FY 2019 Labor-HHS and Department of Defense Appropriations Bills.","Issues related to blood cancer research, diagnosis, treatment and cures including coverage and reimbursement of cancer treatment therapies and issues related to H. R.1409 the Cancer Drug Parity Act of 2017.  Issues related to patient protections for blood cancer patients.  Issues related to insurance market stabilization.  Issues related to pediatric cancer, including H. R. 820, the Childhood Cancer STAR Act.  Issues related to \"right-to-try\" legislation, including H. R. 878 and S.204 the Right to Try Act of 2017.  Issues related to Health Savings Accounts.  Issues related to Short-Term Limited Duration health insurance plans.","Issues related to blood cancer research, diagnosis, treatment and cures including coverage and reimbursement of cancer treatment therapies and issues related to H. R.1409 the Cancer Drug Parity Act of 2017.  Issues related to patient protections for blood cancer patients.  Issues related to insurance market stabilization.  Issues related to pediatric cancer, including H. R. 820, the Childhood Cancer STAR Act, and it's Senate companion S.292, the Childhood Cancer Survivorship, Treatment Access, and Research Act of 2018. Issues related to Health Savings Accounts.  Issues related to Short-Term Limited Duration health insurance plans.","Issues related to blood cancer research, diagnosis, treatment and cures including coverage and reimbursement of cancer treatment therapies and issues related to H. R. 1409, the Cancer Drug Parity Act of 2017.  Issues related to patient protections for blood cancer patients.  Issues related to insurance market stabilization.  Issues related to pediatric cancer.","Issues related to blood cancer research funding included in the FY 2020 Labor-HHS and Department of Defense Appropriations Bills.","Issues related to blood cancer research, diagnosis, treatment and cures including coverage and reimbursement of cancer treatment therapies and issues related to H. R. 1730/S.741, the Cancer Drug Parity Act of 2019.  Issues related to patient protections for blood cancer patients.  Issues related to insurance market stabilization.  Issues related to pediatric cancer.","Issues related to a Medicare Part D out of pocket cap for beneficiaries, including a policy to smooth out-of-pocket costs.","Issues related to blood cancer research funding included in the FY 2020 Labor-HHS and Department of Defense Appropriations Bills.  H. R. 1865, the Further Consolidated Appropriations Act of 2020.","Issues related to blood cancer research, diagnosis, treatment and cures including coverage and reimbursement of cancer treatment therapies and issues related to H. R. 1730/S.741, the Cancer Drug Parity Act of 2019.  Issues related to patient protections for blood cancer patients.  Issues related to insurance market stabilization.  Issues related to pediatric cancer.  H. R. 1865, the Further Consolidated Appropriations Act of 2020.","Issues related to the cost of care and protecting patient access to blood cancer treatment.  Issues related to specialty drug tiers.\n\nNOTE:  NO HHS Contacts were made by Rose Sullivan.","Issues related to the cost of care and protecting patient access to blood cancer treatment.  Issues related to specialty drug tiers.\n\nNOTE:  NO HHS contacts was made by Rose Sullivan.","Issues related to the cost of care and protecting patient access to blood cancer treatment.  Issues related to specialty drug tiers.\n\nNOTE:  NO HHS contacts were made by Rose Sullivan.","Issues related to the cost of care and protecting patient access to blood cancer treatment.  Issues related to specialty drug tiers.  Issues related to Presidential Executive Orders regarding drug pricing.","Issues related to patient protections for blood cancer patients including the ban on pre-existing conditions and surprise medical billing.  Issues related to prescription drug costs and affordability.  Issues related to COVID-relief legislation and non profit loan eligibility.","Issues related to patient protections for blood cancer patients including the ban on pre-existing conditions and surprise medical billing.  Issues related to prescription drug costs and affordability.  Issues related to COVID-relief legislation and non profit loan eligibility.  Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021, including provisions regarding surprise billing and patient protections.","Issues related to health insurance, including Medicare, Medicaid and short term plans.  Issues related to prescription drug costs and affordability.  Issues related to COVID-relief legislation and non-profit loan eligibility.  Issues related to the implementation of H. R. 133, Consolidated Appropriations Act for Fiscal Year 2021, including provisions regarding surprise billing and patient protections.  Issues related to H.R. 1319, the American Rescue Plan, including provisions related to Medicaid."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}