{
  "id": 208971,
  "name": "BLUEHALO CORPORATION",
  "slug": "bluehalo-corporation",
  "state": "VA",
  "description": "Defense provider in space, directed energy, air/missile defense, C4ISR, and cyber.",
  "totalSpending": 1920000,
  "filings": 16,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 280000
    },
    {
      "year": 2022,
      "income": 360000
    },
    {
      "year": 2023,
      "income": 490000
    },
    {
      "year": 2024,
      "income": 540000
    },
    {
      "year": 2025,
      "income": 250000
    }
  ],
  "firms": [
    "DLA PIPER LLP (US)"
  ],
  "lobbyists": [
    "TONY SAMP",
    "NATHANIEL BELL",
    "STEVEN PHILLIPS",
    "MICHAEL FLEISCHMAN"
  ],
  "issues": [
    "DEF",
    null
  ],
  "sampleDescriptions": [
    "DoD authorization and FY2022 DoD appropriations for space, directed energy, artificial intelligence, and C4ISR.\nS. 1260, United States Innovation and Competition Act of 2021.",
    "H.R. 4350, National Defense Authorization Act for FY2022, provisions on space, directed energy, artificial intelligence, and C4ISR.\nH.R. 4432, Department of Defense Appropriations Act, FY2022, provisions on space, directed energy, artificial intelligence, and C4ISR.\nS. 1260, United States Innovation and Competition Act of 2021.",
    "H.R. 7900, National Defense Authorization Act for FY2023, provisions on space, directed energy, artificial intelligence, cybersecurity and C4ISR. H.R. 8236, Department of Defense Appropriations Act, FY2023, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR. S. 1260, United States Innovation and Competition Act of 2021.",
    "H.R. 7900, National Defense Authorization Act for FY2023, provisions on space, directed energy, artificial intelligence, cybersecurity and C4ISR. H.R. 8236, Department of Defense Appropriations Act, FY2023, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR.",
    "H.R. 8070, Servicemember Quality of Life Improvement and National Defense Authorization Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity and C4ISR. S. 4683, National Defense Authorization Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR. H.R. 8774, Department of Defense Appropriations Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR.",
    "H.R. 8070, Servicemember Quality of Life Improvement and National Defense Authorization Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity and C4ISR. S. 4683, National Defense Authorization Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR. H.R. 8774/S. 4921, Department of Defense Appropriations Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR.",
    "H.R. 8070, Servicemember Quality of Life Improvement and National Defense Authorization Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity and C4ISR. S. 4638, National Defense Authorization Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR. H.R. 8774/S. 4921, Department of Defense Appropriations Act for FY2025, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR.",
    "National Defense Authorization Act for FY2026, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR. Department of Defense Appropriations Act for FY2026, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR.",
    "National Defense Authorization Act for FY2026, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR. H.R. 4016, Department of Defense Appropriations Act for FY2026, provisions on space, directed energy, artificial intelligence, cybersecurity, and C4ISR."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -11,
  "trajectory": "stable",
  "yearsActive": 5,
  "avgAnnualSpending": 384000,
  "peakYear": 2024,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 1,
  "industry": "technology"
}