{"id":160880,"name":"BLUE ORIGIN","slug":"blue-origin","state":"VA","description":"Aerospace Developer and Manufacturer","totalSpending":1200000,"filings":15,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":320000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":160000}],"firms":["MAYNARD NEXSEN PC"],"lobbyists":["LINDA MAYNOR","WILLIAM STIERS","ANDREW THARP","WADE HECK"],"issues":["DEF","AER","BUD"],"sampleDescriptions":["FY2019 Defense Appropriations (H.R. 1625, S. 2987) for Next Generation Launch System, Evolved Expendable Launch Vehicle","FY2018 Commerce Justice Science Appropriations (H.R. 1625) for NASA Space Exploration issues; FY2019 Commerce Justice Science Appropriations (S. 3072, H.R. 5952) for NASA Space Exploration issues","FY2019 Commerce Justice Science Appropriations (S. 3072, H.R. 5952) for NASA Space Exploration issues","FY2020 Defense Authorization (to be introduced) and Appropriations (to be introduced) for Evolved Expendable Launch Vehicle.","FY2020 Commerce Science Justice Appropriations (to be introduced) for advanced cislunar and surface capabilities, flight opportunities program; FY2019 Commerce Science Justice Appropriations (S. 3072, H.R. 5952) for NASA Space Exploration issues.","FY20 Defense Appropriations (H.R. 2968, unnumbered Senate) - issues related to space transportation; FY20 Defense Authorization (H.R. 2500, S. 1790) - issues related to space transportation.","FY20 CJS Appropriations (H.R. 3055, unnumbered Senate)- issues related to space transportation, launch vehicle and engine development.","FY20 Defense Appropriations (H.R. 2968, S. 2474) - issues related to space transportation; FY20 Defense Authorization (H.R. 2500, S. 1790) - issues related to space transportation.","FY20 CJS Appropriations (H.R. 3055, S. 2584)- issues related to space transportation, launch vehicle and engine development.","FY20 CJS Appropriations (H.R. 3055, S. 2584)- issues related to space transportation.","Issues related to space transportation - FY21 NASA Authorization (bill numbers to be determined)","Issues related to space transportation - FY21 Defense Appropriations (bill numbers to be determined); FY21 Commerce Justice Science Appropriations (bill numbers to be determined).","Issues related to space transportation - FY21 Defense Authorization (bill numbers to be determined).","Issues related to space transportation and launch services - National Defense Authorization Act for Fiscal Year 2021 (H.R. 6395, S. 4049).","Issues related to space transportation - FY21 National Aeronautics and Space Administration Authorization Act of 2019 (H.R. 5666, S. 2800).","Issues related to space transportation - Commerce Justice Science and Related Agencies Appropriations Act 2021 (H.R. 7667, unnumbered Senate); Department of Defense Appropriations Act 2021 (H.R. 7617, unnumbered Senate).","FY22 Defense Authorization Bills (House and Senate unnumbered) and FY22 Defense Appropriations Bills (House and Senate unnumbered) - national security space launch services and general space issues","FY22 Commerce Justice Science Appropriations Bills (House and Senate unnumbered); FY22 NASA Authorization Bills (House and Senate unnumbered) - General space issues, space commercialization, human landing system, flight opportunities","National Security Space Launch and space technology development - FY 22 National Defense Authorizations (HR 4350, S.2792) and FY22 Defense Appropriations (HR 4505, unnumbered Senate).","Space technology development and commercialization, human landing systems, flight technologies - FY22 Commerce Justice Science Appropriations (HR 4505, unnumbered Senate) and FY22 NASA Authorization (S.1260)."],"years":[2018,2019,2020,2021,2022]}