{"id":114871,"name":"BOOZ ALLEN HAMILTON INC.","slug":"booz-allen-hamilton-inc","state":"VA","description":"&#226;€‹Management and information technology consulting firm","totalSpending":1150000,"filings":23,"yearlySpending":[{"year":2018,"income":50000},{"year":2019,"income":150000},{"year":2020,"income":200000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":150000}],"firms":["INNOVATIVE FEDERAL STRATEGIES, LLC"],"lobbyists":["CARL KIME","NEELY SILBEY","ANNE WAKE","LETITIA WHITE","WILLIAM TATUM","ZACKARY LINICK","MACKENZIE ROWE","KATELYN COSTELLO","PETER ENGEL","JUAN BUHIGAS PALINKASEV","QUINTON JOHNSON"],"issues":["BUD","GOV","DEF","VET","INT","CPI","HOM"],"sampleDescriptions":["Issues related to the annual appropriations process.","H.R.5515 / S.2987, National Defense Authorization Act, 2019, all titles, all provisions relating to rapid acquisition authorities and security clearances.","H.R.6157 / S.3159, Department of Defense Appropriations Act, 2019, all titles, all provisions relating to rapid acquisition authorities.","Contacted Members of Congress and their staff to provide information about the company. \n\nContacted Members of Congress and their staff regarding an industry event.","Contacted Congressional offices to provide information on the company, its federal programs, and trusted workforce.","Provided information to Members of Congress and their staff regarding a House Veterans Affairs Committee hearing on Electronic Health Records.","H.R.2500 / S.1790, National Defense Authorization Act, 2020, Title VIII, all provisions related to military spouse employment.","H.R.2968 / S.2474, Department of Defense Appropriations Act, 2020, Titles III and IV, all provisions relating to accessions information technology.","Contacted Congressional offices to provide information on the company, its federal programs, trusted workforce, and to invite them to an exhibit an an upcoming industry event.","H.R.3494 / S.1589, Damon Paul Nelson and Matthew Young Pollard Intelligence Authorization Act for Fiscal Years 2018, 2019, and 2020, all provisions relating to cybersecurity and next generation networks.","Contacted Congressional offices to invite them to an exhibit an an upcoming industry event.","H.R.2500 / S.1790, National Defense Authorization Act, 2020, Title VIII, all provisions related to military spouse employment. \n\nContacted Congressional offices regarding the Future of Defense Task Force.","H.R. ____ / S.____ Department of Defense Appropriations Bill, 2021, Title IV, all provisions related to tactical lasers.","H.R.748, CARES Act, Division A, Subtitle C, all provisions related to federal contractor authority.","H.R. ____ / S.____ Intelligence Authorization Act, 2021, Title I, all provisions related to cybersecurity and next generation networks.","H.R. ____ / S.____ National Defense Authorization Act, 2021 - General Provisions, all provisions related to Department of Defense Audit procedures. Title II, all provisions related to tactical lasers. Title III, all provisions related to Morale, Welfare, and Recreation.","H.R.6395 / S.4049 National Defense Authorization Act, 2021 - General Provisions, all provisions related to Department of Defense Audit procedures. Title II, all provisions related to tactical lasers. Title III, all provisions related to Morale, Welfare, and Recreation; and Title VIII, all provisions related to workforce reform.","H.R. ____ / S.3905 Intelligence Authorization Act, 2021, Title I, all provisions related to cybersecurity and next generation networks.","H.R.7617 / S.____ Department of Defense Appropriations Bill, 2021, Title IV, all provisions related to tactical lasers and all provisions related to cybersecurity and next generation networks.","H.R.6395 / S.4049 National Defense Authorization Act, 2021 - General Provisions, all provisions related to Department of Defense Audit procedures. Title II, all provisions related to tactical lasers. Title III, all provisions related to Morale, Welfare, and Recreation; and Title VIII, all provisions related to workforce reform. Title X, all provisions related to cyber supply chain."],"years":[2018,2019,2020,2021,2022,2024,2025]}