{"id":206933,"name":"BREAKTHROUGH ENERGY, LLC","slug":"breakthrough-energy-llc","state":"WA","description":"Encourages development of new technologies&policies to speed innovation from lab to market","totalSpending":1220000,"filings":11,"yearlySpending":[{"year":2020,"income":260000},{"year":2021,"income":480000},{"year":2022,"income":480000}],"firms":["KOUNTOUPES DENHAM CARR & REID, LLC"],"lobbyists":["MARY REID","DAVID PELUSO","MJ KENNY","LISA KOUNTOUPES","CLAYTON HAYES"],"issues":["ENV","ENG","TRA","BUD","CAW","TAX","AGR"],"sampleDescriptions":["Issues related to energy innovation, research & development, industrial decarbonization and decarbonization of liquid fuels.","Issues related to decarbonizing liquid fuels in the transportation sector.","Issues related to the investment in research, development, deployment of clean energy technologies.","Issues related to industrial decarbonization.","Issues related to the research, development, and deployment of clean energy technologies.","Issues related to economy-wide decarbonization.","Issues related to the investment in research, development, deployment of clean energy technologies.  Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).","Issues related to economy-wide decarbonization.  Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).  S. 383, Utilizing Significant Emissions with Innovative Technologies Act (USE IT Act).","Issues related to the research, development, and deployment of clean energy technologies. Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).","Issues related to implementation of economy-wide decarbonization.  Issues related to implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).","Issues related to the implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).  Issues related to H.R. 1512, CLEAN Future Act.  Issues related to the Bipartisan Infrastructure Framework, including the Energy Infrastructure Act.","Issues related to the annual Energy and Water Development Appropriations Bills.","Issues related to tax incentives which spur deployment of clean energy technologies, including S. 1298, The Clean Energy for America Act, and the discussion draft of The Energy Sector Innovation Credit Act.","Issues related to the implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).  Issues related to H.R. 1512, CLEAN Future Act.  Issues related to the deployment of clean energy technology, including the Fiscal Year 2022 budget reconciliation process.","Issues related to tax incentives which spur deployment of clean energy technologies, including S. 1298, The Clean Energy for America Act, the discussion draft of The Energy Sector Innovation Credit Act and the Fiscal Year 2022 budget reconciliation process focusing on green energy.","Issues related to implementation of economy-wide decarbonization.  Issues related to implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).  Issues related to the deployment of  clean energy technology, including H. R. 3684, The Infrastructure Investment and Jobs Act of 2021.","Issues related to the implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).  Issues related to H.R. 1512, CLEAN Future Act.  Issues related to the deployment of clean energy technology, including H.R. 3684, The Infrastructure Investment and Jobs Act of 2021 and the Fiscal Year 2022 budget reconciliation process.","Issues related to implementation of economy-wide decarbonization.  Issues related to implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020).  Issues related to the deployment of  clean energy technology, including H. R. 3684, The Infrastructure Investment and Jobs Act of 2021 and the Fiscal Year 2022 budget reconciliation process.","Issues related to the implementation of H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021 (Energy Act of 2020). Issues related to the deployment of clean energy technology, including the implementation of H.R. 3684, The Infrastructure Investment and Jobs Act of 2021. Issues related to the Fiscal Year 2022 budget reconciliation process focusing on tax incentives and clean energy technologies, including H.R. 5376, the Build Back Better Act.","Issues related to the Fiscal Year 2022 and 2023 Energy and Water Development Appropriations Bills, including H.R. 2471, the Consolidated Appropriations Act for Fiscal Year 2022."],"years":[2020,2021,2022]}