{
  "id": 100661,
  "name": "BRIDGESTONE AMERICAS HOLDING INC",
  "slug": "bridgestone-americas-holding-inc",
  "state": "TN",
  "description": null,
  "totalSpending": 2020000,
  "filings": 33,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 280000
    },
    {
      "year": 2019,
      "income": 280000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 300000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "AKIN GUMP STRAUSS HAUER & FELD"
  ],
  "lobbyists": [
    "CHARLIE JOHNSON",
    "JAMES TUCKER",
    "SEAN D'ARCY",
    "BRIAN POMPER",
    "ZACHARY RUDISILL",
    "JOHN GILLILAND",
    "RYAN THOMPSON",
    "HANS RICKHOFF",
    "SAM OLSWANGER"
  ],
  "issues": [
    "TRD",
    "TRA",
    "AUT",
    "AGR",
    null
  ],
  "sampleDescriptions": [
    "Trademark ruling of Panama Supreme Court.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency; U.S. tire exports.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency; Benefits of commercial vehicle tire retreading.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency; benefits of commercial vehicle tire retreading.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency; benefits of commercial vehicle tire retreading; U.S. natural rubber production.",
    "Discuss sustainable domestic source of natural rubber.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency; benefits of commercial vehicle tire retreading,; U.S. natural rubber production.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety, and efficiency benefits of commercial vehicle tire retreading.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety and efficiency benefits of commercial vehicle tire retreading.",
    "Hearings, legislation, and other congressional activity related to tire and automobile safety and efficiency benefits of commercial vehicle tire retreading; H.R. 8578/ S. 4685 - Retreaded Truck Tire Jobs, Supply Chain Security and Sustainability Act of 2024.",
    "Issues related to H.R. 3401 - Retreaded Tire Jobs, Supply Chain Security and Sustainability Act of 2025."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -14,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 252500,
  "peakYear": 2022,
  "lobbyistCount": 9,
  "firmCount": 1,
  "issueCount": 4
}