{"id":129637,"name":"CALIFORNIA INSTITUTE OF TECHNOLOGY","slug":"california-institute-of-technology","state":"CA","description":null,"totalSpending":1930000,"filings":31,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":300000},{"year":2020,"income":240000},{"year":2021,"income":180000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":280000},{"year":2025,"income":210000}],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"lobbyists":["APRIL BURKE","MICHAEL LEDFORD","MIRIAM QUINTAL","BRIDGET KRIEGER","LELAND COGLIANI","NICK SAAB","WILLIAM KATT","ELIANA PERLMUTTER","PAULA TRIMBLE","NZINGA DYSON","OSCAR CARBALLO","JOANNA RATIGAN","AMBER CASSADY","DEVIN BRYANT"],"issues":["EDU","SCI","TAX","DEF","BUD","IMM",null,"CPT","HCR","DIS"],"sampleDescriptions":["Higher Education Act Reauthorization, Issues pertaining to accreditation, student aid programs, grant programs, reporting requirements, and campus safety.\nH.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to the reauthorization of the Higher Education Act, including student financial aid programs, grant programs, reporting requirements, and campus safety.","Issues pertaining to infrastructure research, workforce development, and research infrastructure.\nS. 1768, National Earthquake Hazards Reduction Program Reauthorization Act of 2017, Issues pertaining to National Earthquake Hazards Reduction Program reauthorization.\nH.R. 5503, NASA Authorization Act, Issues pertaining to NASA science and space technology priorities.","Implementation of excise tax on investment income of non-profit private colleges and universities.","National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding and academic-industry collaborations.","H.R. 3358, S. 1771, FY 2018 Labor/HHS/Education Appropriations, Issues pertaining to NIH funding and full support for facilities and administrative (F&A) costs, Department of Education, and student aid.\nH.R. 3266, S. 1609, FY 2018 Energy/Water Appropriations, Issues pertaining to DOE Office of Science, renewable energy, and solar innovation hub.\nH.R. 3267, S. 1662, FY 2018 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nH.R. 695, FY 2018 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nH.R. 3354, FY 2018 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.\nFY 2019 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Department of Education, and student aid.\nFY 2019 Energy/Water Appropriations, Issues pertaining to Office of Science, renewable energy, and solar innovation hub.\nFY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nFY 2019 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nFY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.","Issues pertaining to STEM Optional Practical Training, H-1B Visas, Travel ban, J visas, Immigration Executive Orders and Deferred Action for Childhood Arrivals (DACA) students.","H.R. 5515, S. 2987, National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding and academic-industry collaborations.","S. 3158, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Department of Education, and student aid.\nH.R. 5895, S. 2975, FY 2019 Energy/Water Appropriations, Issues pertaining to Office of Science, renewable energy, and solar innovation hub.\nH.R. 5952, S. 3072, FY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nH.R. 6157, S. 3159, FY 2019 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nH.R. 6147, S. 3073, FY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.","S. 1768, National Earthquake Hazards Reduction Program Reauthorization Act of 2017, Issues pertaining to National Earthquake Hazards Reduction Program reauthorization.\nH.R. 5503, NASA Authorization Act, Issues pertaining to NASA science and space technology priorities.\nH.R. 6227, S. 3143, National Quantum Initiative Act, All provisions.\nS. 2998, Quantum Computing Research Act of 2018, Issues pertaining to all provisions of the bill.","S. 1768, National Earthquake Hazards Reduction Program Reauthorization Act of 2017, Issues pertaining to National Earthquake Hazards Reduction Program reauthorization.\nH.R. 5503, NASA Authorization Act, Issues pertaining to NASA science and space technology priorities.\nH.R. 6227, S. 3143, National Quantum Initiative Act, Issues pertaining to support for fundamental quantum information science research.","Public Law No: 115-245, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Department of Education, and student aid.\nPublic Law No: 115-244, FY 2019 Energy/Water Appropriations, Issues pertaining to Office of Science, renewable energy, and solar innovation hub.\nH.R. 5952, S. 3072, FY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nPublic Law No: 115-245, FY 2019 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nH.R. 6147, S. 3073, FY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.","H.R. 5952, S. 3072, FY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nH.R. 6147, S. 3073, FY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.","S. 1768, National Earthquake Hazards Reduction Program Reauthorization Act of 2017, Issues pertaining to National Earthquake Hazards Reduction Program reauthorization.\nH.R. 5503, NASA Authorization Act, Issues pertaining to NASA science and space technology priorities.\nH.R. 6227, S. 3143, National Quantum Initiative Act, Issues pertaining to support for fundamental quantum information science research.\nH.R. 4377, Accelerating American Leadership in Science Act of 2018,Issues related to collections.\nPublic Law No. 115-368, National Quantum Initiative Act, Issues pertaining to support for fundamental quantum information science research.","Public Law No. 115-97, Tax Cuts and Jobs Act, Issues pertaining to endowments and higher education.","Issues pertaining to NASA science and space technology priorities.","H.R. 5952, S. 3072, FY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nH.R. 6147, S. 3073, FY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.\nFY 2020 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Department of Education, and student aid.\nFY 2020 Energy/Water Appropriations, Issues pertaining to Office of Science, renewable energy, and solar fuels innovation hub.\nFY 2020 Commerce/Justice/Science Appropriations, Issues pertaining to NSF and NASA.\nFY 2020 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nFY 2020 Interior, Environment and Related Agencies Appropriations, Issues pertaining to USGS and earthquake research.","Issues pertaining to H-1B visas, high-skilled immigration, immigration executive orders, and the Deferred Action for Childhood Arrivals (DACA) program.","Higher Education Act Reauthorization, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, student aid programs, and graduate education.","H.R. 2500, S. 1790, National Defense Authorization Act for Fiscal Year 2020, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding, workforce development, academic-industry collaborations, and research security.","Issues pertaining to H-1B visas, high-skilled immigration, immigration executive orders, TPS, J and F visas, and the Deferred Action for Childhood Arrivals (DACA) program."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}