{
  "id": 145033,
  "name": "CAMECO CORPORATION",
  "slug": "cameco-corporation",
  "state": null,
  "description": "Mining:  Uranium Production",
  "totalSpending": 1830000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 80000
    },
    {
      "year": 2019,
      "income": 330000
    },
    {
      "year": 2020,
      "income": 400000
    },
    {
      "year": 2021,
      "income": 220000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 260000
    },
    {
      "year": 2024,
      "income": 140000
    },
    {
      "year": 2025,
      "income": 160000
    }
  ],
  "firms": [
    "DENTONS US LLP"
  ],
  "lobbyists": [
    "ANDREW SHAW",
    "CHRIS FETZER",
    "LINDA WILLARD"
  ],
  "issues": [
    "ENG",
    null,
    "FOR"
  ],
  "sampleDescriptions": [
    "Nuclear energy and uranium issues in federal legislation; DOE uranium stockpile issues; S. 512, Nuclear Energy Innovation and Modernization Act. Part 192, ground water monitoring under the Uranium Mill Tailings Radiation Control Act. S.2908, the Foreign Investment Risk Review Modernization Act of 2017.",
    "Nuclear energy and uranium issues in federal legislation; DOE uranium stockpile issues; S. 512, Nuclear Energy Innovation and Modernization Act. S.2908, the Foreign Investment Risk Review Modernization Act of 2017. Application of Tariffs under Section 232 Trade Expansion Act",
    "Nuclear energy and uranium issues in federal legislation; DOE uranium stockpile issues; S. 512, Nuclear Energy Innovation and Modernization Act. S.2908, the Foreign Investment Risk Review Modernization Act of 2017. Application of Tariffs under Section 232 Trade Expansion Act. Restrictions on Russian uranium imports",
    "Nuclear energy and uranium issues in federal legislation; DOE uranium stockpile issues; Application of Tariffs under Section 232 Trade Expansion Act; Restrictions on Russian uranium imports; U.S. nuclear enrichment policy.",
    "Nuclear energy and uranium issues in federal legislation; DOE uranium stockpile issues; Application of Tariffs under Section 232 Trade Expansion Act; Restrictions on Russian uranium imports; U.S. nuclear enrichment policy; Consideration of policy recommendations developed by the U.S. Nuclear Fuel Working Group.",
    "Nuclear energy and uranium issues in federal legislation; DOE uranium stockpile issues; Application of Tariffs under Section 232 Trade Expansion Act; Restrictions on Russian uranium imports; U.S. nuclear enrichment policy; Consideration of policy recommendations developed by the U.S. Nuclear Fuel Working Group. Omnibus Appropriations bills;",
    "Nuclear energy and uranium issues in federal legislation; DOE's Strategic Uranium Reserve; U.S. nuclear enrichment policy; policies or legislation related to critical minerals;",
    "Nuclear energy and uranium issues in federal legislation; U.S. nuclear enrichment policy; policies or legislation related to critical minerals; Nuclear Fuel Security Act; FY 24 Energy, Water Appropriations bills; Nuclear Fuel Security Act (S452/h>R. 5718) and the Prohibiting Russian Uranium Imports Act (H.R. 1042/S.763).",
    "US and global energy security policy and related foreign policy matters",
    "Nuclear energy and uranium issues in federal legislation; U.S. nuclear enrichment policy; policies or legislation related to critical minerals; FY 25 Energy, Water Appropriations bills; Nuclear Fuel Security Act (S.452/H.R.5718) and Prohibiting Russian Uranium Imports Act (H.R. 1042/S.763).",
    "Nuclear energy and uranium issues in federal legislation; U.S. nuclear enrichment policy; any policies or legislation regarding critical minerals; FY 25 Energy Appropriations bill and Continuing Resolution;",
    "U.S. global energy security policy and related foreign policy matters;",
    "Nuclear energy and uranium issues in federal legislation; U.S. nuclear enrichment policy; any policies or legislation regarding critical minerals; FY 26 Energy Appropriations bill."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 100,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 228750,
  "peakYear": 2020,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 2
}