{"id":129525,"name":"CARGILL INC","slug":"cargill-inc","state":"MN","description":"Producer and marketer of food, agricultural,financial and industrial products and services","totalSpending":1600000,"filings":25,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":120000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2024,"income":370000},{"year":2025,"income":240000}],"firms":["THE RUSSELL GROUP, INC."],"lobbyists":["RANDALL RUSSELL","TYSON REDPATH","ANDREW HARKER","KARLA THIEMAN","JESSICA SCHULKEN","SAMANTHA BUCHALTER","ASHLEE JOHNSON"],"issues":["AGR"],"sampleDescriptions":["Public Law No. 114-216: National Bioengineered Food Disclosure Standard; issues related to food safety inspection at USDA; work regarding Farm Bill reauthorization; trade issues related to NAFTA, Korea, and China; H.R.1625 - Consolidated Appropriations Act, 2018.","Public Law No. 114-216: National Bioengineered Food Disclosure Standard; issues related to food safety inspection at USDA; trade issues related to NAFTA, Korea, and China; issues related to the Renewable Fuel Standard; H.R.2 - Agriculture Improvement Act of 2018; FY 2019 Agriculture Appropriations.","Public Law No. 114-216: National Bioengineered Food Disclosure Standard; issues related to food safety inspection at USDA; trade issues related to USMCA, Korea, and China; issues related to the Renewable Fuel Standard; H.R. 2/S. 3042, Agriculture Improvement Act of 2018; H.R.5961/ S.2976, Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2019; matters concerning offshore aquaculture; matters pertaining to anti-dumping and countervailing duties (AD/CVD) for the importation of laminated woven sacks from Vietnam.","Trade issues related to USMCA and China; issues related to the Renewable Fuel Standard; issues related to rural housing; issues related to sustainability; issues related to poultry trade; issues related to food aid.","Trade issues related to China; issues related to the Renewable Fuel Standard; issues related to rural housing; issues related to sustainability; issues related to poultry trade; issues related to food aid; issues related to aquaculture; H.R.2089 - Biodiesel Tax Credit Extension Act of 2019; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act.","Trade issues related to China; issues related to the Renewable Fuel Standard; issues related to rural housing; issues related to sustainability; issues related to poultry trade; issues related to food aid; issues related to aquaculture; H.R.2089 - Biodiesel Tax Credit Extension Act of 2019; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act; issues related to COVID-19.","Trade issues related to China; issues related to the Renewable Fuel Standard; issues related to rural housing; issues related to sustainability; issues related to poultry trade; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act; issues related to COVID-19, specifically the Coronavirus Food Assistance Program.","Trade issues related to China; issues related to the Renewable Fuel Standard; issues related to rural housing; issues related to sustainability; issues related to poultry trade; issues related to COVID-19, specifically the Coronavirus Food Assistance Program and Farmers to Families Food Box Program; issues related to livestock markets.","Trade issues related to China; issues related to the Renewable Fuel Standard; issues related to sustainability; issues related to poultry trade; issues related to COVID-19, specifically the Coronavirus Food Assistance Program and Farmers to Families Food Box Program; issues related to livestock markets and competition; issues related to hunger; issues related to grain regulatory flexibility, specifically as a result of Hurricane Ida.","Trade issues related to China; issues related to the Renewable Fuel Standard; issues related to sustainability; issues related to poultry trade; issues related to COVID-19, specifically the Coronavirus Food Assistance Program; issues related to livestock markets and competition; issues related to hunger.","Trade issues; issues related to the Renewable Fuel Standard; issues related to sustainability; issues related to poultry trade; issues related to poultry and livestock markets and competition; issues related to hunger.","Trade issues; issues related to the Renewable Fuel Standard; issues related to sustainability; issues related to poultry trade; issues related to poultry and livestock markets and competition; issues related to hunger; S.3580 - Ocean Shipping Reform Act of 2022.","Trade issues; issues related to the Renewable Fuel Standard; issues related to sustainability; issues related to poultry and livestock markets and competition; issues related to sustainability and regenerative agriculture; issues related to the rail industry labor dispute.","Trade issues; issues pertaining to the Renewable Fuel Standard; issues pertaining to climate/sustainability; issues pertaining to poultry and livestock markets and competition; issues pertaining to the farm bill; issues pertaining to cybersecurity; issues pertaining to animal feed; issues pertaining to labor; issues pertaining to school nutrition standards.","Trade issues; issues pertaining to the Renewable Fuel Standard; issues pertaining to climate/sustainability; issues pertaining to poultry and livestock markets and competition; issues pertaining to H.R.8467 - Farm, Food, and National Security Act of 2024; issues pertaining to cybersecurity; issues pertaining to animal feed; issues pertaining to labor; issues pertaining to school nutrition standards; and issues pertaining to food aid; issues pertaining to FDA.","Trade issues; issues pertaining to the Renewable Fuel Standard; issues pertaining to climate/sustainability; issues pertaining to poultry and livestock markets and competition; issues pertaining to H.R.8467 - Farm, Food, and National Security Act of 2024; issues pertaining to cybersecurity; issues pertaining to animal feed; issues pertaining to labor; issues pertaining to school nutrition standards; and issues pertaining to food aid; issues pertaining to FDA; issues pertaining to rail safety; and issues related to biomanufacturing.","Issues related to H.R. 1-One Big Beautiful Bill Act; issues pertaining to trade; issues pertaining to the Renewable Fuel Standard; issues pertaining to climate/sustainability; issues pertaining to poultry and livestock markets and competition; issues pertaining to the Farm Bill; issues pertaining to animal feed; issues pertaining to food aid; issues pertaining to FDA; issues pertaining to nutrition policy; and issues related to biomanufacturing.","Issues related to H.R. 1-One Big Beautiful Bill Act; issues pertaining to trade; issues pertaining to the Renewable Fuel Standard; issues pertaining to poultry and livestock markets and competition; issues pertaining to the Farm Bill; issues pertaining to animal feed; issues pertaining to food aid; issues pertaining to FDA; issues pertaining to nutrition policy; and issues related to biomanufacturing.","Issues pertaining to trade; issues pertaining to the Renewable Fuel Standard; issues pertaining to poultry and livestock markets and competition; issues pertaining to the Farm Bill; issues pertaining to animal feed; issues pertaining to food aid; issues pertaining to FDA; and issues pertaining to nutrition policy."],"years":[2018,2019,2020,2021,2022,2024,2025]}