{"id":207794,"name":"CARRIER CORPORATION","slug":"carrier-corporation","state":"FL","description":"Building systems manufacturer","totalSpending":1540000,"filings":21,"yearlySpending":[{"year":2020,"income":20000},{"year":2021,"income":240000},{"year":2022,"income":280000},{"year":2023,"income":340000},{"year":2024,"income":360000},{"year":2025,"income":300000}],"firms":["INVARIANT LLC"],"lobbyists":["MARY STANTON","BENJAMIN KLEIN","LANDON STROPKO","QUINCY ENOCH","KATHRYN WISE","KENNY ROBERTS","AMY SWONGER","MAX FRANKEL","BERKLEY LANE","DREW GRIFFIN","NICOLE VENABLE","MAX WHITCOMB","JAMES OBRIEN","DOUGLAS DZIAK","MATTHEW FERY"],"issues":["MAN","TAX","ENG","HOU","ENV","TRD",null,"TRA"],"sampleDescriptions":["Support initiatives for healthy buildings; educate regarding cold-chain storage technology.","Advocate on issues relating to safety in public housing, including supporting S. 2160, the CO ALERTS Act of 2019.","Educate policymakers about cold-chain storage technology.","Monitor energy tax provisions in end-of-year tax legislation.","Support energy efficiency tax incentives, including Code Section 25c in H.R. 848, the GREEN Act of 2021, and the draft Home Energy Savings Act.","Support energy efficiency tax incentives, including Code Section 25c in H.R. 848, the GREEN Act of 2021, and S.1298, Clean Energy for America Act.","Educate policymakers about Carriers work on building efficiency, including S.432 and H.R. 1335, Fostering and Realizing Electrification by Encouraging Zero Emission Refrigerated Trucks Act of 2021 (FREEZER Act).","Support energy efficiency tax incentives, including Section 25c in H.R. 848, the GREEN Act of 2021; S.1298, Clean Energy for America Act; and Build Back Better Act.","Educate policymakers about Carriers work on building efficiency, including S.432, H.R. 1335, S.2066, the INSULATE Buildings Act, and S.2370, Zero Emission Homes Act. Fostering and Realizing Electrification by Encouraging Zero Emission Refrigerated Trucks Act of 2021 (FREEZER Act); highlight Carriers perspective on HFC phase-down.","Support and provide feedback on implementation of S.1059, the American Innovation and Manufacturing Act; support S.1260, the US Innovation and Competition Act.","Support energy efficiency tax incentives in H.R.5376, Build Back Better Act; monitor international tax provisions in H.R.5376, Build Back Better Act.","Support climate provisions in H.R.5376, Build Back Better Act.","Educate policymakers about Carriers work on building and energy efficiency, including supporting S.432/H.R. 1335, the Fostering and Realizing Electrification by Encouraging Zero Emission Refrigerated Trucks Act of 2021 (FREEZER Act), S.2066, the INSULATE Buildings Act, S.2370, the Zero Emissions Homes Act, and H.R. 3684, the Infrastructure Investment and Jobs Act.  Highlight Carriers perspective on the HFC phase-down.","Monitor energy efficiency tax incentives in H.R.5376, Build Back Better Act and draft Senate legislation; monitor international tax provisions in H.R.5376, Build Back Better Act and draft Senate legislation.","Educate policymakers about Carriers work on building and energy efficiency, including supporting S.432/H.R.1335, the Fostering and Realizing Electrification by Encouraging Zero Emission Refrigerated Trucks Act of 2021 (FREEZER Act), S.2066, the INSULATE Buildings Act, S.2370, the Zero Emissions Homes Act. Monitor implementation of P.L.117-58, the Infrastructure Investment and Jobs Act. Highlight Carriers perspective on the HFC phase-down.","Support and provide feedback on implementation of S.1059, the American Innovation and Manufacturing Act; support S.1260, the US Innovation and Competition Act and H.R.4521, America COMPETES Act.","Support climate provisions in H.R.5376, Build Back Better Act and draft Senate legislation.","Educate policymakers about Carrier's work on building and energy efficiency, including supporting S.432/H.R.1335, the Fostering and Realizing Electrification by Encouraging Zero Emission Refrigerated Trucks Act of 2021 (FREEZER Act), S.2066, the INSULATE Buildings Act, S.2370, the Zero Emissions Homes Act. Monitor implementation of P.L.117-58, the Infrastructure Investment and Jobs Act. Highlight Carrier's perspective on the HFC phase-down; provide program principles for Sec. 40541 of P.L.117-58, the Infrastructure Investment and Jobs Act.","Support and provide feedback on implementation of S.1059, the American Innovation and Manufacturing Act; support S.1260, the US Innovation and Competition Act, and H.R.4521, America COMPETES Act; Express support for the ratification of the Kigali Amendment treaty.","Monitor energy efficiency tax incentives in P.L. 117-169, Inflation Reduction Act; monitor international tax provisions in P.L. 117-169, Inflation Reduction Act."],"years":[2020,2021,2022,2023,2024,2025]}