{"id":186716,"name":"CENCORA INC. (FORMERLY AMERISOURCEBERGEN CORPORATION)","slug":"cencora-inc-formerly-amerisourcebergen-corporation","state":"DC","description":"Pharmaceutical Distributor","totalSpending":1540000,"filings":26,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":180000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["KOUNTOUPES DENHAM CARR & REID, LLC"],"lobbyists":["JULIE CARR","LORI DENHAM","DAVID PELUSO","LISA KOUNTOUPES","ROSE SULLIVAN (LISTED IN ERROR)","DENISE MOUSOURIS","CLAYTON HAYES","LESLIE ZELENKO","MARY BEAL"],"issues":["HCR","ANI","PHA","DEF","TAX"],"sampleDescriptions":["Issues related to the pharmeceutical supply chain.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances.  Issues related to pharmaceutical compounding, including H. R. 3204, the Drug Quality and Security Act.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances.  Issues related to pharmaceutical compounding, including implementation of H. R. 3204, the Drug Quality and Security Act.","Issues related to the distribution and pricing of medicines for pets.","Issues related to drug pricing in the pharmaceutical supply chain.  Proposed modifications to the existing definition of distributor bona fide service fees in Medicare Part B.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances.  Issues related to pharmaceutical compounding, including implementation of the Drug Quality and Security Act.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances.  Issues related to pharmaceutical compounding, including implementation of the Drug Quality and Security Act. Issues related to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including those related to the drug supply chain.","Issues related to drug pricing in the pharmaceutical supply chain.  Proposed modifications to the existing definition of distributor bona fide service fees in Medicare Part B. Issues related to H.R.748, Coronavirus Aid,Relief, and Economic Security Act (CARES Act), including Medicare and Medicaid provisions.","Issues related to drug pricing in the pharmaceutical supply chain.  Proposed modifications to the existing definition of distributor bona fide service fees in Medicare Part B. Issues related to the implementation of H.R.748, Coronavirus Aid,Relief, and Economic Security Act (CARES Act), including Medicare and Medicaid provisions.  Issues related to H.R. 6800, the Heroes Act.  Issues related to drug shortage proposals.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances.  Issues related to pharmaceutical compounding, including implementation of the Drug Quality and Security Act. Issues related to the implementation of H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including those related to the drug supply chain. Issues related to H.R. 6800, the HEROES Act.  Issues related to S.1903, the Advancing Emergency Preparedness Through One Health Act of 2019, including those related to zoonotic diseases.  Issues related to providing specialty physicians relief due to the financial strain caused by COVID-19.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances. Issues related to the implementation of PL 116-136, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including those related to the drug supply chain. Issues related to H.R. 6800, the HEROES Act.  Issues related to S.1903, the Advancing Emergency Preparedness Through One Health Act of 2019, including those related to zoonotic diseases.  Issues related to providing specialty physicians relief due to the financial strain caused by COVID-19.  Issues related to pharmacy provider status.  Issues related to sequestration delay extension.","Issues related to drug pricing in the pharmaceutical supply chain.  Proposed modifications to the existing definition of distributor bona fide service fees in Medicare Part B. Issues related to the implementation of PL 116-136, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including Medicare and Medicaid provisions.  Issues related to H.R. 6800, the Heroes Act.  Issues related to proposals that would address drug shortages and national stockpile issues.","Issues related to the pharmaceutical supply chain.  Issues related to the distribution of opioids and related to the distribution of controlled substances. Issues related to the implementation of PL 116-136, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including those related to the drug supply chain. Issues related to H.R. 6800, the HEROES Act. Issues related to providing specialty physicians relief due to the financial strain caused by COVID-19. Issues related to pharmacy provider status.  Issues related to sequestration delay extension.  Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021.","Issues related to drug pricing in the pharmaceutical supply chain.  Proposed modifications to the existing definition of distributor bona fide service fees in Medicare Part B. Issues related to the implementation of PL 116-136, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including Medicare and Medicaid provisions.  Issues related to H.R. 6800, the Heroes Act.  Issues related to proposals that would address drug shortages and national stockpile issues.  Issues related to COVID-19 vaccine distribution.","Issues related to proposals that would address drug shortages and national stockpile issues.  Issues related to COVID-19 vaccine distribution.  Issues related to H.R. 1319, the American Rescue Plan.  Issues related to pharmacy provider status.","Issues related to the pharmaceutical supply chain including proposals that would address drug shortages and national stockpile issues.  Issues related to sequestration relief.  Issues related to COVID-19 testing and essential worker designation.  Issues related to H.R. 1319, the American Rescue Plan.  Issues related to pharmacy provider status.","Issues related to proposals that would address drug shortages and national stockpile issues, including H.R. 2870, the Essential Medicines Strategic Stockpile Act of 2021.  Issues related to COVID-19 vaccine distribution.  Issues related to the implementation of H.R. 1319, the American Rescue Plan.  Issues related to pharmacy provider status.","Issues related to drug shortages and stockpile issues at the Department of Defense.","Issues related to the pharmaceutical supply chain including proposals that would address drug shortages and national stockpile issues, including H.R.2870, the Essential Medicines Strategic Stockpile Act of 2021. Issues related to the implementation of H.R. 1319, the American Rescue Plan.  Issues related to pharmacy provider status."],"years":[2018,2019,2020,2021,2022,2024,2025]}