{
  "id": 185409,
  "name": "CENCORA FKA AMERISOURCEBERGEN CORPORATION",
  "slug": "cencora-fka-amerisourcebergen-corporation",
  "state": "PA",
  "description": "Pharmaceutical Services",
  "totalSpending": 1400000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 150000
    },
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "HORIZON GOVERNMENT AFFAIRS"
  ],
  "lobbyists": [
    "JOEL WHITE",
    "BRETT MEEKS",
    "COLTON HENNING"
  ],
  "issues": [
    "HCR",
    null
  ],
  "sampleDescriptions": [
    "Prompt Pay, ASP, Medicare Part B Issues, Medicare Access and CHIP Re authorization Act (MACRA)implementation, Drug Quality and Security Act Implementation, Direct fees",
    "Prompt Pay, ASP, Medicare Part B Issues, Medicare Access and CHIP Re authorization Act (MACRA)implementation, Drug Quality and Security Act Implementation, Direct and indirect remuneration - drug pricing",
    "Prompt Pay; ASP; Medicare Part B Issues; Medicare Access and CHIP Re authorization Act (MACRA)implementation; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration - Drug Pricing",
    "Prompt Pay; ASP; Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration - Drug Pricing",
    "Prompt Pay; ASP; Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration - Drug Pricing; Coronavirus and drug shortage issues.",
    "Prompt Pay; Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration-Drug Pricing; Coronavirus and drug shortage issues.",
    "Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration-Drug Pricing; Coronavirus and drug shortage issues.",
    "Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration-Drug Pricing; Coronavirus and drug shortage issues; Build Back Better legislation",
    "Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration-Drug Pricing; Coronavirus and drug shortage issues; Build Back Better legislation, FDA reauthorization legislation",
    "Medicare Part B Issues; Drug Quality and Security Act Implementation; Direct and Indirect Remuneration-Drug Pricing; Coronavirus and drug shortage issues; Inflation Reduction Act, FDA reauthorization legislation",
    "Medicare Part B Issues; Drug pricing and access, including Inflation Reduction Act; Drug shortage issues; Medicare physician reimbursement issues; HR 405-EMSSA; HR 5378-Lower Costs, More Transparency Act; S.2973-Modernizing and Ensuring PBM Accountability Act; HR 5526-Seniors' Access to Critical Medications Act of 2023; S.2764 and HR 5391, the Protecting Patient Access to Cancer and Complex Therapies Act, Seniors Access to Critical Medications Act (H.R. 5526).",
    "Medicare Part B Issues; Drug pricing and access, including Inflation Reduction Act; Drug shortage issues; Medicare physician reimbursement issues; HR 405-EMSSA; HR 5378-Lower Costs, More Transparency Act; S.2973-Modernizing and Ensuring PBM Accountability Act; HR 5526-Seniors'Access to Critical Medications Act of 2023; S.2764 and HR 5391, the Protecting Patient Access to Cancer and Complex Therapies Act, Seniors Access to Critical Medications Act (H.R. 5526).",
    "HR 405-EMSSA; Act; H.R. 3164, S. 2464, Equitable Community Access to Pharmacists Act; MFN Drug pricing issues; 2026 Medicare Physician Fee Schedule Proposed Rule"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 175000,
  "peakYear": 2019,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 1
}