{
  "id": 206715,
  "name": "CENTRIENT PHARMACEUTICALS LLC",
  "slug": "centrient-pharmaceuticals-llc",
  "state": "CA",
  "description": "Pharmaceutical Manufacturing",
  "totalSpending": 1720000,
  "filings": 21,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 250000
    },
    {
      "year": 2021,
      "income": 280000
    },
    {
      "year": 2022,
      "income": 700000
    },
    {
      "year": 2023,
      "income": 160000
    },
    {
      "year": 2024,
      "income": 100000
    },
    {
      "year": 2025,
      "income": 230000
    }
  ],
  "firms": [
    "AKIN GUMP STRAUSS HAUER & FELD"
  ],
  "lobbyists": [
    "GEOFF VERHOFF",
    "HEIDE BAJNRAUH",
    "DANIEL GRAVER",
    "CHARLIE JOHNSON",
    "MATTHEW HITTLE",
    "ANNA ABRAM",
    "SEAN FEELY",
    "LOUIS AGNELLO",
    "STEPHEN KHO",
    "MARIO RAMIREZ",
    "ED PAGANO",
    "CASEY HIGGINS",
    "SAM OLSWANGER"
  ],
  "issues": [
    "MAN",
    "PHA",
    "HCR",
    null,
    "BUD",
    "DEF",
    "TRD"
  ],
  "sampleDescriptions": [
    "Reshoring production of essential medicines.",
    "Advocacy regarding solutions for onshore manufacturing of critical medicines back to the United States.",
    "Advocacy regarding solutions for onshore supply chain and manufacturing of critical medicines back to the United States.",
    "Advocacy regarding solutions for onshoring supply chain and manufacturing of critical medicines back to the United States.",
    "Advocacy regarding solutions for onshoring supply chain and manufacturing of critical medicines back to the United States.; Issues related to health care supply chain and Mexico regulatory delays.",
    "Advocacy regarding solutions for onshoring supply chain and manufacturing of essential medicines back to the United States.; Issues related to health care supply chain and Mexico regulatory delays.",
    "Advocacy regarding solutions for onshoring supply chain and manufacturing of essential medicines back to the United States.",
    "Advocacy regarding solutions for onshoring supply chain and manufacturing of essential medicines in the United States.; Issues related to health care supply chain and Mexico regulatory delays.",
    "Issues regarding solutions for onshoring supply chain and manufacturing of essential medicines in the United States.",
    "Issues related to onshoring supply chains and manufacturing of essential medicines to the United States.",
    "Issues related to onshoring supply chains and biomanufacturing of essential medicines to the United States.",
    "Issues related to FY25 Labor-HHS and FY25 Defense appropriations bills and onshoring pharmaceutical supply chains.",
    "Issues related to health care supply chain, domestic pharmaceutical manufacturing, and FY25 National Defense Authorization Act.",
    "Issues related to health care supply chain and domestic pharmaceutical manufacturing; H.R.8070 - Servicemember Quality of Life Improvement and National Defense Authorization Act for Fiscal Year 2025; S.4638 - National Defense Authorization Act for Fiscal Year 2025.",
    "Issues related to onshoring supply chains and biomanufacturing of essential medicines to the United States; Issues related to the Defense Production Act (DPA).",
    "Issues related to onshoring supply chains and biomanufacturing of essential medicines to the United States; Issues related to the Defense Production Act (P.L. 115-232).",
    "Issues related to onshoring supply chains and biomanufacturing of essential medicines to the United States; Issues related to the Defense Production Act (P.L. 81-774)."
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -8,
  "trajectory": "stable",
  "yearsActive": 6,
  "avgAnnualSpending": 286667,
  "peakYear": 2022,
  "lobbyistCount": 13,
  "firmCount": 1,
  "issueCount": 6,
  "industry": "healthcare"
}