{"id":151032,"name":"CENTURY ALUMINUM","slug":"century-aluminum","state":"IL","description":"Aluminum manufacturing","totalSpending":1660000,"filings":27,"yearlySpending":[{"year":2018,"income":290000},{"year":2019,"income":140000},{"year":2020,"income":450000},{"year":2021,"income":80000},{"year":2022,"income":220000},{"year":2023,"income":110000},{"year":2024,"income":120000},{"year":2025,"income":250000}],"firms":["WILEY REIN LLP"],"lobbyists":["ROBERT DEFRANCESCO","NOVA DALY","ELIZABETH BALTZAN","ALAN PRICE","SCOTT WEAVER","NAZAK NIKAKHTAR"],"issues":["TRD",null],"sampleDescriptions":["Efforts to address the effect of excess Chinese aluminum capacity on the U.S. industry;\nIssues related to the Section 232 aluminum investigation.","Efforts to address the effect of excess Chinese aluminum capacity on the U.S. industry;\nIssues related to the Section 232 aluminum investigation;\nIssues related to the United States-Mexico-Canada Agreement","Issues related to the Section 232 aluminum investigation and tariffs;\nIssues related to the United States-Mexico-Canada Agreement;\nIssues related to import monitoring;\nIssues relating to imports and import surges;\nIssues related to the United States-Mexico-Canada Agreement, including rules of origin.","H.R. 1406, Aluminum Pricing Examination (APEX) Act\nIssues related to the Section 232 aluminum investigation and tariffs;\nIssues related to the United States-Mexico-Canada Agreement;\nIssues related to import monitoring;\nIssues relating to imports and import surges;\nIssues related to the United States-Mexico-Canada Agreement, including rules of origin.","H.R. 748/S. 3548, Coronavirus Aid, Relief, and Economic Security (CARES) Act, including provisions related to mid-size business loans\n\nIssues related to import monitoring;\nIssues relating to imports and import surges;\nIssues related to the Section 232 aluminum tariffs on aluminum;\nIssues related to COVID-19;\nIssues related to the Defense Procurement Act;\nIssues related to upcoming Coronavirus legislation and issues related to trade, business relief;\nIssues related to the FY21 National Defense Authorization Act and the aluminum stockpile.","Issues related to import monitoring;\nIssues relating to imports and import surges;\nIssues related to the Section 232 aluminum tariffs on aluminum;\nIssues related to the Defense Procurement Act;\nIssues related to the FY21 National Defense Authorization Act and the aluminum stockpile.","Issues related to import monitoring;\nIssues relating to imports and import surges;\nIssues related to the Section 232 aluminum tariffs on aluminum;\nIssues related to the Defense Procurement Act.","Issues related to Section 232 tariffs on aluminum","Issues related to Section 232 tariffs on aluminum\nIssues related to USG loans","H.R. 7108, Suspending Normal Trade Relations with Russia and Belarus Act Issues related to Section 232 tariffs on aluminum; Issues related to Permanent Normal Trade Relations with Russia; Issues related to energy and natural gas","Issues related to Section 232 tariffs on aluminum; Issues related to Permanent Normal Trade Relations with Russia; Issues related to export of liquified natural gas; Issues related to energy and natural gas","Issues relating to Section 232 tariffs on aluminum Issues relating to U.S. imports of aluminum from Russia Issues relating to excess aluminum capacity Issues relating to EPA licensing Implementation of the Inflation Reduction Act (P.L. 117-169) regarding clean electricity production","Issues relating to Section 232 tariffs on aluminum Issues relating to U.S. imports of aluminum from Russia Issues relating to excess aluminum capacity Issues relating to the Global Arrangement on Steel and Aluminum Issues relating to investment opportunities","H.R. 3882/S. 1865, Leveling the Playing Field 2.0 Act Issues related to Russian imports","Issues related to Mexican imports; Issues related to Inflation Reduction Act (P.L. 117-169) implementation; Issues related to climate; Issues related to supply chain resilience.","Issues related to climate change and trade policy.","Issues related to Inflation Reduction Act (P.L. 117-169), and domestic tax credits. Issues related to Section 232 tariffs.","H.R. 1, One Big Beautiful Bill Act - provisions related to the 45X credit Issues related to Section 232 tariffs. Issues related to imports.","Issues related to Section 232 tariffs. Issues related to imports."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}