{"id":125003,"name":"CHOCTAW NATION OF OKLAHOMA","slug":"choctaw-nation-of-oklahoma","state":"OK","description":null,"totalSpending":2180000,"filings":28,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":300000},{"year":2020,"income":350000},{"year":2021,"income":280000},{"year":2022,"income":280000},{"year":2023,"income":280000},{"year":2024,"income":260000},{"year":2025,"income":230000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["GERRY SIKORSKI","PHILIP BAKER-SHENK","KAYLA GEBECK","KATHRYN LEHMAN","CAMRYN TOWLE","KENNETH PARSONS","DEVIN BARRETT","DIMITRIOS KARAKITSOS","JAMES MEGGESTO","CHASE GERMANN"],"issues":["IND",null],"sampleDescriptions":["Tribal-Federal relations; Indian Country funding; federal budgeting; Promise Zone and Opportunity Zone mplementation and coordination issues; gaming regulation.","Tribal-Federal relations; Indian Country funding; federal budgeting; Promise Zone and Opportunity Zone implementation and coordination issues; gaming regulation; UAS drone regulations; education policy; Farm Bill reauthorization and Food Distribution on Indian Reservations (FDPIR) authority; Law enforcement jurisdiction; cultural resource protection; Indian Child Welfare Act (ICWA); teen pregnancy prevention program funding; land transfer authority and probate restrictions.","Tribal-Federal relations; Indian Country funding; federal budgeting; Promise Zone and Opportunity Zone implementation and coordination issues; gaming regulation; UAS drone regulations; education policy; Farm Bill reauthorization and Food Distribution on Indian Reservations (FDPIR) authority; Law enforcement jurisdiction; cultural resource protection; Indian Child Welfare Act (ICWA); land management; tribal law and order jurisdiction; veterans affairs; energy development.","Tribal-Federal relations; Indian Country funding; federal budgeting; Promise Zone and Opportunity Zone implementation and coordination issues; gaming regulation; UAS drone regulations; education policy; Farm Bill reauthorization and Food Distribution on Indian Reservations (FDPIR) authority; Law enforcement jurisdiction; cultural resource protection; Indian Child Welfare Act (ICWA); land management; tribal law and order jurisdiction; veterans affairs; energy development; coronavirus response; CARES Act.","Tribal-Federal relations; Indian Country funding; federal budgeting; Promise Zone and Opportunity Zone implementation and coordination issues; gaming regulation; Unmanned Aircraft Systems; education policy; Farm Bill reauthorization and Food Distribution on Indian Reservations (FDPIR) authority; Law enforcement jurisdiction; cultural resource protection; Indian Child Welfare Act (ICWA); land management; tribal law and order jurisdiction; veterans affairs; energy development; coronavirus response; CARES Act.","Tribal-Federal relations; Indian Country funding; federal budgeting; education policy; law enforcement jurisdiction; land management; tribal law and order jurisdiction; veterans affairs; coronavirus response; CARES Act; Food Distribution on Indian Reservation (FDPIR) implementation; environmental regulation policy; Tribal Self-Governance policy; tribal membership policy.","Tax policy, Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation; Tribal self-government and self-determination regulation and implementation; land and natural resource management; gaming management; fee-to-trust acquisition issues; transportation policies; government to government consultation; UAS policy; Farm Bill policy and implementation.","Tax policy, Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation; Tribal self-government and self-determination regulation and implementation; land and natural resource management; gaming management; fee-to-trust acquisition issues; transportation policies; government to government consultation; UAS policy; Farm Bill policy and implementation; CARES Act implementation issues; Forest Service land management; Tribal Self-Governance Act implementation.","Tax policy, Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation; Tribal self-government and self-determination regulation and implementation; land and natural resource management; gaming management; fee-to-trust acquisition issues; transportation policies; government to government consultation; UAS policy; Forest Service land management; Tribal Self-Governance Act implementation; Reservation jurisdiction; tribal membership determination policies; environmental regulation authorities.","Tax policy, Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 implementation; Infrastructure Investment and Jobs Act implementation; federal housing policy; McGirt funding obligations; Tribal self-government and self-determination regulation and implementation; environment, land and natural resource management; gaming management; fee-to-trust acquisition issues; transportation policies; government to government consultation; Forest Service land management; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; tribal membership determination policies; environmental regulation authorities; vaccination mandates; federal agency access during COVID restrictions.","Tax policy; Infrastructure Investment and Jobs Act implementation; federal housing policy; McGirt funding obligations; Tribal self-government and self-determination regulation and implementation; environment, land and natural resource management; fee-to-trust acquisition issues; transportation policies; government to government consultation; Forest Service land management; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; tribal membership determination policies; environmental regulation authorities; federal agency access during COVID restrictions.","Infrastructure Investment and Jobs Act implementation; federal housing policy; McGirt funding obligations; Tribal self-government and self-determination regulation and implementation; environment, land and natural resource management; fee-to-trust acquisition issues; transportation policies; government to government consultation; Forest Service land management; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; tribal membership determination policies; environmental regulation authorities.","Infrastructure Investment and Jobs Act implementation; federal housing policy; McGirt funding obligations; Tribal self-determination implementation; environment, land and natural resource management; fee-to-trust acquisition issues; transportation policies; government to government consultation; Forest Service land management; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; tribal membership determination policies; environmental regulation authorities; American Rescue Plan Act implementation.","Infrastructure Investment and Jobs Act implementation; federal housing policy; McGirt funding obligations; Tribal self-determination implementation; environment, land and natural resource management; fee-to-trust acquisition issues; government to government consultation; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; environmental regulation authorities; American Rescue Plan Act implementation; treaty-authorized request to seat Choctaw Nation delegate in U.S. House; gaming regulation and authority; tribal tax authority.","Federal housing policy; McGirt funding obligations; environment, land and natural resource management; government to government consultation; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; tribal tax authority; ARPA implementation and reporting; Farm Bill tribal issues and forestry management and land restoration.","Federal housing policy; McGirt funding obligations; environment, land and natural resource management; government to government consultation; Tribal Self-Governance negotiated rulemaking implementation; Reservation jurisdiction; tribal tax authority; ARPA implementation and reporting; Farm Bill tribal issues and forestry management and land restoration; contract support cost administration.","FY 2025 criminal justice and broadband appropriations; tax reform; H.R. 8812 (WRDA; wildlife habitat legislation; trust land acquisition policy (Carcieri); CISA reporting requirements; CMS policy changes on contract support costs and four walls; food distribution emergency; CSC policy implementation and mandatory funding; Section 105(l) lease mandatory funding; meat processing policy; detention facility construction; self-governance regulation development; confirmation process for NIGC chair nominee; transfer of national forest lands; Build America, Buy American; Anti-money laundering; expansion of Pub.L. 93-638 authority to USDA; general welfare exclusion guidance; Corporate Transparency Act; Tribally chartered corporations guidance; pensions and fishery tax guidance; ARPA implementation.","Tax reform; WRDA enactment; trust land acquisition policy (Carcieri); food distribution emergency; CSC policy implementation and mandatory funding; self-governance regulation finalization; confirmation of NIGC chair nominee; expansion of Pub.L. 93-638 authority to USDA; general welfare exclusion guidance; Tribally chartered corporations guidance; ARPA implementation and reporting guidance; NAHASDA reauthorization and HUD Secretary tribal advisory committee; tribal recognition legislation; public safety and criminal jurisdiction; government contracting restrictions.","Federal Indian policy; funding and personnel reductions and BIA/IHS exemptions; nomination confirmations; Tribal Self-Governance policy; Tribal economic development policy; Tribal health policy; Treasury office of native affairs; legislative responses to Castro-Huerta decision; Tribally-chartered entity issue; FY 2026 appropriations.","Federal Indian policy; funding and personnel reductions and BIA/IHS exemptions; nomination confirmations; Tribal economic development policy; Tribal health policy; Treasury office of native affairs; Tribally-chartered entity issue; FY 2026 appropriations."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}