{"id":209836,"name":"CIGNA CORPORATION AND SUBSIDIARIES","slug":"cigna-corporation-and-subsidiaries","state":"DC","description":"Employee benefits company.","totalSpending":1620000,"filings":18,"yearlySpending":[{"year":2021,"income":270000},{"year":2022,"income":360000},{"year":2023,"income":360000},{"year":2024,"income":360000},{"year":2025,"income":270000}],"firms":["TIBER CREEK GROUP"],"lobbyists":["ANDREW MCKECHNIE","JAMES HEIMBACH","ASHLI PALMER","JOHN TWOMEY","TIMOTHY ROBINSON","JAN BEUKELMAN","NIKOLE BURROUGHS","JOSEPH RUSSO"],"issues":["MMM","HCR",null,"DEF"],"sampleDescriptions":["Proposals that impact Medicare Part D and ongoing implementation of payment and regulatory issues for the Medicare Advantage program.","Issues impacting insurance coverage, prescription drugs and the federal COVID response; Issues related to importation of prescription drugs.","Issues impacting insurance coverage, prescription drugs and the federal COVID response.","Proposals that impact Medicare Part D and ongoing implementation of payment and regulatory issues for the Medicare Advantage program; S. Con Res 14 and the impact on the expansion of Medicare benefits.","Proposals that impact Medicare Part D and ongoing implementation of payment and regulatory issues for the Medicare Advantage program; Issues related to H.R. 5376 - The Build Back Better Act's impact on Medicare Advantage and prescription drug pricing.","Proposals impacting Medicare Advantage and Medicare Part D.","Issues impacting insurance coverage, prescription drugs and the federal COVID response; Issues impacting mental health care; Issues impacting employer sponsored insurance.","Proposals impacting Medicare Advantage and Medicare Part D; Issues related to the Advance Notice of Methodological Changes for Calendar Year 2023 for Medicare Advantage (MA) Capitation Rates and Part C and Part D Payment Policies.","Issues impacting insurance coverage, prescription drugs, the federal COVID response; Mental health care; Employer sponsored insurance; Issues related to the H.R. 5376 - Build Back Better Act, budget reconciliation legislation; Issues related to S. 4293 - the Pharmacy Benefit Manager Transparency Act of 2022.","Proposals impacting Medicare Advantage and Medicare Part D; H.R. 5376 - Inflation Reduction Act of 2022 - Public Law No: 117-169.","Issues impacting insurance coverage, prescription drugs, the federal COVID response, mental health care, and employer sponsored insurance; Inflation Reduction Act of 2022 (PL 117-169).","Proposals impacting Medicare Advantage and Medicare Part D; Inflation Reduction Act of 2022 (PL 117-169). Issues related to health insurance, telemedicine, mental health, and prescription drugs in Consolidated Appropriations Act, 2023 (PL 117-328).","Issues impacting insurance coverage, prescription drugs, the federal COVID response, mental health care, and employer sponsored insurance; Issues related to health insurance, mental health, and prescription drugs in Consolidated Appropriations Act, 2023 (PL 117-328); Implementation of the Inflation Reduction Act of 2022 (PL 117-169).","Proposals impacting Medicare Advantage and Medicare Part D; Inflation Reduction Act of 2022 (PL 117-169); Issues related to pharmacy and prescription drug pricing policy; H.R.5378 - Lower Cost, More Transparency Act. Issues related to pharmacy, prescription drugs, and health insurance in the Consolidated Appropriations Act, 2024, HR 4366.","Proposals impacting employer sponsored insurance, Medicare Advantage and Medicare Part D; Inflation Reduction Act of 2022 (PL 117-169); Issues related to pharmacy and prescription drug pricing policy; H.R.5378 - Lower Cost, More Transparency Act. Issues related to pharmacy, prescription drugs, and health insurance in the Consolidated Appropriations Act, 2024, HR 4366.","Pharmacy issues related to TRICARE; National Defense Authorization Act of Fiscal Year 2024 (PL 118-31).","Proposals impacting Medicare Advantage and Medicare Part D; Inflation Reduction Act of 2022 (PL 117-169); Issues related to pharmacy and prescription drug pricing policy; H.R.5378 - Lower Cost, More Transparency Act.","Proposals impacting employer sponsored insurance, Inflation Reduction Act of 2022 (PL 117-169); Issues related to pharmacy and prescription drug pricing policy; H.R.5378 - Lower Cost, More Transparency Act.","Pharmacy issues related to TRICARE in H.R. 8070 - National Defense Authorization Act of Fiscal Year 2024.","Issues related to pharmacy and prescription drug pricing policy; policies in H.R.5378 - Lower Cost, More Transparency Act."],"years":[2021,2022,2023,2024,2025]}