{
  "id": 212787,
  "name": "CIRCLE",
  "slug": "circle",
  "state": "MA",
  "description": "Cryptocurrency and financial services company",
  "totalSpending": 1710000,
  "filings": 17,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 90000
    },
    {
      "year": 2022,
      "income": 370000
    },
    {
      "year": 2023,
      "income": 400000
    },
    {
      "year": 2024,
      "income": 410000
    },
    {
      "year": 2025,
      "income": 440000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "MATTHEW RUSSELL",
    "CAROLYN CODA",
    "QUINCY ENOCH",
    "JOEY SMITH",
    "NOAH MARINE",
    "JOSEPH VAUGHAN",
    "ZACHARY COOPER",
    "KELLY HITCHCOCK",
    "ALEJANDRO CISNEROS",
    "ALDEN KNOWLTON"
  ],
  "issues": [
    "BAN",
    "FIN",
    null,
    "TAX"
  ],
  "sampleDescriptions": [
    "Cryptocurrency and Financial Services",
    "Educate policymakers on Circle's business model; Educate members on stable coin and cryptocurrency issues; Monitor cryptocurrency proposals.",
    "Educate policymakers on Circle's business model; Educate members on stablecoin and cryptocurrency issues; Monitor cryptocurrency proposals.",
    "Educate policymakers on Circle's business model; Educate policymakers on stablecoin and cryptocurrency issues; Monitor cryptocurrency proposals, including S.4760, Digital Commodities Consumer Protection Act of 2022 and S.4356, Lummis-Gillibrand Responsible Financial Innovation Act to Circle.",
    "Educate policymakers on Circles business model; Educate members on stablecoin and cryptocurrency issues; Monitor cryptocurrency proposals, including S.4760, Digital Commodities Consumer Protection Act of 2022.",
    "Educate policymakers on Circles business model. Educate Members of Congress on stablecoin and cryptocurrency issues and legislation, including H.R.4763, the Financial Innovation and Technology for the 21st Century Act; H.R. 4766, the Clarity for Payment Stablecoins Act of 2023, and S.2281, the Lummis-Gillibrand Responsible Financial Innovation Act.; and anti-money laundering legislation, including S.2355, the Crypto-Asset National Security Enhancement and Enforcement Act, and S.266, the Digital Asset Anti Money Laundering Act. Monitor cryptocurrency proposals.",
    "Educate policymakers on Circles business model. Educate Members of Congress on stablecoin and cryptocurrency issues and legislation, including H.R.4763, the Financial Innovation and Technology for the 21st Century Act; H.R. 4766, the Clarity for Payment Stablecoins Act of 2023, and S.2281, the Lummis-Gillibrand Responsible Financial Innovation Act.; and anti-money laundering legislation, including S.2355, the Crypto-Asset National Security Enhancement and Enforcement Act, S.266, the Digital Asset Anti Money Laundering Act, S.5003, the VALOR Act. Monitor cryptocurrency proposals.",
    "Educate policymakers on Circles business model. Educate Members of Congress on stablecoin and cryptocurrency issues and legislation, including S. 394, the GENIUS Act of 2025. Monitor cryptocurrency proposals.",
    "Educate policymakers on Circles business model. Educate Members of Congress on stablecoin and cryptocurrency issues and legislation, including S. 1582, the GENIUS Act; H.R. 2392, the STABLE Act of 2025; and H.R. 3633, the CLARITY Act of 2025. Monitor cryptocurrency proposals.",
    "Educate policymakers on Circle's business model. Educate Members of Congress on stablecoin and cryptocurrency issues and legislation, including P.L. 119-27, the GENIUS Act; H.R. 2392, the STABLE Act of 2025; and H.R. 3633, the CLARITY Act of 2025. Monitor cryptocurrency proposals.",
    "Educate policymakers on tax proposals impacting the treatment of digital assets."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 389,
  "trajectory": "exploding",
  "yearsActive": 5,
  "avgAnnualSpending": 342000,
  "peakYear": 2025,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 3
}