{
  "id": 124831,
  "name": "CITY OF PHOENIX AZ",
  "slug": "city-of-phoenix-az",
  "state": "AZ",
  "description": "Local government",
  "totalSpending": 1960000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 280000
    },
    {
      "year": 2019,
      "income": 280000
    },
    {
      "year": 2020,
      "income": 280000
    },
    {
      "year": 2021,
      "income": 280000
    },
    {
      "year": 2022,
      "income": 140000
    },
    {
      "year": 2023,
      "income": 280000
    },
    {
      "year": 2024,
      "income": 140000
    },
    {
      "year": 2025,
      "income": 280000
    }
  ],
  "firms": [
    "HOLLAND & KNIGHT LLP"
  ],
  "lobbyists": [
    "LAURI HETTINGER",
    "DANIEL MALDONADO",
    "LESLIE POLLNER",
    "DAVID WHITESTONE",
    "LISA BARKOVIC",
    "BETH VIOLA",
    "KRISTIAN HAVARD",
    "ADRIANNA WILLIAMS"
  ],
  "issues": [
    "TRA",
    "ECN",
    "HOU",
    "ENV",
    "AVI",
    "IMM",
    "HOM",
    "WEL",
    "LAW",
    "GOV",
    "BUD",
    "ENG",
    null,
    "EDU"
  ],
  "sampleDescriptions": [
    "Transportation legislation and regulation and related federal appropriations and grant programs; South Central Light Rail Extension; I-10/Capital project.",
    "Omnibus Appropriations including FY18 Economic Development funding; passage and implementation of Opportunity Zones Program.",
    "Omnibus Appropriations Bill, including FY18 Community Development Block Grant; HOME; homelessness and other HUD program funding.",
    "Clean water and other environmental legislation and regulation; Rio Salado Oeste; S.2563, Water Supply Infrastructure and Drought Resilience Act of 2018.",
    "Aviation legislation and regulation; Transportation Security Administration activities.",
    "2020 Census; DACA students/Dreamers Legislation; Immigration policy and funding.",
    "Omnibus Appropriations bill, including Urban Areas Security Initiative funding; disaster assistance and hazard mitigation assistance; SAFER Grants; Department of Homeland Security Appropriations; Commerce, Justice, Science, and Related Agencies Appropriations.",
    "Omnibus Appropriations bill including FY18 Workforce Innovation and Opportunity Act funding.",
    "Omnibus Appropriations bill, including Commerce, Justice, Science, and Related Agencies Appropriations.",
    "Regional Catastrophic Preparedness Grant funding; disaster assistance and hazard mitigation assistance; SAFER Grants; FY 2019 Department of Homeland Security Appropriations; FY 2019 Commerce, Justice, Science, and Related Agencies Appropriations; Urban Search & Rescue.",
    "FY 2019 Appropriations:  COPS funding and Bureau of Justice Assistance.",
    "Appropriations, including FY19 Economic Development funding; passage and implementation of Opportunity Zones Program.",
    "HUD Appropriations Bill, including FY19 Community Development Block Grant; HOME; homelessness and other HUD program funding; support for Choice Neighborhood funding.",
    "FY19 Workforce Innovation and Opportunity Act funding, including Job Corps site lease arrangement.",
    "Regional Catastrophic Preparedness Grant funding; disaster assistance and hazard mitigation assistance; SAFER Grants; FY 2019 Department of Homeland Security Appropriations; FY 2019 Commerce, Justice, Science, and Related Agencies Appropriations; Urban Search & Rescue; Urban Areas Security Initiative (UASI) Program.",
    "HUD Appropriations Bill, including Community Development Block Grant; HOME; homelessness and other HUD program funding; support for Choice Neighborhood funding.",
    "Disaster assistance and hazard mitigation assistance; FY 2020 Department of Homeland Security Appropriations; FY 2020 Commerce, Justice, Science, and Related Agencies Appropriations; Urban Search & Rescue; Urban Areas Security Initiative (UASI) Program.",
    "FY 2019 Appropriations: COPS funding and Bureau of Justice Assistance.",
    "Appropriations, including FY2020 Economic Development funding and implementation of Opportunity Zones Program.",
    "FY2020 HUD Appropriations Bill, including Community Development Block Grant; HOME; homelessness and other HUD program funding; support for Choice Neighborhood funding."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 245000,
  "peakYear": 2018,
  "lobbyistCount": 8,
  "firmCount": 1,
  "issueCount": 13
}