{"id":125118,"name":"CITY OF ATLANTA, GA","slug":"city-of-atlanta-ga","state":"GA","description":null,"totalSpending":2020000,"filings":25,"yearlySpending":[{"year":2018,"income":440000},{"year":2019,"income":360000},{"year":2020,"income":440000},{"year":2021,"income":180000},{"year":2022,"income":360000},{"year":2024,"income":120000},{"year":2025,"income":120000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["RICHARD GOLD","SHAWNA FRANCIS WATLEY","TANVI PUROHIT","DAVID WHITESTONE","LAURI HETTINGER","JENNY BUSBY","ASHLEY LAWRENCE","KRISTIAN HAVARD"],"issues":["TRA","AVI","LAW","NAT","HOM"],"sampleDescriptions":["Funding related to multimodal corridors; TIGER Grant, Streetcar funding, Beltline.","Oversight of airport access control systems; FAA Reauthorization","Justice Assistance Grant","Water Resources legislation; Proctor Creek Funding.","Oversight of airport access control systems; FAA Reauthorization.","Justice Assistance Grant.","Proctor Creek Funding; affordability, water workforce in S.2580, Department of the Interior, Environment, and Related Agencies Appropriations Act, 2020.","Funding related to multimodal corridors; BUILD Grant, Streetcar funding, Beltline.","Proctor Creek Funding; affordability, water workforce in FY 2021 Department of the Interior, Environment, and Related Agencies Appropriations.","Oversight of airport access control systems.","Proctor Creek Funding; affordability, water workforce in FY 2022 Department of the Interior, Environment, and Related Agencies Appropriations.","Proctor Creek Funding; affordability, water workforce in FY 2023 Department of the Interior, Environment, and Related Agencies Appropriations.","Funding related to multimodal corridors; RAISE Grant, Streetcar funding, Beltline.","Oversight of airport access control systems; TSA operations.","Oversight of airport access control systems; TSA operations; issues impacting Hartsfield-Jackson Atlanta International Airport.","Grant assurances.","One Stop Security Program; TSA biometrics."],"years":[2018,2019,2020,2021,2022,2024,2025]}