{"id":171528,"name":"CITY OF SAN FRANCISCO (WATER AND POWER DIVISION)","slug":"city-of-san-francisco-water-and-power-division","state":"CA","description":"San Francisco Public Utilities Commission provides water, power, and sewer services","totalSpending":1320000,"filings":22,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":300000},{"year":2020,"income":420000},{"year":2021,"income":240000},{"year":2022,"income":120000}],"firms":["OWEN EVANS INGOLS"],"lobbyists":["DARYL OWEN","ADAM INGOLS","BRUCE EVANS"],"issues":["UTI"],"sampleDescriptions":["Issues associated with California water rights and hydroelectric power","Issues associated with California water rights and hydroelectric power; issues associated with WIFIA; issues associated with H.R. 5895 - Energy and Water appropriations bill and H.R. 6147 - Interior and Related Agencies appropriations bill","Issues associated with California water rights and hydroelectric power; issues associated with WIFIA; issues associated with H.R. 5895 - Energy and Water appropriations bill; H.R. 6147 - Interior and Related Agencies appropriations bill; S. 3021 - Americas Water Infrastructure Act","Issues associated with California water rights and hydroelectric power; issues associated with WIFIA.","Issues associated with water, wastewater, hydroelectric power, solar power, and general environmental policy","Issues associated with California water rights, environmental policy, and administration of revolving funds at the EPA","Issues associated with California water rights, environmental policy, and administration of revolving funds at the EPA; H.R. 3055 - Interior and Environment omnibus appropriations","Issues associated with California water rights, environmental policy, and administration of revolving funds at the EPA; \nH.R. 1865, Domestic Priorities and International Assistance Appropriations Minibus, H.R. 1158, National Security Appropriations Minibus","Issues associated with California water rights, environmental policy, and administration of revolving funds at the EPA; H.R. 2960 & S. 2470 - Energy & Water Development appropriations, 2020","Issues associated with California water rights, environmental policy, and administration of revolving funds at the EPA; \nH.R.748 - CARES Act","Issues associated with California water rights, environmental policy, Corps projects, and administration of WIFIA and revolving funds at the EPA; general issues related to the operation of municipal water and power utilities; H.R. 7575 WRDA 2020; S. 3591 America's Water Infrastructure Act; S. 3590 Drinking Water Infrastructure Act; HR 7613 - Energy and Water Development appropriations and Senate companion legislation","Issues associated with California water rights, environmental policy, Corps projects, and administration of WIFIA and revolving funds at the EPA; general issues related to the operation of municipal water and power utilities; H.R. 7575 WRDA 2020; S. 3591 America's Water Infrastructure Act; S. 3590 Drinking Water Infrastructure Act; HR 7613 - Energy and Water Development appropriations and Senate companion legislation; HR 7612  - Interior and Related Agencies appropriations and Senate companion","Issues associated with California water rights, environmental policy, Corps projects, and administration of WIFIA and revolving funds at the EPA; general issues related to the operation of municipal water and power utilities; H.R. 133 - FY2021 Omnibus and COVID Relief and Response Act","Issues related to water and wastewater infrastructure; issues concerning municipal electric utilities; issues related to climate change; H.R.1319 - American Rescue Plan Act of 2021","Issues related to water and wastewater infrastructure; issues concerning municipal electric utilities; issues related to climate change; Energy and Water Development appropriations bills (House and Senate)","Issues related to water and wastewater infrastructure; issues concerning municipal electric utilities; issues related to climate change; Energy and Water Development appropriations bills (HR 4549 and S 2605); H.R.3684 Infrastructure Investment and Jobs Act","Issues related to water and wastewater infrastructure; issues concerning municipal electric utilities; issues related to climate change and beach replenishment; Energy and Water Development appropriations bills (HR 4549 and S 2605); H.R.3684 Infrastructure Investment and Jobs Act","Issues related to water and wastewater infrastructure; issues concerning municipal electric utilities; issues related to climate change and beach replenishment; Energy and Water Development appropriations bills (HR 4549 and S 2605); issues related to HR 2471 - Consolidated Appropriations Act for FY 2022; issues related to implementation of the Infrastructure Investment and Jobs Act (Law)","Issues related to water and wastewater infrastructure; issues concerning municipal electric utilities; issues related to climate change and beach replenishment; Energy and Water Development appropriations bills (HR 8255 and the Senate companion); issues related to implementation of the Infrastructure Investment and Jobs Act (Law); HR 7776 and S. 4136 - Water Resources Development Act of 2022"],"years":[2018,2019,2020,2021,2022]}