{"id":100481,"name":"CITY OF HOUSTON","slug":"city-of-houston","state":"TX","description":null,"totalSpending":1350000,"filings":27,"yearlySpending":[{"year":2018,"income":100000},{"year":2019,"income":250000},{"year":2020,"income":200000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":200000}],"firms":["AKIN GUMP STRAUSS HAUER & FELD"],"lobbyists":["SUSAN LENT","GEOFF VERHOFF","LAUREN O'BRIEN","HEIDE BAJNRAUH","HANS RICKHOFF","KENDALL HUSSEY","VIRGIL MILLER"],"issues":["LAW","DIS","BUD","GOV","HCR","TRA","ENV","HOU"],"sampleDescriptions":["Advocate for funding for police helicopters","Support for FEMA volunteer match program; support for equitable and timely distribution of community development block grant disaster recovery funding.","Support for funding of transportation, law enforcement, NASA, housing, homeland security and health programs in FY 2019 appropriations legislation, (H.R.6072,S.3023;H.R.6147,S.3073;S.3109;H.R.5895,S.2975;H.R.5952,S.3072).","Support for funding of transportation and housing, law enforcement, NASA, homeland security and health programs in FY 2019 appropriations legislation, (H.R.6072,S.3023;H.R.5952,S.3072; H.R.6147,S.3073;S.3109;H.R.5895,S.2975;H.R.6470,S.3158).","Support for reforms to FEMA Hazard Mitigation Grant Program; support for prompt release of FEMA funds and CDBG mitigation funds.","Appeal of Census findings.","Advocate for funding for police helicopters.","Support for reforms to FEMA Hazard Mitigation Grant Program; support for prompt release of FEMA funds and CDBG mitigation\nfunds.","Support for funding of transportation and housing, law enforcement, NASA, homeland security and health programs in FY 2020 appropriations legislation.","Eligibility issues for CDC Overdose Data to Action grant program.","Support for reforms to FEMA Hazard Mitigation Grant Program; support for prompt release of FEMA funds and CDBG mitigation funds; support for passage of H.R.2548, Hazard Eligibility and Local Projects Act.","Support for prompt release of FEMA and CDBG mitigation funds and for eligibility determinations regarding flood control projects","Supplemental funding to address affects of COVID-19 and support for funding of transportation and housing, law enforcement, NASA, homeland security and health programs in FY 2021 appropriations legislation.","Eligibility issues for CDC Overdose Data to Action grant program; funding for ETHAN telemedicine program; federal support for COVID-19 testing.","Support for allocation of CDBG funds to Houston.","Support for City control of CDBG program funding.","Federal support for COVID-19 testing and ETHAN telemedicine.","Supplemental funding to address affects of COVID-19 and support for funding of transportation and housing, law enforcement, NASA, homeland security and health programs in FY 2021 appropriations legislation; support for EPA grant.","Support for flood control projects.","Supplemental funding to address affects of COVID-19 and support for funding of transportation and housing, law enforcement, NASA, homeland security and health programs in Coronavirus Preparedness and Response Supplemental Appropriations Act, 2021, Pub. Law 116-123; support for EPA grant; support for clean energy programs."],"years":[2018,2019,2020,2021,2022,2024,2025]}