{
  "id": 124978,
  "name": "CITY OF NORFOLK VIRGINIA",
  "slug": "city-of-norfolk-virginia",
  "state": "VA",
  "description": null,
  "totalSpending": 1450000,
  "filings": 33,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 160000
    },
    {
      "year": 2019,
      "income": 160000
    },
    {
      "year": 2020,
      "income": 160000
    },
    {
      "year": 2021,
      "income": 160000
    },
    {
      "year": 2022,
      "income": 160000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 250000
    }
  ],
  "firms": [
    "HOLLAND & KNIGHT LLP"
  ],
  "lobbyists": [
    "LISA BARKOVIC",
    "CHRISTOPHER DELACY",
    "LAURI HETTINGER"
  ],
  "issues": [
    "BUD",
    "URB",
    "ENV",
    "HOM",
    "ECN",
    "TRA",
    "HOU",
    "GOV",
    null
  ],
  "sampleDescriptions": [
    "FY19 Energy & Water Appropriations Act, 2018 Army Corps of Engineers funding for flood study.",
    "Land use issues related to federal property in Norfolk, VA.",
    "Army Corps of Engineers funding for flood study.",
    "Norfolk Customs House pedestrian pathway.",
    "Land use issues related to federal property in Norfolk, VA; Department of Homeland Security Appropriations Act, 2019, Customs & Border Protection.",
    "H.R. 8, Water Resources Development Act of 2018 - Authorization of project for coastal storm risk management, Norfolk, Virginia.",
    "FY19 Energy & Water Appropriations Act, FY19 Army Corps of Engineers funding for flood study.",
    "Land use issues related to federal property in Norfolk, VA; H.R. 6776, Department of Homeland Security Appropriations Act, 2019.",
    "Opportunity Zones.",
    "FY20 Energy & Water Appropriations Act, FY20 Army Corps of Engineers work plan funding for flood study.",
    "Build Grant",
    "Better Utilizing Investments to Leverage Development (BUILD) grant.",
    "FY21 Energy & Water Appropriations Act, FY21 Army Corps of Engineers work plan funding for flood study.",
    "FY 2021 Transportation-HUD appropriations bill - Department of Housing and Urban Development-Community Planning and Development-Community Development Fund in chapter 9 of title X of the Disaster Relief Appropriations Act, 2013 (Public Law 113-2, division A; 6 127 Stat. 36) - extension of program until September 30, 2025.",
    "H. R. 748, Coronavirus Aid, Relief, and Economic Security Act and H.R.6800, Health and Economic Recovery Omnibus Emergency Solutions Act - local government issues related to COVID-19.",
    "H.R. 7616, FY 2021 Transportation-HUD appropriations bill - Department of Housing and Urban Development and H.R. 8337, Continuing Appropriations Act - Community Planning and Development-Community Development Fund in chapter 9 of title X of the Disaster Relief Appropriations Act, 2013 (Public Law 113-2, division A; 6 127 Stat. 36) - extension of program until September 30, 2025.",
    "H.R. 7613, FY 2021 Energy & Water Appropriations Act, FY 2021 Army Corps of Engineers work plan, H.R. 7575, Water Resources Development Act of 2020, S.3591, America's Water Infrastructure Act of 2020, funding for Norfolk Coastal Storm Risk Management Project.",
    "H. R. 748, Coronavirus Aid, Relief, and Economic Security Act and H.R.6800, Health and Economic Recovery Omnibus Emergency Solutions Act, Amendment No. 2652 to S.178, Senate COVID-19 relief bill -  local government issues related to COVID-19.",
    "The American Jobs Plan (Biden infrastructure plan); FY 2022 Transportation-HUD Appropriations Act; H.R. 2, Moving Forward Act.",
    "FY 2022 Energy & Water Appropriations Act; FY 2022 Army Corps of Engineers work plan; funding for Norfolk Coastal Storm Risk Management Project; S.914, Drinking Water and Wastewater Infrastructure Act of 2021; H.R. 1848, Leading Infrastructure for Tomorrows America Act."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 56,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 181250,
  "peakYear": 2025,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 8
}