{"id":140210,"name":"CMS ENERGY CORP","slug":"cms-energy-corp","state":"MI","description":"Electric and natural gas utility.","totalSpending":1150000,"filings":26,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":90000},{"year":2020,"income":190000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":150000}],"firms":["K&L GATES, LLP"],"lobbyists":["SCOTT ALIFERIS","DANIEL CROWLEY","DEAN BRAZIER","SCOTT NELSON","BART GORDON","WILLIAM KIRK","MARY BAKER","STEVEN VALENTINE","TIM PECKINPAUGH","DANIEL COHEN","THOMAS FULTON","SCOTT GELBMAN","MATTHEW LEGGETT","DAVID SKILLMAN"],"issues":["FIN","TAX","ENG","BAN","ENV","TRA"],"sampleDescriptions":["S. 2155 - Economic Growth, Regulatory Relief, and Consumer Protection Act - section 203, Community Bank Relief.\nH.R. 4790 - Volker Rule Regulatory Harmonization Act - Entire bill.","S. 2155 - Economic Growth, Regulatory Relief, and Consumer Protection Act - section 203, Community Bank Relief.\nH.R. 4790 - Volcker Rule Regulatory Harmonization Act - Entire bill.\nH.R. 5659 - Volcker Rule Relief Act of 2018 - Entire bill.","Issues related to the implementation of the Volcker Rule - Dodd Frank Act - no specific legislation.","Issues related to American Energy Bond proposal - no specific legislation.","H.R. 5180 Protecting Consumers from Market Manipulation Act and S. 2839 - Eliminating Corporate Shadow Banking Act of 2019 - Issues related to the implementation of the Volcker Rule - Dodd Frank Act","Issues related to refundable tax credit proposals - no specific legislation.","Proposal to prohibit utility shut-off for debt collection related to Covid-19 - no specific legislation.","Issues related to tax credits for solar energy and and renewable investments - no specific legislation.","Issues related to industrial banks - no specific legislation.","H.R. 2931 - Enhancing Grid Security through Public-Private Partnerships Act - Issues related to tax credits for solar energy and and renewable investments.","Issues related to Brownfields - no specific legislation.","H.R. 5376 (P.L. 117-169) - Inflation Reduction Act of 2022 - Issues related to tax credits for solar energy and and renewable investments.","Issues related to energy legislation - no specific legislation.","Issues related to Federal trucking regulation - no specific legislation.","Issues related to tax policy in 2025 - no specific legislation.","H.R. 1, One Big Beautiful Bill - issues related to tax policy in 2025."],"years":[2018,2019,2020,2021,2022,2024,2025]}