{"id":208895,"name":"COALITION FOR ENERGY ASSISTANCE MODERNIZATION","slug":"coalition-for-energy-assistance-modernization","state":"DC","description":"Collection of utilities committed to serving low-income customers.","totalSpending":1410000,"filings":20,"yearlySpending":[{"year":2021,"income":280000},{"year":2022,"income":260000},{"year":2023,"income":310000},{"year":2024,"income":280000},{"year":2025,"income":280000}],"firms":["FORBES-TATE"],"lobbyists":["FRANKLYN STEINBERG","RYAN MCCONAGHY","RACHEL MILLER","KRISTINA DUNKLIN","WESLEY WELCH","JEFFREY STRUNK","RICHARD LOPEZ"],"issues":["BUD","ENG",null],"sampleDescriptions":["Issues pertaining to federal energy assistance programs, including LIHEAP.","Issues pertaining to implementation of the CARES Act (Public Law No: 116-136) and the H.R. 1319 - American Rescue Plan Act of 2021 (Public Law No. 117-2).","Issues pertaining to federal energy assistance programs, including Low Income Home Energy Assistance Program (LIHEAP), in fiscal year 2022 appropriations (Public Law No. 117-103). Issues related to FY 2023 Labor-HHS-Education Appropriations, including Low Income Home Energy Assistance Program (LIHEAP).","Issues pertaining to implementation of the CARES Act (Public Law No: 116-136) and the H.R. 1319 - American Rescue Plan Act of 2021 (Public Law No. 117-2). Issues related to Low Income Home Energy Assistance Program (LIHEAP) in the Infrastructure Investment and Jobs Act (Pubic Law No. 11758).","Issues related to FY 2023 Labor-HHS-Education Appropriations, including Low Income Home Energy Assistance Program (LIHEAP).","Issues related to funding and administration of the Low Income Home Energy Assistance Program (LIHEAP); issues related to H.R.6833 - Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023.","Issues related to funding and administration of the Low Income Home Energy Assistance Program (LIHEAP).","Issues related to funding and administration of the Low Income Home Energy Assistance Program (LIHEAP); including through H.R. 5894 - FY 2024 Labor, HHS, Education Appropriations; Issues related to LIHEAP Funding in September & November Continuing Resolutions.","Issues related to funding and administration of the Low Income Home Energy Assistance Program (LIHEAP); including through FY 2025 Labor, HHS, Education Appropriations.","Issues related to funding and administration of the Low-Income Home Energy Assistance Program (LIHEAP); including through H.R.5894 - FY 2025 Labor, HHS, Education Appropriations.","Issues related to funding and administration of the Low Income Home Energy Assistance Program (LIHEAP), including through H.R. 5894 - FY 2025 Labor, HHS, Education Appropriations; H.R. 10445, the Further Continuing Appropriations and Disaster Relief Supplemental Appropriations Act, 2025."],"years":[2021,2022,2023,2024,2025]}