{"id":139540,"name":"CONFEDERATED TRIBES OF THE COLVILLE RESERVATION","slug":"confederated-tribes-of-the-colville-reservation","state":"WA","description":"Federally Recognized Indian Tribe.","totalSpending":2090000,"filings":31,"yearlySpending":[{"year":2018,"income":210000},{"year":2019,"income":350000},{"year":2020,"income":250000},{"year":2021,"income":230000},{"year":2022,"income":320000},{"year":2023,"income":250000},{"year":2024,"income":250000},{"year":2025,"income":230000}],"firms":["POWERS PYLES SUTTER & VERVILLE, P.C."],"lobbyists":["BRIAN GUNN","PAUL MOOREHEAD","NATASHA JOHN"],"issues":["IND",null],"sampleDescriptions":["Wildfire funding matters; forestry matters; Indian health care matters; dental therapy matters; Indian Trust Asset Reform Act implementation; Lake Roosevelt matters;H.R.1967, the Bureau of Reclamation Pumped Storage Hydropower Development Act; Native American Energy Act (H.R. 210, S.245), Tribal Social Security Fairness Act (H.R. 1205); H.R. 3144, Softwood Lumber Agreement issues, and Indian health facilities issues, hydropower issues.","Wildfire funding matters; forestry matters; Indian health care matters; dental therapy matters; Indian Trust Asset Reform Act implementation; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act; Native American Energy Act (H.R. 210, S.245); H.R. 3144, and Indian health facilities issues, hydropower issues, Farm Bill.","Wildfire funding matters; forestry matters; Indian health care matters; dental therapy matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act; Native American Energy Act (H.R. 210, S.245); H.R. 3144, and Indian health facilities issues, hydropower issues, Farm Bill.","Forestry matters; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act; Native American Energy Act (H.R.210, S.245)implementation; H.R.3144 (a bill to provide for operations of the Federal Columbia River Power System pursuant to a certain operation plan for a specified period of time, and for other purposes); Indian health facilities issues; hydropower issues; and Farm Bill Implementation.","Forestry matters; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act (H.R.537); Implementation of the Indian Tribal Energy Development and Self-Determination Act Amendments of 2017 (Pub.L.115-325); Indian health facilities issues; hydropower issues; 2018 Farm Bill Implementation; Savanna's Act (H.R.2733); and sacred sites legislation.","Forestry matters; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act (H.R.537); Implementation of the Indian Tribal Energy Development and Self-Determination Act Amendments of 2017 (Pub.L.115-325); Indian health facilities issues; hydropower issues; 2018 Farm Bill Implementation; Savanna's Act (H.R.2733); tribal transportation issues and sacred sites legislation.","Forestry matters; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act (H.R.537); Implementation of the Indian Tribal Energy Development and Self-Determination Act Amendments of 2017 (Pub.L.115-325); Indian health facilities issues; hydropower issues; 2018 Farm Bill Implementation; Savanna's Act (H.R.2733); tribal transportation issues; sacred sites legislation; Federal Unemployment Tax and IHS Joint Venture.","Forestry matters; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act (H.R.537); Indian health facilities issues; hydropower issues; 2018 Farm Bill Implementation; Savanna's Act (H.R.2733); tribal transportation issues; sacred sites legislation; Federal Unemployment Tax; IHS Joint Venture; COIVD Relief Fund implementation.","Forestry matters; National Prescribed Fire Act (S.4625); Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage Hydropower Development Act (H.R.537); Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; Federal Unemployment Tax; IHS Joint Venture; COIVD Relief Fund implementation; Office of the Special Trustee issues.","Forestry matters; National Prescribed Fire Act; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage; Hydropower Development Act; Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; COVID-19 Relief Fund implementation; and Office of the Special Trustee issues.","Forestry matters; National Prescribed Fire Act; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage; Hydropower Development Act; Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; COVID-19 Relief Fund implementation; Office of the Special Trustee issues; infrastructure and reconciliation issues; fish passage; and H.R.3684 - Infrastructure Investment and Jobs Act.","Forestry matters; National Prescribed Fire Act; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage; Hydropower Development Act; Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; COVID-19 Relief Fund implementation; Office of the Special Trustee issues; infrastructure and reconciliation issues; fish passage; H.R.3684 - Infrastructure Investment and Jobs Act; and tribal law enforcement.","Forestry matters; National Prescribed Fire Act; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage; Hydropower Development Act; Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; COVID-19 Relief Fund implementation; Office of the Special Trustee issues; infrastructure and reconciliation issues; fish passage; H.R.3684 - Infrastructure Investment and Jobs Act; and tribal law enforcement issues.","Forestry matters; National Prescribed Fire Act; Indian health care matters; Lake Roosevelt matters; the Bureau of Reclamation Pumped Storage; Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; COVID-19 Relief Fund implementation; Office of the Special Trustee issues; infrastructure and reconciliation issues; fish passage; and tribal law enforcement issues.","Forestry matters; National Prescribed Fire Act; Indian health care matters; Lake Roosevelt matters; Indian health facilities issues; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; Office of the Special Trustee issues; infrastructure and reconciliation issues; fish passage; tribal law enforcement issues, Tribal Law Enforcement Parity Act (H.R. 8373); Advancing Tribal Parity on Public Land Act (H.R. 8108); and wildfire issues.","Forestry matters; Indian health care matters; Lake Roosevelt matters; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; Office of the Special Trustee issues; fish passage; tribal law enforcement issues, Tribal Law Enforcement Parity Act; Advancing Tribal Parity on Public Lands Act; wildfire issues; fee-to-trust issues; and H.R.7515, H.R.7516, and S.3797.","Forestry matters; Indian health care matters; Lake Roosevelt matters; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; fish passage; tribal law enforcement issues, Tribal Law Enforcement Parity Act; Advancing Tribal Parity on Public Lands Act; wildfire issues; fee-to-trust issues; and H.R.7515, H.R.7516, and S.3797; Indian gaming regulatory issues.","Forestry matters; Indian health care matters; Lake Roosevelt matters; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; sacred sites legislation; IHS facility issues; fish passage; tribal law enforcement issues, Tribal Law Enforcement Parity Act; Advancing Tribal Parity on Public Lands Act; wildfire issues; fee-to-trust issues; H.R.7515, H.R.7516, and S.3797; Indian gaming regulatory issues; Self-Determination and funding and workforce issues.","Forestry matters; Indian health care matters; Lake Roosevelt matters; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; IHS facility issues; fish passage; tribal law enforcement issues, Tribal Law Enforcement Parity Act; wildfire issues; fee-to-trust issues; Indian gaming regulatory issues; Self-Determination and funding and workforce issues.","Forestry matters; Indian health care matters; Lake Roosevelt matters; hydropower issues; Good Neighbor Authority issues; tribal transportation issues; IHS facility issues; fish passage; tribal law enforcement issues, Tribal Law Enforcement Parity Act; wildfire issues; fee-to-trust issues; Indian gaming regulatory issues; Self-Determination and funding and workforce issues; H.R. 9310."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}