{
  "id": 100655,
  "name": "CORECIVIC INC",
  "slug": "corecivic-inc",
  "state": "TN",
  "description": null,
  "totalSpending": 2160000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 180000
    },
    {
      "year": 2019,
      "income": 180000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 320000
    },
    {
      "year": 2022,
      "income": 400000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 320000
    }
  ],
  "firms": [
    "AKIN GUMP STRAUSS HAUER & FELD"
  ],
  "lobbyists": [
    "JAMES TUCKER",
    "SEAN D'ARCY",
    "JEFF MCMILLEN",
    "ZACHARY RUDISILL",
    "JULIE NOLAN",
    "ED PAGANO",
    "WILLIAM STAMPER"
  ],
  "issues": [
    "GOV",
    "FIN",
    "TAX",
    "CIV",
    "MMM",
    null
  ],
  "sampleDescriptions": [
    "Issues pertaining to the construction and management of privately-operated prisons and detention facilities. Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Discussions regarding financial industry practices.",
    "Issues pertaining to the construction and management of privately-operated prisons and detention facilities. Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's\nincarceration or detention.",
    "Tax treatments of REITS",
    "Issues related to management of private detention facilities.",
    "Issues pertaining to the construction and management of privately-operated prisons and detention facilities.; Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Issues pertaining to the management of privately-operated prisons and detention facilities.; Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Issues pertaining to the management of privately-operated prisons and detention facilities; Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "S. 481 - Democracy Restoration Act of 2021.\n\nConsistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "S.481 - Democracy Restoration Act of 2021; Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Implementation of SUPPORT Act Section 5032 (P.L. 115-271).",
    "Implementation of SUPPORT Act Section 5032 (P.L. 115-271). Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Issues pertaining to the construction and management of detention facilities and issues related to successful re-entry, including H.R.8028 - Second Chance Reauthorization Act of 2024. Consistent with CCA policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Issues pertaining to the construction and management of detention facilities and issues related to successful re-entry, including H.R.8028 - Second Chance Reauthorization Act of 2024. Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Issues pertaining to the construction and management of detention facilities. Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention.",
    "Issues pertaining to the management of detention facilities. Consistent with CoreCivic policy, Akin Gump does not lobby for or against any policies or legislation that would determine the basis for an individual's incarceration or detention."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 78,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 270000,
  "peakYear": 2022,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 5
}