{
  "id": 167107,
  "name": "CORELOGIC",
  "slug": "corelogic",
  "state": "DC",
  "description": "Data Services",
  "totalSpending": 1500000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 150000
    },
    {
      "year": 2019,
      "income": 150000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "GEOFFREY P. GRAY"
  ],
  "lobbyists": [
    "GEOFFREY GRAY"
  ],
  "issues": [
    "CSP",
    null
  ],
  "sampleDescriptions": [
    "General issues related to credit reporting, technology, data security, and housing.  Specific issues included: re-authorization of the National Flood Insurance Program (HR 1422, HR 1558, HR 2246, HR 2565, HR 2868, HR 2875, HR 2874, and draft Senate legislation), issues related to reconstruction cost; proposals on data security and breach response, including S.1816, the \"Freedom from Equifax Exploitation Act\" (Warren), S.2155, the \"Economic Growth, Regulatory Relief and Consumer Protection Act\" (Crapo), issues impacting resellers of consumer reports, H.R. 4028, the \"Promoting Responsible Oversight of Transactions and Examinations of Credit Technology\" Act of 2017, or the \"PROTECT Act\" (McHenry), issues impacting the use of social security numbers, S 2362 (Reed) \"Control Your Personal Credit Information Act of 2018\", S 2289 (Warren) \"Data Breach Prevention and Compensation Act of 2018\", and draft proposals by Cong. Luetkemeyer and the House E&C Committee; and proposals to modernize the IRS IVES system and their impact on the mortgage industry, including the \"IRS Data Verification Modernization Act of 2017\" (McHenry).",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process (HR 1422, HR 1558, HR 2246, HR 2565, HR 2868, HR 2875, HR 2874, and draft Senate legislation), issues related to reconstruction cost and general extension of the program; proposals on data security, breach notice and breach response, including S 2289 (Warren) \"Data Breach Prevention and Compensation Act of 2018\", and H.R. 6743, the \"Consumer Information Notification Requirement Act\" (Luetkemeyer), issues related to preemption and functional regulation; and proposals to modernize the IRS IVES system and their impact on the mortgage industry, including the \"IRS Data Verification Modernization Act of 2017\" (McHenry).",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft proposals on FCRA reform, privacy, data security, breach notice and breach response, issues related to preemption and functional regulation; proposals to modernize the IRS IVES system and their impact on the mortgage industry; and reform of the regulation of Fannie Mae and Freddie Mac.",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft proposals on FCRA reform, privacy, data security, breach notice and breach response, issues related to preemption and functional regulation; proposals to modernize the IRS IVES system and their impact on the mortgage industry; reform of the regulation of Fannie Mae and Freddie Mac; natural hazard tracking and its impact on lending and housing; corona virus relief legislation, phases I, II, and III, issues impacting the mortgage industry and credit reporting.",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft proposals on FCRA reform, privacy, data security, breach notice and breach response, issues related to preemption and functional regulation; proposals to modernize the IRS IVES system and their impact on the mortgage industry; reform of the regulation of Fannie Mae and Freddie Mac; natural hazard tracking and its impact on lending and housing; corona virus relief legislation, phase III (CARES Act), the HEROES Act (HR 6800) and other draft phase IV proposals, issues impacting the mortgage industry, housing and credit reporting.",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft proposals on FCRA reform, privacy, data security, breach notice and breach response, issues related to preemption and functional regulation; proposals to modernize the IRS IVES system and their impact on the mortgage industry; reform of the regulation of Fannie Mae and Freddie Mac; natural hazard risk tracking and its impact on lending and housing; corona virus relief legislation, phases I, II, III (CARES Act), and IV, issues impacting the mortgage industry, housing and credit reporting.",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft proposals on FCRA reform, privacy, data security, breach notice and breach response, issues related to preemption and functional regulation; reform of the regulation of Fannie Mae and Freddie Mac; natural hazard and climate risk tracking and its impact on lending and housing; corona virus relief legislation, phase IV, issues impacting the mortgage industry, housing and credit reporting; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft proposals on FCRA reform, privacy, data security, breach notice and breach response, issues related to preemption and functional regulation; reform of the regulation of Fannie Mae and Freddie Mac; natural hazard and climate risk tracking and its impact on lending and housing; corona virus relief legislation, issues impacting the mortgage industry, housing and credit reporting; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy, data security, cyber, ransomware, and breach notice proposals, including in the context of the \"National Defense Authorization Act\" (HR 4350), issues related to preemption and functional regulation; reform of the regulation of Fannie Mae and Freddie Mac; natural hazard and climate risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy, data security, cyber, ransomware, and breach notice proposals, including in the context of the \"National Defense Authorization Act\" (HR 4350), issues related to preemption and functional regulation; natural hazard and climate risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy, data security, cybersecurity, climate-risk, and breach notice proposals, including in the context of SEC rulemaking, issues related to preemption and functional regulation; natural hazard and climate risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy, data security, cybersecurity, climate-risk, and breach notice proposals, including in the context of SEC rulemaking, and including the American Data Privacy and Protection Act (H.R. 8152), issues related to scope, timing, preemption and functional regulation; natural hazard and climate risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy, data security, cybersecurity, climate-risk, and breach notice proposals, including in the context of SEC rulemaking, and including the American Data Privacy and Protection Act, and the Data Privacy Act of 2023 (McHenry)(HR 1165), and including in the context of the National Defense Authorization Act, issues related to scope, timing, preemption and functional regulation; natural hazard and climate risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft cybersecurity, climate-risk, and breach notice proposals, including in the context of SEC rulemaking; draft privacy and data security proposals, including the American Privacy Rights Act (McMorris Rodgers / Cantwell), and the Data Privacy Act of 2023 (McHenry)(H.R. 1165), including in the context of the National Defense Authorization Act and the Appropriations process; natural hazard and climate risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, GSE reform, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy and data security proposals; natural hazard risk tracking and its impact on lending and housing; and appraisal reform.",
    "General issues related to credit reporting, GSE reform, technology, data security, climate, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy and data security proposals; natural hazard risk tracking and its impact on lending and housing; credit reporting reform; and appraisal reform.",
    "General issues related to credit reporting, GSE reform, technology, data security, privacy, and housing. Specific issues included: re-authorization of the National Flood Insurance Program, including both in and outside of the Appropriations process, issues related to reconstruction cost and general extension of the program; draft privacy and data security proposals; natural hazard risk tracking and its impact on lending and housing; credit reporting reform; appraisal reform; and CFPB regulation."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 33,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 187500,
  "peakYear": 2020,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 1
}