{
  "id": 210991,
  "name": "CORN REFINERS ASSOCIATION",
  "slug": "corn-refiners-association",
  "state": "DC",
  "description": "Trade association representing U.S. corn refining industry",
  "totalSpending": 1550000,
  "filings": 20,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 190000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 320000
    },
    {
      "year": 2025,
      "income": 400000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "ANNE MACMILLAN",
    "TIMOTHY MARTIN",
    "LOGAN HOLLERS",
    "ADAM TARR",
    "DANIELLE BECK",
    "KENNETH BARBIC",
    "WILLIAM SITTON"
  ],
  "issues": [
    "AGR",
    "ENV",
    "TRD",
    null
  ],
  "sampleDescriptions": [
    "Educate Members and the Administration about agriculture-based manufacturing and supply chain; advocate for composting initiatives that support corn producers and association members; educate Members and the Administration on the importance of our nations bioeconomy; advocate for investments in plant-based product production in rural America.",
    "Educate Members of Congress and the Administration about agriculture-based manufacturing and supply chain; advocate for composting initiatives that support corn producers and association members; FY22 USDA appropriations.",
    "Educate Members of Congress and the Administration on the importance of our nations bioeconomy; advocate for investments in plant-based product production in rural America, including investments in worker training programs and infrastructure (Plant Based Products Council initiative); FY22 EPA appropriations.",
    "Educate Members of Congress and the Administration about agriculture-based manufacturing supply chain; advocate for composting initiatives that support corn producers and association members; FY22 USDA appropriations.",
    "Educate Members of Congress and the Administration on the importance of our nations bioeconomy; advocate for investments in plant-based product production in rural America, including investments in worker training programs and infrastructure (Plant Based Products Council initiative).",
    "Educate Members of Congress and the Administration about agriculture-based manufacturing supply chain; advocate for composting initiatives that support corn producers and association members.",
    "Educate Members of Congress and the Administration on the importance of our nations bioeconomy; advocate for investments in plant-based product production in rural America (Plant Based Products Council initiative). Engage with the Administration on federal sustainability efforts, including the need to create bio-based classification codes. Discuss policy proposals to support circular economy, recycling, and composting infrastructure. Support S.3743, the Recycling and Composting Accountability Act.",
    "Discuss international trade with North American trading partners including Mexico.",
    "Educate Members of Congress and the Administration on the importance of our nations bioeconomy; advocate for investments in plant-based product production in rural America (Plant Based Products Council initiative). Engage with the Administration on federal sustainability efforts, including the need to create bio-based classification codes. Discuss policy proposals to support circular economy, recycling, and composting infrastructure. Support S.3743, the Recycling and Composting Accountability Act and S. 3742 the Recycling Infrastructure and Accessibility Act.",
    "Educate Members of Congress and the Administration about agriculture-based manufacturing supply chain; advocate for composting initiatives thatsupport corn producers and association members. Analyze the impact that funding contained in PL 117-169, the Infl ation Reduction Act for climate-smart agriculture, conservation, and rural development, would have on business opportunities.",
    "Educate Members of Congress and the Administration on the importance of our nation's ag bioeconomy; advocate for investments in plant-based product production in rural America, the creation of bio-based industry classification codes, policy proposals that support circular bioeconomy infrastructure (Plant Based Products Council initiative). Engage with the Administration on federal sustainability efforts. Support the Recycling and Composting Accountability Act and the Recycling Infrastructure and Accessibility Act in the House and Senate.",
    "Educate members of Congress and the Administration about agriculture-based manufacturing supply chain, circular bioeconomy, and end-of-life infrastructure; advocate for composting initiatives that support corn producers and association members. Analyze the impact that funding contained in PL 117-169, the Inflation Reduction Act for climate-smart agriculture, conservation, and rural development would have on business opportunities. Monitor the outcomes of the White House Conference on Hunger, Nutrition, and Health with regard to federal nutrition programs and standards. Educate Members of Congress and the Administration about the economic impacts of rail labor negotiations on the agriculture sector, and monitor the progress of PL 117-216.",
    "Educate Members of Congress and the Administration on the importance of our nation's bioeconomy; advocate for investments in plant-based product production in rural America (Plant Based Products Council initiative). Engage with the Administration on federal sustainability efforts, including the need to create bio-based classification codes. Discuss policy proposals to support circular economy, recycling, and composting infrastructure. Support S.3743, the Recycling and Composting Accountability Act, and S.3742 the Recycling Infrastructure and Accessibility Act.",
    "Discuss international trade with North American trading partners.",
    "Educate members of Congress and the Administration about the food and agriculture supply chain, including agriculture-based manufacturing. Monitor developments regarding the Farm Bill reauthorization process and educate Members on the Corn Refiners Association's and Plant Based Product Council's priorities, including nationally uniform bioeconomy terminology, H.R.5134 / S.2452, the Biomanufacturing and Jobs Act and H.R.6413 / S.2987, the Agriculture Biorefinery Innovation and Opportunity Act. Educate members of Congress and the Administration on biobased products industry, circular bioeconomy, and end-of-life options. Monitor the completion of the FY 2024 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Bill.",
    "Monitor implementation of E.O. 14081, on Advancing Biotechnology and Biomanufacturing Innovation for a Sustainable, Safe, and Secure AmericanBioeconomy across the Administration. Plant Based Products Council and Ag Bioeconomy Coalition Initiatives: Educate Members of Congress andthe Administration on the importance of our nation's ag-based bioeconomy; advocate for investments in plant-based product production in ruralAmerica and the need for bio-based classifi cation codes and uniform terminology; engage with the Administration on federal sustainability efforts;discuss policy proposals to support circular economy and end-of-life options.",
    "Educate members of Congress and the Administration about the food and agriculture supply chain, including agriculture-based manufacturing. Monitor the Farm Bill reauthorization process, including the Farm, Food, and National Security Act of 2024 (H.R. 8467) and the Rural Prosperity and Food Security Act (Senate draft) and educate Members on the Corn Refiners Association's and Plant Based Product Council's priorities, including H.R.5134 / S.2452, the Biomanufacturing and Jobs Act and H.R.6413 / S.2987, the Agriculture Biorefinery Innovation and Opportunity Act. Educate members of Congress and the Administration on biobased products industry, circular bioeconomy, and end-of-life options. Monitor the development of the FY 2025 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Bill. Monitor NAICS code activity in the FY25 Senate Commerce, State & Justice appropriations bill.",
    "Monitor implementation of E.O. 14081, on Advancing Biotechnology and Biomanufacturing Innovation for a Sustainable, Safe, and Secure AmericanBioeconomy across the Administration. Educate the Administration on industrial regulations. Plant Based Products Council and Ag Bioeconomy Coalition Initiatives: Educate Members of Congress andthe Administration on the importance of our nation's ag-based bioeconomy; advocate for investments in plant-based product production in ruralAmerica and the need for bio-based classifi cation codes and uniform terminology; engage with the Administration on federal sustainability efforts;discuss policy proposals to support circular economy and end-of-life options.",
    "Educate members of Congress and the Administration about the food and agriculture supply chain, including agriculture-based manufacturing. Monitor the Farm Bill reauthorization process, including the Farm, Food, and National Security Act of 2024 (H.R. 8467) and the Rural Prosperity and Food Security Act (Senate Draft) and educate Members on the Corn Refiners Association's and Plant Based Product Council's priorities, including H.R.5134 / S.2452, the Biomanufacturing and Jobs Act and H.R.6413 / S.2987, the Agriculture Biorefinery Innovation and Opportunity Act. Educate members of Congress and the Administration on biobased products industry, circular bioeconomy, and end-of-life options. Monitor the development of the FY 2025 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Bill. Monitor proposals relative to food and ingredient regulation.",
    "Monitor implementation of E.O. 14081, on Advancing Biotechnology and Biomanufacturing Innovation for a Sustainable, Safe, and Secure American Bioeconomy across the Administration. Educate the Administration on industrial regulations. Advocate for the approval of corn oil from wet mills as an approved feedstock under the Renewable Fuel Standard (RFS). Plant Based Products Council and Ag Bioeconomy Coalition Initiatives: Educate Members of Congress and the Administration on the importance of our nation's ag-based bioeconomy; advocate for investments in plant-based product production in rural America and the need for bio-based classification codes and uniform terminology; engage with the Administration on federal sustainability efforts; discuss policy proposals to support a circular economy and end-of-life options."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 111,
  "trajectory": "exploding",
  "yearsActive": 5,
  "avgAnnualSpending": 310000,
  "peakYear": 2025,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 3
}