{"id":129662,"name":"COUNCIL ON SOCIAL WORK EDUCATION","slug":"council-on-social-work-education","state":"VA","description":"Association of individuals and undergrad and graduate professional social work programs","totalSpending":1160000,"filings":29,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":200000},{"year":2020,"income":160000},{"year":2021,"income":160000},{"year":2022,"income":160000},{"year":2024,"income":160000},{"year":2025,"income":160000}],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"lobbyists":["APRIL BURKE","MICHAEL LEDFORD","BEETA RASOULI","ERIN CADWALADER","JULIE JOLLY ROSE","WILLIAM KATT","NICOLE THOMPSON","ANDREW HERRIN","JACK GOODMAN-CHENG","OSCAR CARBALLO","AMANDA BRUNO","ISABELLA IZQUIERDO","MADISON LAMBERT","ISABELLE ARBETTER"],"issues":["IMM","HCR","BUD","EDU","LAW","MMM","VET"],"sampleDescriptions":["Issues pertaining to the Deferred Action for Childhood Arrivals (DACA) program.","Issues pertaining to the Behavioral Health Workforce Education and Training (BHWET) at HRSA.\nP.L. 114-255, 21st Century Cures Act, Issues pertaining to implementation of mental health provisions in 21st Century Cures.\nIssues pertaining to mental and behavioral health and the role of social work. \nIssues pertaining to addressing  social determinants of health.\nIssues pertaining to support for social work and social work education to support healthcare in the United States.\nIssues pertaining to addressing opioid epidemic.\nH.R. 3728, Educating Medical Professionals and Optimizing Workforce Efficiency and Readiness Act of 2017 or EMPOWER Act, Issues pertaining to Title VII reauthorization for health profession programs, specifically geriatric, and mental and behavioral health programs. \nIssues pertaining to addressing the full needs of the individual, including psychosocial, at HHS, support for Integrated mental and behavioral healthcare.","H.R. 3358, S. 1771, FY 2018 Labor/HHS/Education Appropriations, Issues pertaining to funding for health professions training at HRSA, including the BHWET program and Scholarships for Disadvantaged Students; the Minority Fellowship Program at SAMHSA; student aid programs, Pell, GAANN at the Department of Education; and funding for NIH.\nP.L. 115-141, Consolidated Appropriations Act, 2018, Issues pertaining to funding for health professions training including, Leadership in Public Health Social Work Education, Geriatrics Workforce Enhancement Program, the BHWET program, Scholarships for Disadvantaged students at HRSA; the Minority Fellowship Program at SAMHSA; student aid programs including Pell at the Department of Education; and funding for NIH.\nFY 2019 Labor/HHS/Education Appropriations, Issues pertaining to protecting vulnerable and underserved populations and funding for health professions training including, Leadership in Public Health Social Work Education, Geriatrics Workforce Enhancement Program, the BHWET program, Scholarships for Disadvantaged students at HRSA; the Minority Fellowship Program at SAMHSA; support for student aid programs including Pell at the Department of Education; and funding for NIH.","Higher Education Act Reauthorization, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, affordability, student aid programs, loan repayment, and public service loan forgiveness. \nH.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, affordability, student aid programs, loan repayment, and public service loan forgiveness.\nOther issues pertaining to Public Service Loan Forgiveness.","Issues pertaining to the Behavioral Health Workforce Education and Training programs (BHWET) at HRSA.\nP.L. 114-255, 21st Century Cures Act, Issues pertaining to implementation of mental health provisions in the 21st Century Cures Act.\nIssues pertaining to mental and behavioral health and the role of social work. \nIssues pertaining to addressing social determinants of health.\nIssues pertaining to support for social work and social work education to support access to healthcare for vulnerable populations in the United States.\nIssues pertaining to the role of higher education in addressing the opioid epidemic.\nH.R. 3728, Educating Medical Professionals and Optimizing Workforce Efficiency and Readiness (EMPOWER) Act of 2017, Issues pertaining to Title VII reauthorization for Health Professions Programs.\nH.R. 5102, Substance Use Disorder Workforce Loan Repayment Act of 2018, Issues pertaining to substance use workforce.","S. 3158, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to funding for health professions training including, Leadership in Public Health Social Work Education, Geriatrics Workforce Enhancement Program, the BHWET program, Scholarships for Disadvantaged students, the Minority Fellowship Program, Support for  student aid programs, Pell, funding for NIH, and protecting vulnerable and underserved populations.","Issues pertaining to the Deferred Action for Childhood Arrivals (DACA) program.\nIssues pertaining to family separation.","Higher Education Act Reauthorization, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, affordability, student aid programs, loan repayment, and public service loan forgiveness.\nH.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, affordability, student aid programs, loan repayment, campus safety, and public service loan forgiveness.","Issues pertaining to the Behavioral Health Workforce Education and Training programs (BHWET) at HRSA.\nIssues pertaining to mental and behavioral health and the role of social work. \nIssues pertaining to addressing social determinants of health.\nH.R. 3728, Educating Medical Professionals and Optimizing Workforce Efficiency and Readiness (EMPOWER) Act of 2017, Issues pertaining to Title VII reauthorization for Health Professions Programs.\nH.R. 5102, Substance Use Disorder Workforce Loan Repayment Act of 2018, Issues pertaining to substance use workforce and the opioid crisis.\nP.L. 114-255, 21st Century Cures Act, Issues pertaining to implementation of mental health provisions in the 21st Century Cures Act.","Public Law No: 115-245, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to funding for health professions training including, Leadership in Public Health Social Work Education, Geriatrics Workforce Enhancement Program, the BHWET program, Scholarships for Disadvantaged students, the Minority Fellowship Program, support for  student aid programs, Pell Grants, Temporary Expanded Public Service Loan Forgiveness (TEPSLF), funding for NIH, and protecting vulnerable and underserved populations.","H.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, affordability, student aid programs, graduate education, loan repayment, campus safety, and public service loan forgiveness.","Issues pertaining to the Deferred Action for Childhood Arrivals (DACA) program, child and family separation.","Issues pertaining to the Behavioral Health Workforce Education and Training programs (BHWET) at HRSA.\nIssues pertaining to mental and behavioral health and the role of social work. \nIssues pertaining to the Minority Fellowship Program.\nH.R. 3728, Educating Medical Professionals and Optimizing Workforce Efficiency and Readiness (EMPOWER) Act of 2018, Issues pertaining to Title VII reauthorization for Health Professions Programs.","H.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to the reauthorization of the Higher Education Act including accreditation, programmatic accreditation, higher education regulations, student aid programs, graduate education, loan repayment, campus safety, and public service loan forgiveness.","Issues pertaining to the Behavioral Health Workforce Education and Training programs (BHWET) at HRSA.\nIssues pertaining to the Minority Fellowship Program.\nIssues pertaining to mental and behavioral health and the role of social work. \nIssues pertaining to addressing social determinants of health.\nIssues pertaining to support for social work and social work education to support access to healthcare for vulnerable populations in the United States.\nIssues pertaining to the role of higher education in addressing the opioid epidemic.\nIssues pertaining to ensuring access to care and protecting underserved and vulnerable populations.\nIssues pertaining to access to mental and behavioral health in schools.","FY 2020 Labor/HHS/Education Appropriations, Issues pertaining to Title VII health professions programs, Minority Fellowship Program, Department of Education, accreditation, student aid programs, graduate education, Public Service Loan Forgiveness, NIH, and social work research.","Higher Education Act Reauthorization, Issues pertaining to the reauthorization of the Higher Education Act including programmatic accreditation, student aid programs, Pell Grants, graduate education, and Public Service Loan Forgiveness.\nIssues Pertaining to Title IX.","Issues pertaining to the Behavioral Health Workforce Education and Training programs (BHWET) at HRSA.\nIssues pertaining to the Minority Fellowship Program.\nIssues pertaining to mental and behavioral health and the role of social work. \nIssues pertaining to addressing social determinants of health and healthcare policy.\nIssues pertaining to support for social work and social work education to support access to healthcare for vulnerable populations in the United States.\nIssues pertaining to research on gun violence.\nIssues pertaining to the role of higher education in addressing the opioid crisis.\nIssues pertaining to access to mental and behavioral health in schools.","H.R. 2740, Labor, Health and Human Services, Education, Defense, State, Foreign Operations, and Energy and Water Development Appropriations Act, 2020, Division A, Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, Issues pertaining to Title VII health professions programs, Minority Fellowship Program, Department of Education, accreditation, student aid programs, graduate education, Public Service Loan Forgiveness, NIH, and social work research.","Higher Education Act Reauthorization, Issues pertaining to the reauthorization of the Higher Education Act including programmatic accreditation, student aid programs, Pell Grants, graduate education, GAANN, and Public Service Loan Forgiveness."],"years":[2018,2019,2020,2021,2022,2024,2025]}