{"id":101481,"name":"CRUISE LINES INTERNATIONAL ASSOCIATION","slug":"cruise-lines-international-association","state":"VA","description":null,"totalSpending":4070000,"filings":30,"yearlySpending":[{"year":2018,"income":820000},{"year":2019,"income":1100000},{"year":2020,"income":630000},{"year":2021,"income":240000},{"year":2022,"income":320000},{"year":2023,"income":400000},{"year":2024,"income":320000},{"year":2025,"income":240000}],"firms":["ALCALDE & FAY"],"lobbyists":["HECTOR ALCALDE","NANCY PROWITT","DANIELLE MCBETH","FRANCIS TURNER","PERRIN BADINI","YASMIN ALBAZZAZ"],"issues":["DEF","MAR","BUD","TOU","NAT","TAX","HOM","TRA","DIS","TRD","CAW",null,"ENV","ENG","IMM"],"sampleDescriptions":["National Defense Authorization Act of 2018 (S 1519 and HR 2810), provisions related to the Maritime Administration.","Coast Guard Reauthorization Act of 2017 (HR 2518 and S 1129), provisions related to the Maritime Administration.","Consolidated Appropriations Act of 2018: FY 2018 Transportation Appropriations Bill, provisions related to the Maritime Administration.","Implementation of the National Security Presidential Memorandum on Strengthening the Policy of the United States Toward Cuba and Freedom to Travel to Cuba Act, legislation removing travel restrictions to Cuba.","Proposed National Park Service entrance fee increase","Tax Cuts and Jobs Act, provisions related to corporate tax reform.","Border Security for America Act and Building America's Trust Act, provisions related to implementation of a biometric entry-exit system.","National Park Restoration Act, legislation to address maintenance backlog at national parks across the country.","FY 2019 Transportation Appropriations Bill, provisions related to the Maritime Administration. FY 2019 Homeland Security Appropriations Bill, provisions related to customs and immigration fees.","National Defense Authorization Act of 2019 (S 2987 and HR 5515), provisions related to the Maritime Administration.","Tax Cuts and Jobs Act  of 2017; Protecting Family and Small Business Tax Cuts Act of 2018, Promoting Family Savings Act of 2018, and the American Innovation Act of 2018, monitoring for maritime industry provisions","Monitoring Coast Guard Reauthorization, provisions related to the Maritime Administration.","Monitoring newly implemented travel regulations to the Caribbean region.","Legislation to address maintenance backlog at national parks across the country.","National Defense Authorization Act of 2020, provisions related to the Maritime Administration.","Tax legislation, monitoring for maritime industry provisions.","FY 2020 Transportation Appropriations Bill, provisions related to the Maritime Administration. FY 2020 Homeland Security Appropriations Bill, provisions related to customs and immigration fees.","H.R. 5139 Stop Sexual Assault and Harassment in Transportation Act","H.R. 3409 Coast Guard Authorization Act; monitoring provisions related to the Maritime Administration.","H.R. 6266 To require the Secretary of Transportation to require operators of cruise vessels or cruise lines to reimburse passengers for cancellation due to COVID-19, and for other purposes."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}