{
  "id": 178571,
  "name": "CSL BEHRING LLC",
  "slug": "csl-behring-llc",
  "state": "PA",
  "description": "Biotherapeutic company providing recombinant and plasma-derived products.",
  "totalSpending": 1400000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 350000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 150000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "THE NICKLES GROUP, LLC"
  ],
  "lobbyists": [
    "STACEY HUGHES",
    "RACHEL JONES HENSLER",
    "MARY SAVARY TAYLOR",
    "EMILY PORTER",
    "DONALD KENT",
    "GREG D'ANGELO",
    "STEPHANIE BADGER",
    "BRETT BAKER",
    "MOLLY FROMM"
  ],
  "issues": [
    "MMM",
    "TAX",
    "HCR",
    "BUD",
    "HOM",
    "GOV",
    "BAN",
    null,
    "TRD"
  ],
  "sampleDescriptions": [
    "Orphan Drug Act, Medicare payment for home infusion services, drug importation, drug pricing proposals included in Administration's Blueprint \"America's Patients First\" a plan to lower prescription drug prices.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding reimbursement of drugs, biologics and plasma therapies. Issues pertaining to drugs listed on the Self-Administered Drug list.",
    "Issues related to orphan drug tax credit.",
    "Monitored issues related to prescription drug pricing.",
    "Monitored issues related to the conference report accompanying H.J. Res 31.",
    "Monitored issues related to prescription drug pricing. H.R. 2296, FAIR Drug Pricing Act of 2019. Monitored S. 1895, Lower Health Care Costs Act of 2019, as it relates to pricing transparency and drug pricing. H.R. 2113, Prescription Drug STAR Act.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding reimbursement of drugs, biologics and plasma therapies. Issues pertaining to drugs listed on the Self-Administered Drug list. H.R. 2296, FAIR Drug Pricing Act of 2019. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. H.R. 2113, Prescription Drug STAR Act.",
    "Monitored issues related to prescription drug pricing. H.R. 2296, the METRIC Act. Monitored S. 1895, Lower Health Care Costs Act of 2019, as it relates to pricing transparency and drug pricing. H.R. 2113, Prescription Drug STAR Act.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding coverage reimbursement of biologics and plasma therapies. Issues pertaining to drugs listed on the Self-Administered Drug list. H.R. 2296, the METRIC Act. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. H.R. 2113, Prescription Drug STAR Act. Monitored S. 2543, Prescription Drug Pricing Reduction Act of 2019.",
    "Monitored H.R. 4378, the Continuing Appropriations Act of 2020 and Health Extenders Act of 2019.",
    "H.R. 1158, the Consolidated Appropriations Act of 2020; H.R. 1865, Further Consolidated Appropriations Act, 2020, as it relates to the self-administered drug list.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding coverage reimbursement of biologics and plasma therapies. Issues pertaining to drugs listed on the Self-Administered Drug list. H.R. 2296, the METRIC Act. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. H.R. 2113, Prescription Drug STAR Act. Monitored S. 2543, Prescription Drug Pricing Reduction Act of 2019. H.R. 3, Elijah E. Cummings Lower Drug Costs Now Act.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding coverage and reimbursement of biologics and plasma therapies. Issues pertaining to drugs listed on the Self-Administered Drug list. H.R. 2296, the METRIC Act. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. H.R. 2113, Prescription Drug STAR Act. Monitored S. 2543, Prescription Drug Pricing Reduction Act of 2019. H.R. 3, Elijah E. Cummings Lower Drug Costs Now Act. S. 3457 / H.R. 6218, Preserving Patient Access to Home Infusion Act, as it relates to access to drugs listed on the self-administered drug list. Monitored Coronavirus Aid, Relief and Economic Security \"CARES Act,\" P.L. 116-136.",
    "Monitored issues involving plasma donors from border countries.",
    "Monitored issues related to prescription drug pricing. Monitored S. 1895, Lower Health Care Costs Act of 2019, as it relates to pricing transparency and drug pricing. Issues involving promoting plasma donation and convalescent plasma donation.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding coverage and reimbursement of biologics and plasma therapies. Issues pertaining to drugs listed on the Self-Administered Drug list. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. Monitored S. 2543, Prescription Drug Pricing Reduction Act of 2019. S. 3457 / H.R. 6218, Preserving Patient Access to Home Infusion Act, as it relates to access to drugs listed on the self-administered drug list. Monitored issues related to drug pricing. Issues related to the corona virus.",
    "Issues involving promoting plasma donation and convalescent plasma donation; issues involving the development hyperimmune globulin treatment; monitored issues related to H.R. 925 / H.R. 8406, The HEROES Act and The Health, Economic Assistance, Liability Protection and Schools (HEALS) Act; H.R. 8337, Continuing Appropriations Act, 2021 and Other Extensions Act; S. 4317, SAFE TO WORK Act; S. 4322, Safely Back to School and Back to Work Act.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding coverage and reimbursement of biologics and plasma therapies. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. Monitored S. 2543, Prescription Drug Pricing Reduction Act of 2019. S. 3457 / H.R. 6218, Preserving Patient Access to Home Infusion Act, as it relates to access to drugs listed on the self-administered drug list. Issues related to the Executive Order on Lowering Drug Prices by Putting America First. H.R. 7839, Continuing Access to In-Home IVIG Act.",
    "Issues involving promoting plasma donation and convalescent plasma donation; issues involving the development hyperimmune globulin treatment; monitored issues related to H.R. 925 / H.R. 8406, The HEROES Act and The Health, Economic Assistance, Liability Protection and Schools (HEALS) Act; H.R. 8337, Continuing Appropriations Act, 2021 and Other Extensions Act; S. 4317, SAFE TO WORK Act; S. 4322, Safely Back to School and Back to Work Act. H.R. 133, the Consolidated Appropriations Act of 2021. Monitored S.AMDT 2562 to S. 178, Delivering Immediate Relief to Americas Families, Schools and Small Businesses Act.",
    "Issues related to home infusion and DME self-administered therapies. Issues regarding coverage and reimbursement of biologics and plasma therapies. Monitored issues related to H.R. 2905, Medicare IVIG Access Enhancement Act. Monitored S. 2543, Prescription Drug Pricing Reduction Act of 2019. S. 3457 / H.R. 6218, Preserving Patient Access to Home Infusion Act, as it relates to access to drugs listed on the self-administered drug list. H.R. 7839, Continuing Access to In-Home IVIG Act. H.R. 133, the Consolidated Appropriations Act of 2021, including home infusion and DME self-administered therapies. Issues concerning the most favored nation rule as it relates to plasma-derived products."
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -25,
  "trajectory": "reducing",
  "yearsActive": 7,
  "avgAnnualSpending": 200000,
  "peakYear": 2020,
  "lobbyistCount": 9,
  "firmCount": 1,
  "issueCount": 8
}