{
  "id": 210502,
  "name": "CTC GLOBAL CORPORATION",
  "slug": "ctc-global-corporation",
  "state": "CA",
  "description": "Electricity Transmission Manufacturer",
  "totalSpending": 1390000,
  "filings": 19,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 310000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 310000
    },
    {
      "year": 2025,
      "income": 250000
    }
  ],
  "firms": [
    "K&L GATES, LLP"
  ],
  "lobbyists": [
    "TIM PECKINPAUGH",
    "BART GORDON",
    "LAURIE PURPURO",
    "SCOTT NELSON",
    "PAMELA GARVIE",
    "SCOTT GELBMAN",
    "JAMES SARTUCCI",
    "SCOTT ALIFERIS",
    "MATTHEW LEGGETT",
    "THOMAS FULTON"
  ],
  "issues": [
    "ENG",
    null
  ],
  "sampleDescriptions": [
    "Issues related to efficiency incentives and standards for the electric grid.",
    "H.R. 1512, CLEAN Futures Act, increased transmission efficiency and capacity.\nYet to be introduced, Energy Infrastructure Act, transmission efficiency and capacity.",
    "H.R. 1512, CLEAN Futures Act, increased transmission efficiency and capacity.\nH.R. 3684, Infrastructure Investment and Jobs Act, Energy Infrastructure Act, transmission efficiency and capacity and wildfire mitigation.\nExecutive actions related to efficiency standards for advanced conductors.",
    "Yet to be introduced bill to create efficiency standards for conductors. S.3879, CHARGE Act of 2022, transmission efficiency and capacity. Executive actions related to efficiency standards for advanced conductors.",
    "Yet to be introduced bill to create efficiency standards for conductors. S.3879, CHARGE Act of 2022, transmission efficiency and capacity. Executive actions related to efficiency standards for advanced conductors. Energy and Water Development and Related Agencies Appropriations Act, 2023, electricity provisions.",
    "Yet to be introduced bill to create efficiency standards for conductors. S.3879, CHARGE Act of 2022, transmission efficiency and capacity. Executive actions related to efficiency standards for advanced conductors. H.R.8255, Energy and Water Development and Related Agencies Appropriations Act, 2023, electricity provisions.",
    "Yet to be introduced bill to create efficiency standards for conductors. S.3879, CHARGE Act of 2022, transmission efficiency and capacity. Executive actions related to efficiency standards for advanced conductors. H.R.8255, Energy and Water Development and Related Agencies Appropriations Act, 2023, transmission provisions.",
    "H.R. 1, Lower Energy Costs Act; Issues related to creating efficiency standards for overhead conductors; transmission issues. S. 1804, Facilitating America's Siting of Transmission and Electric Reliability Act of 2023 (FASTER Act of 2023); transmission technologies. Discussion draft bill, Clean Electricity and Transmission Acceleration Act, transmission technology. Efficiency standard for overhead electricity conductors. H.R.5551, S.2827, BIG WIRES Act; transmission technology. H.R.6747, Clean Electricity and Transmission Acceleration Act of 2023; transmission technology. S.3918 - Advancing GETs Act of 2024.",
    "H.R. 1, Lower Energy Costs Act; Issues related to creating efficiency standards for overhead conductors; transmission issues. S. 1804, Facilitating America's Siting of Transmission and Electric Reliability Act of 2023 (FASTER Act of 2023); transmission technologies. Discussion draft bill, Clean Electricity and Transmission Acceleration Act, transmission technology. Efficiency standard for overhead electricity conductors. H.R.5551, S.2827, BIG WIRES Act; transmission technology. H.R.6747, Clean Electricity and Transmission Acceleration Act of 2023; transmission technology. S.3918 - Advancing GETs Act of 2024. Draft legislation to create tax incentives for transmission.",
    "Deployment of advanced connectors and reconductoring of transmission systems - no specific legislation. Efficiency standard for overhead electricity conductors. Draft legislation on tax incentives for transmission.",
    "Deployment of advanced connectors and reconductoring of transmission systems - no specific legislation. Efficiency standard for overhead electricity conductors. Draft legislation on tax incentives for transmission. S. 1462, Fix Our Forests Act - electric utility infrastructure and wildfire mitigation.",
    "Deployment of advanced connectors and reconductoring of transmission systems - no specific legislation. Efficiency standard for overhead electricity conductors. Draft legislation on tax incentives for transmission. S. 1462, Fix Our Forests Act - electric utility infrastructure and wildfire mitigation. Draft legislation on permitting reform - incentives for advanced reconductoring.",
    "H.R. 6633, High-Capacity Grid Act. S. 1462, Fix Our Forests Act - electric utility infrastructure and wildfire mitigation. Deployment of advanced connectors and reconductoring of transmission systems - no specific legislation. Efficiency standard for overhead electricity conductors. Draft legislation on tax incentives for transmission. Draft legislation on permitting reform - incentives for advanced reconductoring."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 25,
  "trajectory": "stable",
  "yearsActive": 5,
  "avgAnnualSpending": 278000,
  "peakYear": 2023,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 1
}