{"id":194400,"name":"CTIA","slug":"ctia","state":"DC","description":"Trade Association of US Wireless Industry","totalSpending":1140000,"filings":26,"yearlySpending":[{"year":2018,"income":100000},{"year":2019,"income":90000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":200000}],"firms":["EMPIRE CONSULTING GROUP"],"lobbyists":["MIKE MCKAY","CHAKA BURGESS","LAVITA LEGRYS","MIKE MULLEN","BRIAN GREER","E. GARRETT"],"issues":["TEC","TAX"],"sampleDescriptions":["Wire spectrum policy; net neutrality; and issues related to diversity and inclusion.","Wireless/spectrum policy; H. Res 873-Net Neutrality discharge petition; HR 4953 Airwaves Act; issues related to diversity and inclusion; and issues related to privacy.","Wireless/spectrum policy; H. Res 873-Net Neutrality discharge petition; HR 4953 Airwaves Act; and issues related to privacy.","AIRWAVES Act (HR 4953); issues related to net neutrality; issues related to privacy; 5G deployment legislation; issues relating to 911 location accuracy.","Issues relating to Net Neutrality; HR 530-Accelerating Broadband Development by Empowering Local Communities Act; issues relating to 5G.","Issues relating to Net Neutrality, privacy, cyber-security, and infrastructure proposals; HR 530-Accelerating Broadband Development by Empowering Local Communities Act; HR 2063/S.918, E-FRONTIER Act; robocalls; TRACE Act; HR 2500, the Nat'l Defense Authorization Act for 2020.","HR 2036/S.918-E-FRONTIER Act; TRACED Act; Nat'l Defense Authorization Act Sec.214; resiliency/WEA earthquake notifications; contraband phone legislation; S.893-5G small cell legislation; and issues related to privacy.","Issues related to 5G; S.3398, the EARN Act (establishing a national commission on online child sex exploitation prevention and related purposes); and Coronavirus Aid, Relief and Economic Stability Act (CARES Act) provisions pertaining to communications.","Issues related to 5G; the E-Rate Program; the FCC Pledge on Broadband Service; the Lifetime Program; S.3695-CONNECT at Home Act; HR 7302-Accessible, Affordable Internet for All Act; HR 2-Investing in a New Vision for the Environment & Surface Transportation Act (\"Moving Forward Act\"; issues related to the National Defense Authorization Act.","Issues related to 5G; the E-Rate Program; the FCC Pledge on Broadband Service; and issues related to the National Defense Authorization Act.","Issues related to 5G; the E-Rate Program; the FCC Pledge on Broadband Service; issues related to the National Defense Authorization Act; DoD's RFI on spectrum use; and Omni/COVID bill.","Issues related to the deployment of 5G; spectrum policy; infrastructure proposals including LIFT America Act; and antitrust issues.","Issues related to the deployment of 5G; spectrum policy; Emergency Broadband Benefit Program; LIFT Act; S.2729, the Device Access for Every American Act; and issues related to the National Defense Authorization Act.","Bipartisan Infrastructure Investment & Jobs Act and related proposals; S. 2729, the Device Access for Every American Act; and issues related to the National Defense Authorization Act.","Proposals and issues related to corporate taxation.","Issues related to infrastructure and issues related to combatting illegal robocall.","Issues related to infrastructure, spectrum policy, and combatting illegal robocall; HR 8152-the American Data & Privacy Act; the National Defense Authorization Act; HR 7132-the Safe Connections Act of 2022; and the United States Innovation & Competition Act; and issues","Build Back Better tax provisions","HR 8152-the American Data & Privacy Act; the National Defense Authorization Act; the United States Innovation & Competition Act; and issues related to the reauthorization of the FCC's spectrum auction authority.","Book minimum tax"],"years":[2018,2019,2020,2021,2022,2024,2025]}