{
  "id": 199119,
  "name": "DELTA AIRLINES, INC.",
  "slug": "delta-airlines-inc",
  "state": "DC",
  "description": "Commercial Airline",
  "totalSpending": 2480000,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 240000
    },
    {
      "year": 2019,
      "income": 320000
    },
    {
      "year": 2020,
      "income": 320000
    },
    {
      "year": 2021,
      "income": 320000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 400000
    }
  ],
  "firms": [
    "FIERCE GOVERNMENT RELATIONS"
  ],
  "lobbyists": [
    "ALEIX JARVIS",
    "KATE HULL",
    "WILLIAM BLALOCK",
    "KIRSTEN CHADWICK",
    "MICHAEL CHAPPELL",
    "WILLIAM PIPER",
    "TYLER STEPHENS",
    "ERIC ZULKOSKY",
    "PATRICK CLIFTON",
    "JACOBUS VREEBURG"
  ],
  "issues": [
    "BAN",
    "AVI",
    "TAX",
    "FOR",
    "FUE",
    "LBR",
    "GOV",
    "TRD",
    "ENG",
    "RET",
    "IMM",
    null
  ],
  "sampleDescriptions": [
    "S.2098 - Foreign Investment Risk Review Modernization Act of 2017",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), S.1405 - Federal Aviation Administration Reauthorization Act of 2017, Passenger Facility Charges, Airport Slots, Airline Service Quality Issues",
    "Depreciation",
    "Foreign Agents Registration Act- general provisions",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), S.1405 - Federal Aviation Administration Reauthorization Act of 2017, Passenger Facility Charges, Airport Slots, H.R. 4- FAA Reauthorization Act of 2018, Data Breach, Beyond Perimeter Policy",
    "S.2098 - Foreign Investment Risk Review Modernization Act of 2017, H.R. 5841- Foreign Investment Risk Review Modernization Act of 2017",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), Beyond Perimeter, General Aviation Issues",
    "Renewable Fuel Standard, RINS",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), General Aviation Issues, Airport Slots, Nominations, Impacts of Lapse of Government Funding",
    "Employment Issues",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), Nominations, GPS Tracking Systems, U.S. Customs and Border Protection Issues, General Aviation Issues, TSA Staffing Issues",
    "Transparency in Lobbying",
    "Section 301 Tarriffs",
    "International Air Service Rights Issues (US Government Bilateral Negotiations),U.S. Customs and Border Protection Issues, Privacy",
    "Renewable Fuel Standards, RIN Market Reforms",
    "Renewable Fuel Standards, Alternative Fuel Mixture Credit",
    "Tariffs",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), Privacy",
    "International Air Service Rights Issues (US Government Bilateral Negotiations), COVID-19 Response Efforts, H.R. 748- CARES Act, H.R. 6201- Families First Coronavirus Response Act, Essential Critical Infrastructure Workers, Treasury Airline Payroll Support Program, General Industry Issues, Airport Slots, Issues related to flight networks due to COVID-19, Support for the U.S. Governments repatriation of U.S. citizens and international service, Health-related passenger information collection requirements",
    "WTO Tariffs"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 67,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 310000,
  "peakYear": 2025,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 11,
  "industry": "technology"
}