{
  "id": 201013,
  "name": "DELTA AIR LINES",
  "slug": "delta-air-lines",
  "state": "DC",
  "description": "Passenger Airlines",
  "totalSpending": 1860000,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 90000
    },
    {
      "year": 2019,
      "income": 120000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "TEAM HALLAHAN LLC"
  ],
  "lobbyists": [
    "KATE HALLAHAN"
  ],
  "issues": [
    "AVI",
    null
  ],
  "sampleDescriptions": [
    "FAA Reauthorization (HR 4 and S 1405), airline competition issues, FY 19 appropriations in the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act.",
    "FY 19 Department of Homeland Security Appropriations (including TSA and CBP), FY 19 Financial Services and General Government Appropriations",
    "Airline competition issues and airline-related Appropriations in the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act.  Aviation provisions in the Department of Homeland Security Appropriations bill draft.",
    "Airline competition issues and airline-related Appropriations in the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act.  Aviation provisions in the Department of Homeland Security Appropriations bill draft;  Delta Air Lines - H.R.3163 - Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2020  H.R.3055 - Commerce, Justice, Science, Agriculture, Rural Development, Food and Drug Administration, Interior, Environment, Military Construction, Veterans Affairs, Transportation, and Housing and Urban Development Appropriations Act, 2020, HR 3351, Financial Services and General Government Appropriations Act, 2020,",
    "Airline competition issues and airline-related Appropriations in the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act.  Aviation provisions in the Department of Homeland Security Appropriations bill draft;  Delta Air Lines - H.R.3163 - Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2020  H.R.3055 - Commerce, Justice, Science, Agriculture, Rural Development, Food and Drug Administration, Interior, Environment, Military Construction, Veterans Affairs, Transportation, and Housing and Urban Development Appropriations Act, 2020, HR 3351, Financial Services and General Government Appropriations Act, 2020;\n\nFY 20 Department of Transportation, Housing and Urban Development and Related Agencies bill (HR 3163, S 2520, HR 3055)  FY 20 Department of Homeland Security Appropriations bill (HR 3931, S 2582), Transit research and capital investment grant programs in surface transportation legislation",
    "Airline competition issues and airline-related Appropriations in the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act.  Aviation provisions in the Department of Homeland Security Appropriations bill draft;  Delta Air Lines - H.R.3163 - Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2020  H.R.3055 - Commerce, Justice, Science, Agriculture, Rural Development, Food and Drug Administration, Interior, Environment, Military Construction, Veterans Affairs, Transportation, and Housing and Urban Development Appropriations Act, 2020, HR 3351, Financial Services and General Government Appropriations Act, 2020;\n\nFY 20 Department of Transportation, Housing and Urban Development and Related Agencies bill (HR 3163, S 2520, HR 3055)  FY 20 Department of Homeland Security Appropriations bill (HR 3931, S 2582)",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the FY 21 Transportation, Housing and Urban Development, and Related Agencies\nAppropriations Act. FY 21 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 21 Interior Appropriations bill related to renewable fuel standard;   COVID-19 Supplemental appropriations bills (HR 748).",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the FY 21 Transportation, Housing and Urban Development, and Related Agencies\nAppropriations Act. FY 21 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 21 Interior Appropriations bill related to renewable fuel standard;   COVID-19 Supplemental funding; Payroll Support Program Funding.",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the FY 21 Transportation, Housing and Urban Development, and Related Agencies\nAppropriations Act. FY 21 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 21 Interior Appropriations bill related to renewable fuel standard;   COVID-19 Supplemental funding; Payroll Support Program Funding;\nHR 133 (FY 21 Omnibus and COVID Relief and Response Act)",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the FY 21/22 Transportation, Housing and Urban Development, and Related Agencies\nAppropriations Act. \nFY 21/22 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 21/22 Interior Appropriations bill related to renewable fuel standard; COVID-19 Supplemental funding; Payroll Support Program Funding;\n(FY 21/22 Omnibus and COVID Relief and Response Act)",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the FY 22 Transportation, Housing and Urban Development, and Related Agencies\nAppropriations Act. \nFY 22 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 22 Interior Appropriations bill related to renewable fuel standard; \nFY 22 State, Foreign Operations Appropriations bill related to passport and visa processing",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the HR 4502,FY 22 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act;\nHR 4431, FY 22 Department of Homeland Security Appropriations bill related to TSA and CBP funding; HR 4502, FY 22 Interior Appropriations bill related to renewable fuel standard; \nHR 4373, FY 22 State, Foreign Operations Appropriations bill related to passport and visa processing.",
    "Airline competition issues, alternative fuel and airline-related Appropriations in the HR 4502,FY 22 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act;\nHR 4431, FY 22 Department of Homeland Security Appropriations bill related to TSA and CBP funding; \nHR 4502, FY 22 Interior Appropriations bill related to renewable fuel standard; \nHR 4373, FY 22 State, Foreign Operations Appropriations bill related to passport and visa processing; HR 5376, Build Back Better Act related to sustainable aviation fuel, blended tax credit.",
    "Voluntary Airport Low Emissions program and alternative fuel and airline-related Appropriations in the HR 4502, FY 22/23 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act; HR 4431, FY 22/23 Department of Homeland Security Appropriations bill related to TSA and CBP funding; HR 4502, FY 22/23 Interior Appropriations bill related to renewable fuel standard; HR 4373, FY 22/23 State, Foreign Operations Appropriations bill related to passport and visa processing; HR 5376, Build Back Better Act related to sustainable aviation fuel, blended tax credit.",
    "THUD HR 8294, S 4679; Interior HR 8262, S 4686; DHs HR 8256, S. 4678; SFOPs HR 8282, S. 4662 Voluntary Airport Low Emissions program and alternative fuel and airline-related Appropriations in the FY 23 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act; FY 23 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 23 Interior Appropriations bill related to renewable fuel standard; FY 23 State, Foreign Operations Appropriations bill related to passport and visa processing; Build Back Better Act related to sustainable aviation fuel, blended tax credit.",
    "\"THUD HR 8294, S 4679; Interior HR 8262, S 4686; DHs HR 8256, S. 4678; SFOPs HR 8282, S. 4662 Voluntary Airport Low Emissions program and alternative fuel and airline-related Appropriations in the FY 23 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act; FY 23 Department of Homeland Security Appropriations bill related to TSA and CBP funding; FY 23 Interior Appropriations bill related to renewable fuel standard; FY 23 State, Foreign Operations Appropriations bill related to passport and visa processing; Build Back Better Act related to sustainable aviation fuel, blended tax credit. FY2023 Consolidated Appropriations Act (HR 2617). Temportaty Insurance for Air Carriers for Certain Terminated Coverage (Division Q - Section 103).\"",
    "FY 24 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act related to sustainable aviation fuel and Facilities and Equipment funding (HR 4820 and S. 2437); FY 24 Department of Homeland Security Appropriations bill related to TSA and CBP funding and biometrics and human trafficking (HR 4367 and S. 2625); FY 24 Interior Appropriations bill related to renewable fuel standard (HR 4821 and S. 2605); FY 24 State, Foreign Operations Appropriations bill related to passport and visa processing (HR 4665 and S. 2438j); FAA Reauthorization (HR 3935) related to perimeter rule. Similar provisions in FY 25 appropriations as above, but no bills have been introduced yet.",
    "FY 25 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act related to sustainable aviation fuel and Facilities and Equipment funding ; FY 25 Department of Homeland Security Appropriations bill related to TSA and CBP funding and biometrics and human trafficking (HR 8752); FY 25 Interior Appropriations bill related to renewable fuel standard (HR 8998); FY 25 State, Foreign Operations Appropriations bill related to passport and visa processing (HR 8771); FY 25 Agriculture Appropriations bill related to Cover Crops ; FY 25 Energy and Water Development Appropriations bill related to bioenergy technologies and sustainable aviation fuels FAA Reauthorization (HR 3935) related to perimeter rule.",
    "FY 25 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act related to sustainable aviation fuel and Facilities and Equipment funding (HR 9028, S 4796) FY 25 Department of Homeland Security Appropriations bill related to TSA and CBP funding and biometrics and human trafficking (HR 8752); FY 25 Agriculture Appropriations bill re: sustainable aviation fuel and cover crops (HR 9027, S 4690) FY 25 Energy and Water Development Appropriations bill re: sustainable aviation fuel and bioenergy technologies (HR8997, S4927); FY 25 State, Foreign Operations Appropriations bill related to passport and visa processing (HR 8771, S 4797); FAA Reauthorization (PL 118-63) related to DC Slots.",
    "FY 26 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act related to sustainable aviation fuel and Facilities and Equipment funding; FY 26 Department of Homeland Security Appropriations bill related to TSA and CBP funding and biometrics and human trafficking; FY 26 Agriculture Appropriations bill related to sustainable aviation fuel and cover crops; FY 26 Energy and Water Development Appropriations bill related to sustainable aviation fuel and bioenergy technologies; FY 26 State, Foreign Operations Appropriations bill related to passport and visa processing."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 122,
  "trajectory": "exploding",
  "yearsActive": 8,
  "avgAnnualSpending": 176250,
  "peakYear": 2020,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 1,
  "industry": "technology"
}