{"id":136652,"name":"DENVER REGIONAL TRANSPORTATION DISTRICT","slug":"denver-regional-transportation-district","state":"CO","description":null,"totalSpending":1630000,"filings":27,"yearlySpending":[{"year":2018,"income":210000},{"year":2019,"income":210000},{"year":2020,"income":210000},{"year":2021,"income":210000},{"year":2022,"income":280000},{"year":2023,"income":200000},{"year":2024,"income":150000},{"year":2025,"income":160000}],"firms":["SQUIRE PATTON BOGGS"],"lobbyists":["MICHAEL DINO","PATRICIA DOERSCH","TIMOTHY DRAKE","ELAINE HILLGROVE","ANNE MIANO","PHILLIP BIANCHI","MEAGAN ROWLEY","CAREN STREET","EDWARD NEWBERRY","MARA SHELDON","STEPHANIE CHEUNG"],"issues":["TRA","BUD","TAX",null],"sampleDescriptions":["Issues related to full funding grant agreements for transit projects; issues related to transit funding and financing; FAST Act surface transportation authorization legislation implementation.","FY2019 Transportation, Housing and Urban Development,and Related Agencies appropriations legislation: transit funding.","Issues related to full funding grant agreements for transit projects; issues related to transit funding and financing; transportation policy and safety; FAST Act surface transportation authorization legislation implementation.","FY2020 Transportation, Housing and Urban Development,and Related Agencies appropriations legislation: transit funding.","Issues related to full funding grant agreements for transit projects; issues related to transit funding and financing.","House surface transportation reauthorization legislation and policy - HR 2; Senate surface transportation reauthorization legislation and policy.","FY2021 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation; Transit funding and financing;  Supplemental appropriations related to COVID-19.","Issues related to transit funding and financing; FAST Act surface transportation reauthorization legislation.","COVID-19 Relief Legislation; FY2021 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation: transit funding, railroad finance program.","Issues related to transit funding and financing; surface transportation reauthorization legislation; issues related to Railroad Rehabilitation and Improvement Financing program.","FY2021 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation; issues related to COVID-19 Relief Legislation; issues related to Railroad Rehabilitation and Improvement Financing program.","FY2021 and FY2022 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation: transit funding; member designated projects in surface transportation reauthorization; Railroad Rehabilitation and Improvement Financing (RRIF) program.","Issues related to transit funding and financing; FAST Act surface transportation reauthorization legislation; Transportation provisions of COVID-19 relief legislation; Railroad Rehabilitation and Improvement Financing (RRIF) program.","Issues related to full funding grant agreements for transit projects; Issues related to transit funding and financing; Issues related to the Infrastructure Investments and Jobs Act surface transportation reauthorization legislation.","Issues related to the FY2022 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation and Infrastructure Investment and Jobs Act surface transportation reauthorization; Issues related to the Railroad Rehabilitation and Improvement Financing (RRIF) Program.","Issues related to full funding grant agreements for transit projects; issues related to transit funding and financing; FAST Act surface transportation authorization legislation implementation; Transportation provisions of COVID-19 relief legislation.","FY2021 and FY2022 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation: transit funding.","Issues related to FY2022 Transportation, Housing and Urban Development, and Related Agencies (THUD) appropriations legislation: transit funding.","Issues related to full funding grant agreements for transit projects; issues related to transit funding and financing; Infrastructure Investment and Jobs Act surface transportation reauthorization implementation; issues related to implementation of FY 2022 Appropriations legislation.","Issues surrounding FY2022 and FY2023 Transportation, Housing and Urban Development, and Related Agencies appropriations legislation: transit funding and RRIF program."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}