{"id":199311,"name":"DIAGEO NORTH AMERICA, INC.","slug":"diageo-north-america-inc","state":"DC","description":"Diageo is a global leader in beverage alcohol with brands across spirits, beer and wine.","totalSpending":1400000,"filings":28,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":250000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":200000}],"firms":["HARBINGER STRATEGIES, LLC"],"lobbyists":["MANNY ROSSMAN","STEVE STOMBRES","KYLE NEVINS","JOHN O'NEILL","JONATHAN SLEMROD","PARKER POLING","JOHN LEGANSKI"],"issues":["TAX","TRD","ALC"],"sampleDescriptions":["H.R.1, Tax Reform Act of 2017 (Public Law No. 115-97) - Issues related to tax reform;  the rum cover over and Section 385 of the Internal Revenue Code. Taxation of distilled spirits.","Issues related to the implementation P.L. 114-25 - Trade Facilitation and Trade Enforcement Act of 2015 (duty drawback).","Implementation of Tax Reform Act of 2017 (Public Law No. 115-97); taxation of distilled spirits; rum cover over; section 385 regulations.","Implementation of Tax Reform Act of 2017 (Public Law No. 115-97); taxation of distilled spirits; rum cover over.","Issues related to tariffs and market access.","Implementation of Tax Reform Act of 2017 (Public Law No. 115-97); taxation of distilled spirits; rum cover over; tax extender legislation.","Dietary Guidelines.","Issues related to tariffs and market access; US-UK FTA discussions; remove Treasury and WH as agencies lobbied in the TRD section.","Issues related to tariffs and market access; US-UK FTA discussions.","Taxation of distilled spirits.  Rum cover over.  Tax extender legislation.  Issues related to corporate tax reform.  H.R. 5376, Build Back Better Act.","Taxation of distilled spirits. Rum cover over. Tax extender legislation. Issues related to corporate tax reform. H.R. 5376, Build Back Better Act.","Taxation of distilled spirits. H.R. 1425, to amend the Internal Revenue Code of 1986 to repeal the limitation on the cover over of distilled spirits taxes to the Virgin Islands and Puerto Rico. Issues related to corporate tax reform. HR 5376, Inflation Reduction Act of 2022.","Responsible drinking initiatives. Issues related to sale of distilled spirits. H.R. 7900, National Defense Authorization Act for 2023.","Responsible drinking initiatives. Issues related to sale of distilled spirits.","Taxation of distilled spirits. H.R. 1425, to amend the Internal Revenue Code of 1986 to repeal the limitation on the cover over of distilled spirits taxes to the Virgin Islands and Puerto Rico. Issues related to corporate tax reform.","Taxation of distilled spirits. H.R. 1425, to amend the Internal Revenue Code of 1986 to repeal the limitation on the cover over of distilled spirits taxes to the Virgin Islands and Puerto Rico. Issues related to corporate tax reform. HR 7024, Tax Relief for American Families and Workers Act of 2024.","Taxation of distilled spirits. Legislation relating to the cover over of distilled spirits taxes to the Virgin Islands and Puerto Rico. Issues related to corporate tax reform.","Taxation of distilled spirits. Legislation relating to the cover over of distilled spirits taxes to the Virgin Islands and Puerto Rico. Issues related to corporate tax reform. P.L. 119-21."],"years":[2018,2019,2020,2021,2022,2024,2025]}