{"id":187774,"name":"DROPBOX, INC.","slug":"dropbox-inc","state":"CA","description":"File sharing company","totalSpending":1550000,"filings":31,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":250000},{"year":2021,"income":150000},{"year":2022,"income":250000},{"year":2023,"income":200000},{"year":2024,"income":150000},{"year":2025,"income":150000}],"firms":["FRANKLIN SQUARE GROUP, LLC"],"lobbyists":["MATTHEW TANIELIAN","JOSHUA ACKIL","KARA CALVERT CAMPBELL","BRIAN PETERS","BRIAN WORTH","SARAH BETH JANSEN","TROY PERRY","JESSICA MARTINEZ","WESLEY MCCLELLAND","KEVIN CUMMINS","ROLAND LITTERST"],"issues":["TRD","TAX","CPT","IMM","CPI",null,"LBR"],"sampleDescriptions":["issues related to global data flows; EU-US Privacy Shield, GDPR","H.R.1, Tax Cuts and Jobs Act","intellectual property issues; copyright issues","high skilled immigration; Deferred Action for Childhood Arrivals (DACA)","privacy and cybersecurity issues","issues related to global data flows; EU-US Privacy Shield; international trade issues","issues related to global data flows; international trade issues","issues related to high skilled immigration","privacy, cybersecurity, and encryption issues","intellectual property issues; copyright issues; content moderation and CDA Section 230","issues related to high skilled immigration; executive actions related to immigration","privacy, cybersecurity, and encryption issues; COVID recovery issues","privacy, cybersecurity, and encryption issues; S. 3398, EARN IT Act; S. 4066, Platform Accountability and Consumer Transparency (PACT) Act","privacy, cybersecurity, and encryption issues; S. 3398, EARN IT Act; S. 4066, Platform Accountability and Consumer Transparency (PACT) Act; legislation related to Section 230 of the Communications Decency Act","issues related to global data flows; international trade issues; US-EU privacy shield","privacy, cybersecurity, and encryption issues; issues related to Section 230 of the Communications Decency Act; S. 2731, United States Innovation and Competition Act of 2021","Intellectual property issues; copyright issues","Issues related to high skilled immigration","Privacy, cybersecurity, and encryption issues; \nIssues related to Section 230 of the Communications Decency Act; \nS. 2731, United States Innovation and Competition Act of 2021","Issues related to global data flows; international trade issues; US-EU privacy shield"],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}