{
  "id": 206970,
  "name": "DSM-FIRMENICH",
  "slug": "dsm-firmenich",
  "state": "NJ",
  "description": "Global science-based company active in nutrition, health, and sustainability.",
  "totalSpending": 1420000,
  "filings": 19,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 100000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 280000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "JOEY SMITH",
    "BENJAMIN KLEIN",
    "NICOLE VENABLE",
    "ANNABELL STOKES",
    "KATHRYN WISE",
    "LOGAN HOLLERS",
    "LINDLEY SHERER",
    "STEPHEN WEYLER",
    "MATTHEW FERY",
    "DREW GRIFFIN",
    "JAMES OBRIEN"
  ],
  "issues": [
    "HCR",
    "VET",
    "DEF",
    "AGR",
    "TRD",
    null,
    "ENV"
  ],
  "sampleDescriptions": [
    "Highlight benefits of DSM vitamin D supplement product.",
    "Advocate for vitamin D supplement product.",
    "Advocate for vitamin D supplement product in veterans population.",
    "Encourage support for federal funding for ultra-high molecular weight polyethylene.",
    "Educate policymakers about DSM's feed additive to reduce cattle methane emissions.",
    "Highlight the importance of Vitamin D to boost immunity.",
    "Encourage support for federal funding for body armor.",
    "Educate policymakers about DSM's feed additive to reduce cattle methane emmisions.",
    "Highlight the importance of Vitamin D to boost immunity. Educate policymakers on the importance of UV filters in sunscreen.",
    "Educate policymakers on the importance of UV filters in sunscreen.",
    "Highlight impact of tariffs on sunscreen products.",
    "Educate policymakers on the importance of UV filters in sunscreen. Educate policymakers on the benefits of nutrition to maternal health.",
    "Educate policymakers on the importance of UV filters in sunscreen, the importance of domestic manufacturing capacity of vitamins, issues related to women's health, and other DSM products.",
    "Discuss emissions standards for manufacturing and net metering for solar fields.",
    "Educate policymakers on issues related to women's health and maternal health.",
    "Discuss emissions standards for manufacturing.",
    "Educate policymakers on issues related to women's health and maternal health. Educate policymakers on the importance of domestic manufacturing capacity of vitamins.",
    "Discuss emissions standards for manufacturing. Discuss regulatory barriers to fragrance commercialization and monitor legislative developments related to new chemical production.",
    "Educate policymakers on the importance of UV filters in sunscreen and on issues related to women's health and maternal health.",
    "Discuss regulatory barriers to fragrance commercialization and monitor legislative developments related to new chemical production."
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 140,
  "trajectory": "exploding",
  "yearsActive": 6,
  "avgAnnualSpending": 236667,
  "peakYear": 2022,
  "lobbyistCount": 11,
  "firmCount": 1,
  "issueCount": 6
}