{
  "id": 171550,
  "name": "EDISON CHOUEST OFFSHORE",
  "slug": "edison-chouest-offshore",
  "state": "LA",
  "description": "Marine services, transportation, and technology provider",
  "totalSpending": 2335000,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 305000
    },
    {
      "year": 2019,
      "income": 290000
    },
    {
      "year": 2020,
      "income": 230000
    },
    {
      "year": 2021,
      "income": 300000
    },
    {
      "year": 2022,
      "income": 300000
    },
    {
      "year": 2023,
      "income": 300000
    },
    {
      "year": 2024,
      "income": 300000
    },
    {
      "year": 2025,
      "income": 310000
    }
  ],
  "firms": [
    "OWEN EVANS INGOLS"
  ],
  "lobbyists": [
    "DARYL OWEN",
    "ADAM INGOLS",
    "BRUCE EVANS"
  ],
  "issues": [
    "MAR",
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "General issues associated with the Jones Act and icebreakers; HR 2518 - Coast Guard Authorization Act of 2017; S. 1129 - Coast Guard Authorization Act of 2017",
    "General issues associated with the Jones Act and icebreakers",
    "General issues associated with the Jones Act and icebreakers.  Issues associated with North American trade.",
    "Issues associated with maritime transportation and the Jones Act",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition (including chartering of vessels); issues related to icebreakers;",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition (including chartering of vessels); issues related to icebreakers; H.R. 3055 - CJS Appropriations",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition (including chartering of vessels); issues related to icebreakers; H.R. 3055 & S. 2584 -- Commerce, Justice, Science appropriations, 2020",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to icebreakers; H.R. 1865, Domestic Priorities and International Assistance Appropriations Minibus, and H.R. 1158, National Security Appropriations Minibus",
    "H.R.748 - CARES Act; issues related to affiliate taxation",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); H.R.748 - CARES Act; FY 2021 appropriations for the Departments of Commerce, Justice and Related Agencies; appropriations for the National Oceanic and Atmospheric Administration",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); House and Senate FY 2021 appropriations for the Departments of Commerce, Justice and Related Agencies;",
    "issues related to affiliate taxation",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development; issues related to the DOE loan program office",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development; issues related to the DOE loan program office; CJS Appropriations (HR 4505 and Senate companion)",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development; issues related to the DOE loan program office; CJS Appropriations (HR 4505 and Senate companion); issues related to HR 2471 - Consolidated Appropriations Act for FY 2022; H.R. 6865 - Coast Guard Authorization Act of 2022",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development; issues related to the DOE loan program office; House and Senate Homeland Security Appropriations (HR 8257 and Senate companion); H.R. 6865 - Coast Guard Authorization Act of 2022",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development including as they relate to HR 5376 - Inflation Reduction Act of 2022; House and Senate Homeland Security Appropriations (HR 8257 and Senate companion); H.R. 6865 and S. 4802 - Coast Guard Authorization Act of 2022",
    "Issues pertaining to the Jones Act; issues related to federal fleet acquisition and management (including chartering of vessels); issues related to offshore wind development including as they relate to implementation of HR 5376 - Inflation Reduction Act of 2022; H.R. 2617 Consolidated Appropriations Act for FY 2023; H.R. 6865 and S. 4802 Coast Guard Authorization Act of 2022 and HR 7900 National Defense Authorization Act",
    "Issues related to offshore energy (oil, gas, and renewable) service and supply vessels; general issues related to the Jones Act and domestic icebreaker development; USCG reauthorization (H.R. 1452); Homeland Security appropriations in the House (H.R. 4367) and Senate (S. 2625) as included in the Further Consolidated Appropriations Act of 2024 - H.R. 2882; H.R. 7659, the Coast Guard Authorization Act of 2024"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 2,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 291875,
  "peakYear": 2025,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 2
}