{"id":184205,"name":"EHEALTH INSURANCE SERVICES, INC.","slug":"ehealth-insurance-services-inc","state":"DC","description":"Benefits management company","totalSpending":1380000,"filings":24,"yearlySpending":[{"year":2018,"income":80000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":240000}],"firms":["AVOQ, LLC"],"lobbyists":["STEVEN ELMENDORF","PATRICK BOUSLIMAN","STACEY ALEXANDER","BILL GHENT","SANDRA ALCALA","CAITLIN CANTER","NATALIE FARR HARRISON","JOSEPH ORLANDO","LINDSEY SEIDMAN"],"issues":["HCR","BUD"],"sampleDescriptions":["Issues related tothe comparison and purchase of health insurance products, including Medicare plans.","Issues related to COVID-19 stimulus legislation; H.R. 133 (FY2021 Omnibus and COVID Relief and Response Act)","Issues related tothe comparison and purchase of health insurance products, including Medicare plans\nIssues related to H.R. 1796 (Health Care Enrollment Innovation Act)","Issues related tothe comparison and purchase of health insurance products, including Medicare plans\nIssues related to H.R.1796 (Health Care Enrollment Innovation Act)","Issues related tothe comparison and purchase of health insurance products, including Medicare plans Issues related to H.R.1796 (Health Care Enrollment Innovation Act)","Issues related tothe comparison and purchase of health insurance products, including Medicare plans","Issues related tothe comparison and purchase of health insurance products, including Medicare plans Issues related to the Centers for Medicare and Medicaid Services","Issues related tothe comparison and purchase of health insurance products, including Medicare plans; Issues related to the Centers for Medicare and Medicaid Services; Issues related to third party marketing organizations and licensed agents and brokers","Issues related to the comparison and purchase of health insurance products, including Medicare plans; Issues related to the Centers for Medicare and Medicaid Services; Issues related to third party marketing organizations and licensed agents and brokers","Issues related to the comparison and purchase of health insurance products, including Medicare plans; Issues related to the Centers for Medicare and Medicaid Services; Issues related to third party marketing organizations and licensed agents and brokers; Monitoring of health care issues in H.R. 1, One Big Beautiful Bill Act","Issues related to the comparison and purchase of health insurance products, including Medicare plans; Issues related to the Centers for Medicare and Medicaid Services; Issues related to third party marketing organizations and licensed agents and brokers; H.R. 5463/S. 2875, Choice Arrangement Act of 2025"],"years":[2018,2019,2020,2021,2022,2024,2025]}