{"id":127159,"name":"ELEVANCE HEALTH, INC.","slug":"elevance-health-inc","state":"IN","description":"Health benefits company.","totalSpending":2340000,"filings":28,"yearlySpending":[{"year":2018,"income":360000},{"year":2019,"income":270000},{"year":2020,"income":270000},{"year":2021,"income":360000},{"year":2022,"income":360000},{"year":2023,"income":240000},{"year":2024,"income":120000},{"year":2025,"income":360000}],"firms":["TIBER CREEK GROUP"],"lobbyists":["JONATHON JONES","SEAN RICHARDSON","TIMOTHY MOLINO","COREY MALMGREN","LINDSEY LEDWIN","JOHN GONZALEZ","ANDREW MCKECHNIE"],"issues":["TAX","HCR","INS","LBR",null,"TEC","MMM"],"sampleDescriptions":["health insurance tax repeal, Patient Protection and Affordable Care Act, PL 111-148. HR 1892 Continuing Resolution, HR 195, Continuing Resolution.","mental health issues, opioid treatment","Patient Protection and Affordable Care Act, PL 111-148 HR. 3590 implementation, special enrollment periods, grace periods, Cost Sharing Reduction Payments, risk adjustment, American Health Care Act HR 1628, Medicare Advantage. Issues surrounding bare counties. HR 3922 Championing Healthy Kids Act and S. 1827 KIDS Act of 2017. Education surrounding Emergency Room payment programs. HR 1625, Consolidated Appropriations, HR 1892 Continuing Resolution, HR 195 Continuing Resolution.","Health insurance tax repeal, Patient Protection and Affordable Care Act, PL 111-148.","Mental health issues, opioid treatment.  HR 6082 Overdose Prevention and Patient Safety Act. Education around MAC Part A and B contractor activity. Health care competition issues.","Patient Protection and Affordable Care Act, PL 111-148 HR. 3590 implementation, grace periods, risk adjustment, Medicare Advantage. Issues surrounding bare counties. HR 3922 Championing Healthy Kids Act and S. 1827 KIDS Act of 2017. Education surrounding Emergency Room payment programs. HR 1625, Consolidated Appropriations","Mental health issues, opioid treatment.  HR 6082 Overdose Prevention and Patient Safety Act. Education around MAC Part A and B contractor activity. Health care competition issues. HR 6 Support for Patients and Communities Act, 42 CFR Part 2. Patient Protection and Affordable Care Act, PL 111-148. H.R. 3590 implementation, grace periods, risk adjustment, Medicare Advantage. Issues surrounding bare counties. Education surrounding Emergency Room payment programs. HR 1625, Consolidated Appropriations.","Mental health issues, opioid treatment.  HR 6082 Overdose Prevention and Patient Safety Act. Education around MAC Part A and B contractor activity. Health care competition issues. HR 6 Support for Patients and Communities Act, 42 CFR Part 2. Patient Protection and Affordable Care Act, PL 111-148. H.R. 3590 implementation, grace periods, risk adjustment, Medicare Advantage. HR 1625, Consolidated Appropriations.","ACA stabilization issues, implementation of P.L. 111-148. Surprise medical billing","S. 172, HR 1298 Health Insurance Tax Relief Act of 2019","ACA stabilization issues, implementation of P.L. 111-148. Surprise medical billing. 42 CFR Part 2. S. 1012 Protecting Jessica Grubbs Legacy Act and HR 2062 Overdose Prevention and Patient Safety Act. Prescription Drug Price Reduction Act.","S. 172, H.R. 1398 Health Insurance Tax Relief Act of 2019","ACA stabilization issues, implementation of P.L. 111-148. Surprise medical billing. 42 CFR Part 2. Coronavirus Preparedness and Response Supplemental Appropriations Act (Public Law 116-123), Families First Coronavirus Response Act (Public Law 116-127), S. 3548/HR 748 CARES Act (Public Law 116-136), Issues related to Commercial Paper Funding Facility. HR 6926 MIND Act","ACA stabilization issues, implementation of P.L. 111-148. Surprise medical billing. 42 CFR Part 2. Coronavirus Preparedness and Response Supplemental Appropriations Act (Public Law 116-123), Families First Coronavirus Response Act (Public Law 116-127), S. 3548/HR 748 CARES Act (Public Law 116-136), Issues related to Commercial Paper Funding Facility. HR 6926 MIND Act. HR 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act; Health, Economic Assistance, Liability Protection, and Schools (HEALS) Act; HR 925 the HEROES Act; MA extreme and uncontrollable circumstances policy","ACA stabilization issues, implementation of P.L. 111-148. Surprise medical billing. 42 CFR Part 2. Coronavirus Preparedness and Response Supplemental Appropriations Act (Public Law 116-123), Families First Coronavirus Response Act (Public Law 116-127), S. 3548/HR 748 CARES Act (Public Law 116-136). HR 6926 MIND Act. HR 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act; Health, Economic Assistance, Liability Protection, and Schools (HEALS) Act; HR 925 the HEROES Act; MA extreme and uncontrollable circumstances policy; H.R. 133 / PL 116-260 - FY2021 Omnibus and COVID Relief and Response Act","H.R. 1418/S. 350 Competitive Health Insurance Reform Act","ACA stabilization issues, implementation of PL 111-148; Issues related to the federal COVID response and Covid Testing; Implementation of Coronavirus Preparedness and Response Supplemental Appropriations Act (PL 116-123); Implementation of Families First Coronavirus Response Act (PL 116-127); S. 3548/H.R. 748 - CARES Act (PL 116-136); H.R. 6926 - MIND Act; H.R. 6800 - the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act; Health; H.R. 925 the HEROES Act; Implementation  of  H.R. 133/PL 116-260 - FY2021 Omnibus and COVID Relief and Response Act; H.R. 2166 The Ensuring Parity in MA and PACE for Audio-Only Telehealth Act.","ACA stabilization issues, implementation of PL 111-148; Issues related to the federal COVID response and Covid Testing; Implementation of Coronavirus Preparedness and Response Supplemental Appropriations Act (PL 116-123); Implementation of Families First Coronavirus Response Act (PL 116-127); Coronavirus Aid, Relief, and Economic Security (CARES) Act (PL 116-136); Health; H.R. 925 - the HEROES Act; Implementation of FY2021 Omnibus and COVID Relief and Response Act (PL 116-260); H.R. 2166 - The Ensuring Parity in MA and PACE for Audio-Only Telehealth Act. The American Rescue Plan Act of 2021 (PL 117-2).","Implementation of the ACA (PL 111-148), and stabilization issues; Issues related to the federal COVID response and Covid Testing; Implementation of Coronavirus Preparedness and Response Supplemental Appropriations Act (PL 116-123); Implementation of Families First Coronavirus Response Act (PL 116-127); Coronavirus Aid, Relief, and Economic Security (CARES) Act (PL 116-136); Health; H.R. 925 - the HEROES Act; Implementation of FY2021 Omnibus and COVID Relief and Response Act (PL 116-260); H.R. 2166 - The Ensuring Parity in MA and PACE for Audio-Only Telehealth Act; The American Rescue Plan Act of 2021 (PL 117-2).","Implementation of the ACA (PL 111-148) and stabilization issues; Issues related to the federal COVID response and COVID Testing; Implementation of Coronavirus Preparedness and Response Supplemental Appropriations Act (PL 116-123); Implementation of Families First Coronavirus Response Act (PL 116-127); Coronavirus Aid, Relief, and Economic Security (CARES) Act (PL 116-136); Health; H.R. 925 - the HEROES Act; Implementation of FY2021 Omnibus and COVID Relief and Response Act (PL 116-260); H.R. 2166 - The Ensuring Parity in MA and PACE for Audio-Only Telehealth Act; The American Rescue Plan Act of 2021 (PL 117-2); H.R. 6833/S. 3700 - Affordable Insulin Now Act; Issues related to Medicare Advantage payment policies; Issues related to mental health."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}