{
  "id": 104671,
  "name": "ENDEAVORS",
  "slug": "endeavors",
  "state": "TX",
  "description": "&#226;€‹Non-profit organization providing social services",
  "totalSpending": 2630000,
  "filings": 25,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 130000
    },
    {
      "year": 2019,
      "income": 160000
    },
    {
      "year": 2021,
      "income": 340000
    },
    {
      "year": 2022,
      "income": 480000
    },
    {
      "year": 2023,
      "income": 600000
    },
    {
      "year": 2024,
      "income": 480000
    },
    {
      "year": 2025,
      "income": 440000
    }
  ],
  "firms": [
    "ARNOLD & PORTER KAYE SCHOLER LLP"
  ],
  "lobbyists": [
    "SARA LINDER",
    "DANA WEEKES",
    "KRISTINE BLACKWOOD",
    "PARI MODY",
    "EUGENIA PIERSON",
    "CJ MAHLER",
    "KEVIN O'NEILL",
    "MARNE MAROTTA",
    "MARK EPLEY",
    "JANICE BASHFORD",
    "BOBBY MCMILLIN",
    "VINCENT BROWN",
    "SCARLETT BICKERTON",
    "HALEY NICHOLSON",
    "EBONY SLAUGHTER-JOHNSON",
    "JESSICA MONAHAN",
    "DREW BENZAIA",
    "SATYA THALLAM",
    "SONJA NESBIT",
    "TWINKLE PATEL",
    "GRACE SUCHANYC",
    "DYLAN KELEMEN",
    "EMILY CRAWFORD"
  ],
  "issues": [
    "VET",
    "BUD",
    "IMM",
    "DIS",
    "HOM",
    null
  ],
  "sampleDescriptions": [
    "Issues surrounding federal benefits programs for veterans.",
    "Issues related to the Supportive Services for Veteran Families (SSVF) Program. S.3479 - Department of Veterans Affairs Expiring Authorities Act of 2018. H.R.6157 - Department of Defense and Labor, Health and Human Services, and Education Appropriations Act, 2019 and Continuing Appropriations Act, 2019.",
    "Issues related to the Supportive Services for Veteran Families (SSVF) Program.",
    "Issues related to the Supportive Services for Veteran Families (SSVF) Program. Appropriations issues regarding the Department of Veteran's Affairs and Department of Homeland Security. Appropriations issues concerning disaster case management.",
    "Issues related to the Supportive Services for Veteran Families (SSVF) Program. Appropriations issues regarding the Department of Veterans Affairs and Department of Homeland Security. Appropriations issues concerning disaster case management.",
    "Issues regarding housing of migrants at the U.S. border.",
    "Issues related to the Supportive Services for Veteran Families (SSVF) Program and VA Whole Health initiative.",
    "Issues regarding the Community Development Block Grant program and the Community Development Block Grant Disaster Recovery program.",
    "Policy issues related to immigration, homeland security, and humanitarian aid.",
    "Policy issues relating to immigration and the southern border.",
    "Issues related to veterans medical, housing and assistance services in FY 2023 appropriations.",
    "Emergency disaster relief in FY 2023 appropriations.",
    "FY23 appropriations regarding veterans, emergency relief, and housing assistance.",
    "Policy issues relating to migrant services.",
    "Issues related to veterans medical, housing, and assistance services.",
    "Policy issues related to FEMA and emergency disaster relief.",
    "CBP wellness and FEMA disaster case management.",
    "FY 24 appropriations regarding veterans' housing and supportive services, disaster case management; FY 25 appropriations regarding veterans' housing and supportive services, CBP wellness, disaster case management, and Continuum of Care.",
    "Issues related to policy issues relating to migrant services.",
    "Issues related to CBP wellness and FEMA disaster case management."
  ],
  "years": [
    2018,
    2019,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 238,
  "trajectory": "exploding",
  "yearsActive": 7,
  "avgAnnualSpending": 375714,
  "peakYear": 2023,
  "lobbyistCount": 23,
  "firmCount": 1,
  "issueCount": 5
}