{"id":171549,"name":"ENERGY TRANSFER PARTNERS","slug":"energy-transfer-partners","state":"TX","description":"midstream oil and gas infrastructure and transportation company","totalSpending":3320000,"filings":26,"yearlySpending":[{"year":2018,"income":480000},{"year":2019,"income":360000},{"year":2020,"income":600000},{"year":2021,"income":360000},{"year":2022,"income":480000},{"year":2024,"income":590000},{"year":2025,"income":450000}],"firms":["OWEN EVANS INGOLS"],"lobbyists":["DARYL OWEN","ADAM INGOLS","BRUCE EVANS"],"issues":["FUE","CAW","TRA","TAX","ENG"],"sampleDescriptions":["Issues associated with pipeline permitting and pipeline safety; H.R. 2883 - Promoting Cross-Border Energy Infrastructure Act;    \nH.R. 2910, Promoting Interagency Coordination for Review of Natural Gas Pipelines Act","Issues associated with pipeline permitting and pipeline safety; general issues associated with infrastructure development","all issues associated with the siting, permitting, and licensing of midstream energy assets; issues associated with liquified natural gas; issues associated with corporate taxation","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cross border permitting; issues associated with cyber and physical security of energy infrastructure","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with channel dredging and harbor maintenance; issues associated with cyber and physical security of energy infrastructure","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with channel dredging and harbor maintenance; issues associated with cyber and physical security of energy infrastructure; pipeline safety issues in H.R. 3432 - Safer Pipelines Act of 2019 and S. 2299 - PIPES Act of 2019; and, H.R. 2960 & S. 2470 - Energy & Water Development appropriations, 2020","H.R.748 - CARES Act; issues associated with the taxation of publicly traded partnerships","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with channel dredging and harbor maintenance; issues associated with cyber and physical security of energy infrastructure; pipeline safety issues in H.R. 3432 - Safer Pipelines Act of 2019 and S. 2299 - PIPES Act of 2019; issues associated with liquified natural gas exports; H.R.748 - CARES Act","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with channel dredging and harbor maintenance; issues associated with cyber and physical security of energy infrastructure; pipeline safety issues in H.R. 3432 - Safer Pipelines Act of 2019 and S. 2299 - PIPES Act of 2019; issues associated with liquified natural gas exports","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; issues associated with liquified natural gas exports","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; H.R. 133 - FY2021 Omnibus and COVID Relief and Response Act","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; bipartisan infrastructure proposals","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; H.R.3684 - Infrastructure Investment and Jobs Act; issues related to the midstream energy sector contained within the reconciliation legislation/instructions","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; H.R.3684 - Infrastructure Investment and Jobs Act; issues related to the midstream energy sector contained within the reconciliation legislation/instructions, H.R. 5376 - Build Back Better Act","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; issues related to the midstream energy sector contained within the reconciliation legislation/instructions, H.R. 5376 - Build Back Better Act","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues associated with cyber and physical security of energy infrastructure; issues related to the midstream energy sector contained within the reconciliation legislation/instructions, H.R. 5376 - Build Back Better Act; general issues related to liquified natural gas exports; issues related to funding opportunities established in the Infrastructure Investment and Jobs Law","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; issues related to the midstream energy sector contained within HR 5376 - Inflation Reduction Act of 2022; general issues related to liquified natural gas exports; issues related to funding opportunities established in the Infrastructure Investment and Jobs Law","Issues associated with the siting, permitting, and construction of liquid and gas pipeline infrastructure; general issues related to liquified natural gas exports; issues related to funding opportunities established in the Infrastructure Investment and Jobs Law; pipeline issues related to H.R. 2617 - Consolidated Appropriations Act of FY 2023; permitting issues in H.R. 7900 - National Defense Authorization Act for FY2023","General issues related to oil and gas pipelines and midstream infrastructure; issues related to LNG exports and deepwater ports; general permitting issues related to energy infrastructure; issues related to pipeline relocation and general pipeline safety issues including H.R. 7655 - the Pipeline Safety Modernization and Expansion Act; energy infrastructure issues contained in H.R. 4366 the Military Construction appropriations bill and Senate equivalent (S. 2127)","General issues related to oil and gas pipelines and midstream infrastructure; issues related to LNG exports and deepwater ports; general permitting issues related to energy infrastructure; issues related to pipeline relocation and general pipeline safety issues including H.R. 7655 - the Pipeline Safety Modernization and Expansion Act"],"years":[2018,2019,2020,2021,2022,2024,2025]}