{"id":181139,"name":"ENERGY INFRASTRUCTURE COUNCIL FKA MASTER LIMITED PARTNERSHIP ASSOCIATION","slug":"energy-infrastructure-council-fka-master-limited-partnership-association","state":"DC","description":"Business Association","totalSpending":2030000,"filings":31,"yearlySpending":[{"year":2018,"income":270000},{"year":2019,"income":260000},{"year":2020,"income":360000},{"year":2021,"income":180000},{"year":2022,"income":300000},{"year":2023,"income":300000},{"year":2024,"income":180000},{"year":2025,"income":180000}],"firms":["ZIEBART CONSULTING, LLC"],"lobbyists":["LORI LAUDIEN ZIEBART"],"issues":["TAX","FIN","ENG",null],"sampleDescriptions":["Legislative and regulatory matters affecting IRC Section 7704, large partnership audit regime, and federal tax rates, including the \"Tax Cuts and Jobs Act.\"","Legislative and regulatory matters affecting IRC Section 7704, and federal tax policy including implementation of the \"Tax Cuts and Jobs Act\" (Public Law 115-97).","Legislative and regulatory matters affecting IRC Section 7704 and other federal tax policy, including implementation of the \"Tax Cuts and Jobs Act\" (Public Law 115-97) and S.1841 and H.R. 3249, the \"Financing Our Energy Future Act.\"","Issues related to SEC rulemaking on shareholder proposal rule 14A-8.","Legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including implementation of the \"Tax Cuts and Jobs Act\" (Public Law 115-97) and S.1841 and H.R. 3249, the \"Financing Our Energy Future Act.\"","Energy and environmental legislation including, but not limited to: the development of energy infrastructure; and environmental, social & governance (ESG) matters, including climate change and sustainability.","Energy and environmental legislation including, but not limited to: the development of energy infrastructure; and environmental, social & governance matters (ESG), including climate change and sustainability. S.4402, a bill to amend the Federal Water Pollution Control Act to clarify certain activities that would have been authorized under Nationwide Permit 12 and other Nationwide permits.","Legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including S.1841 and H.R. 3249, the \"Financing Our Energy Future Act.\"","Energy and environmental legislation including, but not limited to: the development of energy infrastructure; and environmental, social & governance matters (ESG), including climate change and sustainability.","Legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including S 1034, the \"Financing Our Energy Future Act.\"","Legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including S 1034 and HR 2291, the \"Financing Our Energy Future Act,\" and S 627 and HR 1684, the \"Energy Storage Tax Incentive and Deployment Act of 2021.\"","Legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including S 1034 and HR 2291, the \"Financing Our Energy Future Act,\" S 627 and HR 1684, the \"Energy Storage Tax Incentive and Deployment Act of 2021,\" and HR 5376, the \"Build Back Better Act.\"","Legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including S 1034 and HR 2291, the \"Financing Our Energy Future Act,\" S 627 and HR 1684, the \"Energy Storage Tax Incentive and Deployment Act of 2021,\" and HR 5376, the \"Inflation Reduction Act.\"","H.R.7024 - Tax Relief for American Families and Workers Act of 2024; and legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including H.R. 3690 and S.2641, the \"Financing Our Energy Future Act\".","H.R.7024 - the \"Tax Relief for American Families and Workers Act of 2024\"; H.R. 3210 and S 1559 - the \"Book Minimum Tax Repeal Act,\" and legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including H.R. 3690 and S.2641, the \"Financing Our Energy Future Act\".","H.R. 1 - the \"One Big Beautiful Bill Act,\" S. 796 - the \"Book Minimum Tax Repeal Act,\" H.R. 703 and S.213 - the \"Main Street Tax Certainty Act,\" and legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies, including H.R. 2545 and S. 510 - the \"Financing Our Energy Future Act.\"","S. 796 - the \"Book Minimum Tax Repeal Act,\" and legislative and regulatory matters affecting master limited partnerships and energy infrastructure companies."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}