{
  "id": 204485,
  "name": "ENTERPRISE HOLDINGS, INC. DBA ENTERPRISE MOBILITY",
  "slug": "enterprise-holdings-inc-dba-enterprise-mobility",
  "state": "MO",
  "description": "Transportation, car rental, and carsharing company",
  "totalSpending": 2150000,
  "filings": 23,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 170000
    },
    {
      "year": 2021,
      "income": 290000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 380000
    },
    {
      "year": 2024,
      "income": 550000
    },
    {
      "year": 2025,
      "income": 520000
    }
  ],
  "firms": [
    "VENABLE LLP"
  ],
  "lobbyists": [
    "JAMES BURNLEY",
    "SAMUEL OLCHYK",
    "WILLIAM NORDWIND",
    "RICHARD HEGG",
    "JOSH FINESTONE",
    "BART STUPAK",
    "MARK PRYOR",
    "THOMAS QUINN",
    "GREGORY GILL",
    "DAVID MULLON",
    "NICHOLAS CHOATE",
    "JAMES REILLY",
    "RICHARD WARD",
    "JOHN V. DRZEWICKI"
  ],
  "issues": [
    "AVI",
    "TAX",
    "TRA",
    "CSP",
    "HOM",
    null,
    "AUT"
  ],
  "sampleDescriptions": [
    "Issues related to COVID-19 related tax relief and minimum annual guarantee payments.",
    "Issues related to COVID-related tax relief, including H.R. 748 (\"CARES Act\") and S. 3548 (\"CARES Act\")",
    "Issues related to COVID-related minimum annual guarantee payments, including H.R. 748 (\"CARES Act\") and S. 3548 (\"CARES Act\")",
    "Issues related to CARES Act Airport Improve Program implementation",
    "Issues related to CARES Act Airport Improvement Program implementation",
    "Endless Frontier Act, S.1260",
    "Revenue proposals included in the Administrations FY 2022 budget and S. Con. Res. 14 regarding the corporate tax rate and international taxes (GILTI)",
    "Issues relating to transportation of military personnel",
    "Issues related to NHTSA airbag regulations",
    "Revenue proposals included in Build Back Better (H.R. 5376) and Senate Finance Committee Version regarding the international taxes (GILTI)",
    "Issues relating to transportation of military personnel and electric vehicles/electric vehicle infrastructure",
    "Revenue proposals included in Build Back Better and Senate Finance Committee Version regarding the international taxes (GILTI) and tax incentives for electric vehicle infrastructure",
    "Revenue proposals included in Build Back Better and Senate Finance Committee discussion draft regarding corporate and international taxes (GILTI) and tax incentives for electric vehicles and electric vehicle infrastructure",
    "Issues relating to terrorism prevention; H.R. 4089, the Darren Drake Act",
    "Issues relating to electric vehicles/electric vehicle infrastructure and FAA reauthorization.",
    "Revenue proposals regarding corporate and international taxes (GILTI) and tax incentives for electric vehicle infrastructure",
    "Consumer issues related to the rental car industry",
    "Vehicle data access issue",
    "Business proposals contained in HR 7024, the American Families and Workers Act of 2024 Treasury guidance regarding the EV tax credits enacted in Pub. Law 117-169, the Inflation Reduction Act, domestic and international business tax provisions enacted in Pub. Law 115-97, the Tax Cuts and Jobs Act of 2017",
    "Business proposals contained in HR 7024, the American Families and Workers Act of 2024; Treasury guidance regarding the EV tax credits enacted in Pub. Law 117-169, the Inflation Reduction Act, domestic and international business tax provisions enacted in Pub. Law 115-97, the Tax Cuts and Jobs Act of 2017"
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 206,
  "trajectory": "exploding",
  "yearsActive": 6,
  "avgAnnualSpending": 358333,
  "peakYear": 2024,
  "lobbyistCount": 14,
  "firmCount": 1,
  "issueCount": 6
}