{
  "id": 184919,
  "name": "EVENTBRITE, INC.",
  "slug": "eventbrite-inc",
  "state": "CA",
  "description": "Event technology platform for ticketing, registration, promotion and management of events.",
  "totalSpending": 1510000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 150000
    },
    {
      "year": 2019,
      "income": 120000
    },
    {
      "year": 2020,
      "income": 210000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 110000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "HEATHER PODESTA",
    "JONATHAN BECKER",
    "PATRICE WILLOUGHBY",
    "LARISSA MARTINEZ",
    "ROBERT HOFFMAN",
    "ERIC ROSEN",
    "ANNE PALISI",
    "LINDLEY SHERER",
    "QUINCY ENOCH",
    "CAROLYN CODA",
    "VENKATASATYA KROVI",
    "SAMUAL LOVE",
    "JOEL RICHARD",
    "KATHRYN WISE",
    "DREW GRIFFIN",
    "THEODORE TANZER"
  ],
  "issues": [
    "CSP",
    "CPI",
    "DIS",
    "SMB",
    "DEF",
    "HCR",
    null,
    "TAX"
  ],
  "sampleDescriptions": [
    "Monitor S. 1693, the Stop Enabling Sex Traffickers Act of 2017 (SESTA), and H.R. 1865, the Allow States and Victims to Fight Online Sex Trafficking Act of 2017 (FOSTA).",
    "Monitor issues related to open internet, broadband infrastructure, electronic communications/data privacy and security, and cross-border data flows.",
    "Educate Members of Congress on Eventbrite and issues related to online platforms and event safety; monitor issues related to open internet, broadband infrastructure, and electronic communications/data privacy and security.",
    "Educate Members of Congress on the company and issues related to online platforms ticketing and event safety; monitor issues related to open internet, broadband infrastructure, and electronic communications/data privacy and security; monitor issues relating to the FTC's online event ticket workshop.",
    "Educate Members of Congress on the company and issues related to event safety; monitor issues related to open internet, broadband infrastructure, and electronic communications/data privacy and security; monitor H.R. 3248 and S. 1850, the Better Oversight of Secondary Sales and Accountability in Concert Ticketing Act of 2019; educate  Members on H.R. 4782, the National Commission on Online Platforms and Homeland Security Act.",
    "Monitor coronavirus relief legislation.",
    "Educate Members of Congress on the company and issues related to event safety; monitor issues related to open internet, broadband infrastructure, and electronic communications/data privacy and security; monitor H.R. 3248 and S. 1850, the Better Oversight of Secondary Sales and Accountability in Concert Ticketing Act of 2019; monitor issues related to online content moderation, including in S. 3398, the EARN IT Act of 2020.",
    "Advocate for access to small business lending programs, including in H.R. 748, the CARES Act.",
    "Advocate for access to small business lending programs, including in H.R. 6800, the HEROES Act.",
    "Monitor coronavirus relief legislation and support small business relief programs that benefit the live events community.",
    "Monitor coronavirus relief legislation and support small business relief programs that benefit the live events community, including in H.R. 7481 / S. 3814, the RESTART Act, and H.R. 7806 / S. 4258, the Save our Stages Act.",
    "Educate Members of Congress on the company and issues related to event safety; monitor issues related to open internet, broadband infrastructure, and electronic communications/data privacy and security; monitor H.R. 3248 and S. 1850, the Better Oversight of Secondary Sales and Accountability in Concert Ticketing Act of 2019; monitor issues related to online content moderation.",
    "Monitor potential addition of content moderation to H.R. 6395 and S. 4049, the National Defense Authorization Act for Fiscal Year 2021.",
    "Monitor issues related to event safety, open internet, broadband infrastructure, and electronic communications/data privacy and security; monitor issues related to content moderation.",
    "Monitor implementation of coronavirus relief legislation and support small business relief programs that benefit the live events community.",
    "Monitor efforts to enact legislation impacting the ticketing industry.",
    "Monitor efforts to reform federal mental health programs.",
    "Monitor issues related to event safety, open internet, broadband infrastructure, and electronic communications/data privacy and security; educate Members of Congress on platforms content moderation policies and monitor issues related to content moderation.",
    "Monitor efforts to reform federal mental health programs; educate Members of Congress on the need to elevate social isolation among young adults as a public health priority.",
    "Monitor issues related to event safety, open internet, broadband infrastructure, and electronic communications and security."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -27,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 188750,
  "peakYear": 2022,
  "lobbyistCount": 16,
  "firmCount": 1,
  "issueCount": 7
}