{"id":202453,"name":"EVERGY FORMERLY KANSAS CITY POWER AND LIGHT COMPANY","slug":"evergy-formerly-kansas-city-power-and-light-company","state":"MO","description":"Public Utility","totalSpending":1195000,"filings":25,"yearlySpending":[{"year":2018,"income":90000},{"year":2019,"income":160000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":150000},{"year":2024,"income":240000},{"year":2025,"income":205000}],"firms":["HB STRATEGIES"],"lobbyists":["GREGG HARTLEY","WILLIAM FOX","JOHN ARIALE","RUSSELL ORBAN","STACY MCBRIDE"],"issues":["UTI","BUD","ENG","TAX"],"sampleDescriptions":["Monitor energy related legislation and issues.","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. \nIssues Related Energy Policy Modernization Act of 2017; Infrastructure improvements","Tax Reform legislation with focus on energy industry related provisions","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. \nIssues Related to Energy Policy Modernization Act of 2017; Nuclear Waste Storage Amendments, HR 3053","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. Promote LIHEAP funding in FY Labor HHS Appropriations bills","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. \nIssues Related to Energy Policy Modernization Act;  Nuclear Waste Storage Amendments","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. \nIssues Related Energy Policy Modernization and Infrastructure improvements","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. \nIssues Related to Energy Policy Modernization Act;  Nuclear Waste Storage Amendments; promote support of electric vehicle tax credits and American Energy Bonds.","Tax Reform legislation with focus on energy industry related provisions; certain energy-realted tax credits, and the development and promotion of American Energy Bond Initiative.","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. Promote LIHEAP funding in FY Labor HHS Appropriations bills, monito FY Energy and Water Development funding provision.","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations.\nIssues Related to Energy Policy Modernization Act; Nuclear Waste Storage Amendments; promote support of electric vehicle tax credits and American Energy Bonds.","Tax Reform legislation with focus on energy industry related provisions; certain energy-realted tax credits, and the development and promotion of American Energy Bond Initiative.\nSpecifically, H.R. 848, Growing Renewable Energy and Efficiency Now (GREEN) Act of 2021; H.R. 1319, American Rescue Plan Act of 2021; Clean Energy for America Act (Sen. Wyden Tech Neutral); Energy Sector Innovation Credit Act (Rep. Reed Tech Neutral); and Electric Vehicle Tax Credit (30D).","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. Promote LIHEAP funding in FY Labor HHS Appropriations bills, monito FY Energy and Water Development funding provision.\nDiscuss H.R. 1319, American Rescue Plan Act of 2021; Low and zero emission vehicle funding; and Energy R&D funding with members of Kansas and Missouri delegation.","Monitor and evaluate legislative proposals related to energy reform, clean energy, energy storage, electric transmission, grid security and grid resiliency matters and outreach to Kansas and Missouri Delegations on these issues of key importance to energy industry.","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. Promote LIHEAP funding in FY Labor HHS Appropriations bills, monito FY Energy and Water Development funding provision. Discuss H.R. 1319, American Rescue Plan Act of 2021; Low and zero emission vehicle funding; and Energy R&D funding with members of Kansas and Missouri delegation.","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. Issues Related to Energy Policy Modernization Act; Nuclear Waste Storage Amendments; promote support of electric vehicle tax credits and American Energy Bonds.","Tax Reform legislation with focus on energy industry related provisions; certain energy-realted tax credits, and the development and promotion of American Energy Bond Initiative. Specifically, H.R. 848, Growing Renewable Energy and Efficiency Now (GREEN) Act of 2021; H.R. 1319, American Rescue Plan Act of 2021; Clean Energy for America Act (Sen. Wyden Tech Neutral); Energy Sector Innovation Credit Act (Rep. Reed Tech Neutral); and Electric Vehicle Tax Credit (30D).","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegtations. Promote LIHEAP funding in FY Labor HHS Appropriations bills, monitor FY Energy and Water Development funding provisions. Low and zero emission vehicle funding; and Energy R&D funding with members of Missouri and Kansas delegations.","Monitor and evaluate legislative proposals related to energy reform, clean energy storage, electric transmission, grid security and grid resiliency matters and outreach to Kansas and Missouri delegations on issues of key importance to energy industry.","Monitor energy related legislation and issues. Outreach to Missouri and Kansas Congressional delegations. Issues related to Energy Policy Modernization Act; Nuclear Waste Storage Amendments; promote support for electric vehicle tax credits and American Energy Bonds."],"years":[2018,2019,2020,2021,2022,2024,2025]}