{
  "id": 205039,
  "name": "EXELIXIS",
  "slug": "exelixis",
  "state": "CA",
  "description": "Genomics-based drug discovery company",
  "totalSpending": 1380000,
  "filings": 23,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 180000
    },
    {
      "year": 2022,
      "income": 360000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 180000
    },
    {
      "year": 2025,
      "income": 180000
    }
  ],
  "firms": [
    "THORN RUN PARTNERS"
  ],
  "lobbyists": [
    "ANDREW ROSENBERG",
    "GARY PALMQUIST",
    "CATHERINE FINLEY",
    "MICHAEL MCCARTHY"
  ],
  "issues": [
    "HCR",
    "MMM",
    null
  ],
  "sampleDescriptions": [
    "Issues related to pharmaceutical pricing.",
    "Issues related to the promotion of research and development.\nH.R. 6201, Families First Coronavirus Response Act;\nS. 3548, Coronavirus Aid, Relief, and Economic Security Act or the CARES Act.",
    "Issues related to the promotion of research and development.",
    "Issues related to the promotion of research and development of prescription medications.",
    "Issues related to the promotion of research and development of prescription medications and policies considered for inclusion in Congress Build Back Better proposals.",
    "Issues related to the promotion of research and development of prescription medications and policies considered for inclusion in the Build Back Better Act.",
    "Issues related to the promotion of research and development of prescription medications and policies considered for inclusion in H.R.5376 - Inflation Reduction Act of 2022.",
    "Issues related to the promotion of research and development of prescription medications and policies.",
    "Tracking implementation of prescription drug pricing policies included as part of the Inflation Reduction Act (IRA).",
    "Engagement with Congress on other possible policies that would hinder research and development of new medications.",
    "Policies related to creating incentives for innovation in the life sciences."
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -25,
  "trajectory": "reducing",
  "yearsActive": 6,
  "avgAnnualSpending": 230000,
  "peakYear": 2022,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 2
}