{
  "id": 202189,
  "name": "EXPERIAN NORTH AMERICA",
  "slug": "experian-north-america",
  "state": "DC",
  "description": "Consumer credit reporting agency",
  "totalSpending": 1920000,
  "filings": 32,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 180000
    },
    {
      "year": 2019,
      "income": 180000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 360000
    },
    {
      "year": 2023,
      "income": 300000
    },
    {
      "year": 2024,
      "income": 180000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "FEDERAL HALL POLICY ADVISORS, LLC"
  ],
  "lobbyists": [
    "CLIFFORD ROBERTI",
    "CHRISTOPHER MATTHIESEN",
    "DOUGLAS NAPPI",
    "KAROLINA ARIAS",
    "SAATHVIK ALETY",
    "BRIAN CONLAN"
  ],
  "issues": [
    "CSP",
    "FIN",
    null
  ],
  "sampleDescriptions": [
    "Legislative and regulatory issues relating to information services, privacy, and data security, including implementation of Dodd-Frank Wall Street Reform and Consumer Protection Act. Legislation includes: \nH.R. 10, Financial CHOICE Act of 2017. \nH.R. 4028 - PROTECT Act of 2017\nS. 2155,  Economic Growth, Regulatory Relief, and Consumer Protection Act\n\nAs well as Issues relating to the Credit Repair Organization Act (CROA)",
    "Issues impacting the Fair Credit Reporting Act, data breach notification and privacy.",
    "Issues impacting the Fair Credit Reporting Act, data breach notification and privacy. Legislation includes, H.R. 3618, the Free Credit Scores for Consumers Act of 2019, H.R. 3642, the Improving Credit Reporting for All Consumers Act and H.R. 3629, the Clarity in Credit Score Formation Act of 2019 and  the Accurate Access to Credit Information Act.",
    "Issues impacting the Fair Credit Reporting Act, data breach notification and privacy. Legislation includes, H.R. 3618, the Free Credit Scores for Consumers Act of 2019, H.R. 3642, the Improving Credit Reporting for All Consumers Act and H.R. 3629, the Clarity in Credit Score Formation Act of 2019, the Accurate Access to Credit Information Act; and H.R. 5332, the Protecting Your Credit Score Act..",
    "Issues impacting the Fair Credit Reporting Act, data breach notification and privacy. Legislation includes, H.R. 3618, the Free Credit Scores for Consumers Act of 2019, H.R. 3642, the Improving Credit Reporting for All Consumers Act and H.R. 3629, the Clarity in Credit Score Formation Act of 2019, the Accurate Access to Credit Information Act; and H.R. 5332, the Protecting Your Credit Score Act. Issues related to data suppression or deletion in credit reports.",
    "The Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy. Discussion drafts of the National Credit Reporting Agency Act and the Protecting Your Credit Score Act.",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy. Discussion drafts of the National Credit Reporting Agency Act and the Protecting Your Credit Score Act.",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy. Sections of the House-passed National Defense Authorization Act that amended the Fair Credit Reporting Act.",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy.",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy, and financial services provisions of the House 2023 NDAA bill.",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy, and financial services provisions of the House 2024 NDAA bill. Issues related to H.R. 4198.",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy, and financial services provisions of the House 2024 NDAA bill. Issues related to H.R. 4198",
    "Issues related to the Fair Credit Reporting Act, regulation of consumer reporting bureaus, data breach notification and privacy"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 33,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 240000,
  "peakYear": 2022,
  "lobbyistCount": 6,
  "firmCount": 1,
  "issueCount": 2
}