{
  "id": 182038,
  "name": "FAA MANAGERS ASSOCIATION INC",
  "slug": "faa-managers-association-inc",
  "state": "MO",
  "description": null,
  "totalSpending": 1460000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 210000
    },
    {
      "year": 2019,
      "income": 150000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "THE NORMANDY GROUP, LLC"
  ],
  "lobbyists": [
    "LOUIS DUPART",
    "RONALD ERITANO",
    "ALEX CATANESE",
    "PHILLIP POWELL",
    "SHAWN BLOCH",
    "ALEXANDER PEREZ",
    "KATHERINE SCHMITZ"
  ],
  "issues": [
    "AVI",
    "LBR",
    "GOV",
    "DIS",
    null
  ],
  "sampleDescriptions": [
    "Work on FAA Reauthorization, especially proposals to privatize the FAA",
    "Implementation of PL 114-190 FAA Extension, Safety, and Security Act of 2016, with regard to supervisor staffing for the FAA's air traffic control system. Work with FAA leadership on changes in personnel and employment policies that affect FAA workforce, especially Managers. For example, hiring issues especially pre-employment interviews of air traffic controllers. Follow proposed change at FAA in next FAA Re-authorization such as privatization of air traffic control system. In particular, HR 2997, 21st Century Aviation Innovation Reform and Reauthorization Act.",
    "Work on FAA Reauthorization, especially proposals to privatize the FAA and to require face to face interviews",
    "Implementation of PL 114-190 FAA Extension, Safety, and Security Act of 2016, with regard to supervisor staffing for the FAA's air traffic control system. Work with FAA leadership on changes in personnel and employment policies that affect FAA workforce, especially Managers. For example, hiring issues especially pre-employment interviews of air traffic controllers. Follow proposed changes at FAA in FAA Re-authorization such as privatization of air traffic control system. In particular, HR 2997, 21st Century Aviation Innovation Reform and Reauthorization Act.",
    "Implementation of PL 115-254 FAA Act of 2018, with regard to supervisor staffing for the FAA's air traffic control system. Work with FAA leadership on changes in personnel and employment policies that affect FAA workforce, especially Managers. For example, hiring issues especially pre-employment interviews of air traffic controllers. Follow proposed changes at FAA in FAA Re-authorization such as privatization of air traffic control system.",
    "Work on implementation of FAA Re-authorization, especially proposals to privatize the FAA. Address supervisor supervisor staffing shortage and two year probation for new controllers.",
    "Implementation of PL 115-254 FAA Act of 2018, with regard to supervisor staffing for the FAA's air traffic control system. Work with FAA leadership on changes in personnel and employment policies that affect FAA workforce, especially Managers. For example, hiring issues especially pre-employment interviews of air traffic controllers and FAA disciplinary actions with suspension of 14 days or less. Follow proposed changes at FAA in FAA Re-authorization such as privatization of air traffic control system.",
    "Work on implementation of FAA seek cosponsors for HR 1108 and S 762 The Aviation Funding Stability Act , especially proposals to privatize the FAA. Address supervisor staffing shortage and two year probation for new controllers.",
    "Work to prevent government shutdown and seek cosponsors for HR 1108 and S 762 The Aviation Funding Stability Act , and paid family leave for FAA employees.",
    "Assist with securing information on and implementation of the Congressional response to Covid 19 in the CARES Act and other federal legislation relevant to the Covid 19 Pandemic.",
    "Work to prevent government shutdown and seek cosponsors for HR 1108 and S 762 The Aviation Funding Stability Act , and paid family leave for FAA employees.\n\nFederal Frontline Worker Leave Protection Act, H.R. 6733\nCONTRACT Act, H.R. 5297",
    "Work to prevent government shutdown and seek cosponsors for The Aviation Funding Stability Act, and paid family leave for FAA employees.\n\nFederal Frontline Worker Leave Protection Act\nCONTRACT Act",
    "Work to prevent a government shutdown and seek cosponsors for The Aviation Funding Stability Act, and the Comprehensive Paid Leave for Federal Employees Act.\n\nCONTRACT Act\n\nSupported infrastructure for FAA Facilities.",
    "Work to prevent a government shutdown and seek cosponsors for the Aviation Funding Stability Act, and the Comprehensive Paid Leave for Federal Employees Act.\n\nCONTRACT Act\n\nSupported infrastructure for FAA Facilities.",
    "Work to prevent a government shutdown and seek cosponsors for the Aviation Funding Stability Act, and the Comprehensive Paid Leave for Federal Employees Act. CONTRACT Act Supported infrastructure for FAA Facilities.",
    "FAA Reauthorization Bill Work to prevent a government shutdown and seek cosponsors for the Aviation Funding Stability Act, and the Comprehensive Paid Leave for Federal Employees Act. Supported infrastructure for FAA Facilities and future updates",
    "FAA Reauthorization Bill Work to prevent a government shutdown Supported infrastructure for FAA Facilities and future updates",
    "FAA Reauthorization Bill Work to prevent a government shutdown Supported infrastructure for FAA Facilities and future updates Passage of Social Security Fairness Act",
    "FAA Reauthoriztaion Bill Implementation Work to prevent governemnt shut down WH Executive Orders",
    "Reconiliation Bill Provisions Work to prevent governemnt shut down WH Executive Orders"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -29,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 182500,
  "peakYear": 2018,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 4
}