{"id":199124,"name":"FEDERATION OF AMERICAN HOSPITALS","slug":"federation-of-american-hospitals","state":"DC","description":"Hospital Trade Association","totalSpending":1810000,"filings":23,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":240000},{"year":2020,"income":320000},{"year":2021,"income":320000},{"year":2022,"income":320000},{"year":2023,"income":290000}],"firms":["FIERCE GOVERNMENT RELATIONS"],"lobbyists":["WILLIAM BLALOCK","MICHAEL CHAPPELL","KIRSTEN CHADWICK","ALEIX JARVIS","KATE HULL","WILLIAM PIPER","TYLER STEPHENS","ERIC ZULKOSKY"],"issues":["MMM","HCR",null],"sampleDescriptions":["Hospital Payment Issues, Medicaid DSH, Extension of Policies in the Medicare Access and CHIP Reauthorization Act of 2015, Self-referral to physician owned hospitals","Hospital Payment Issues, Self-referral to physician owned hospitals, H.R. 1156- Patient Access to Higher Quality Health Care Act of 2017","Medicare Expansion, H.R. 1156- Patient Access to Higher Quality Health Care Act of 2017, S. 1133- Patient Access to Higher Quality Health Care Act of 2017","Nurse Loan Repayment Program, Universal Service Rural Health Care Program","Issues related to Medical Billing, Physician Owned Hospitals, Issues related to Medicare and Medicaid hospital reimbursements","Issues related to Medical Billing, Physician Owned Hospitals, Issues related to Medicare and Medicaid hospital reimbursements, Medicare for All, H.R.506 - Hospital Competition Act of 2019","Nurse Loan Repayment Program, State of the Hospital Industry","Issues related to Medicare and Medicaid hospital reimbursements, S. 1895- Lower Health Care Costs Act, General Hospital Industry Issues, H.R.4378, Continuing Appropriations Act, 2020, and Health Extenders Act of 2019","Issues related to Medicare and Medicaid hospital reimbursements, S. 1895- Lower Health Care Costs Act, H.R. 1865- Further Consolidated Appropriations Act, 2020, H.R. 3055- Further Continuing Appropriations Act, 2020, and Further Health Extenders Act of 2019, H.R 728- Title VIII Nursing Workforce Reauthorization Act of 2019","Issues related to Medicare and Medicaid hospital reimbursements, H.R. 6074- Coronavirus Preparedness and Response Supplemental Appropriations Act, 2020, H.R. 748- CARES Act, Medicaid Fiscal Accountability Regulation, COVID-19 Response Efforts, CARES Act Implementation, H.R. 6201- Families First Coronavirus Response Act","COVID-19 Response Efforts, CARES Act Implementation, H.R. 266- Paycheck Protection Program and Health Care Enhancement Act, Issues related to the Provider Relief Fund","COVID-19 Response Efforts, CARES Act Implementation, Issues related to the Provider Relief Fund, COVID-19 Liability Protections, Medicare Accelerated and Advanced Payment Programs, Monitoring Debate on Surprise Medical Billing, H.R. 8337- Continuing Appropriations Act, 2021 and Other Extensions Act","CARES Act Implementation, Issues related to the Provider Relief Fund, COVID-19 Liability Protections, Monitoring Debate on Surprise Medical Billing, Nurse Loan Repayment Program, Medicare Sequester, COVID-19 Relief","Medicare Sequester, H.R.315 - To amend the Coronavirus Aid, Relief, and Economic Security Act to extend the temporary suspension of Medicare sequestration, and for other purposes, S.748 - Medicare Sequester Relief Act, H.R.1319 - American Rescue Plan Act of 2021","Medicare Sequester, General Hospital Industry Issues, Post Acute Care Payment Issues, Provider Relief Fund","Medicare Sequester, General Hospital Industry Issues, Provider Relief Fund, False Claims Act, General Medicare Payment Issues, H.R.3684 - Infrastructure Investment and Jobs Act","Medicare Sequester, PayGo, Provider Relief Fund, False Claims Act, General Medicare Payment Issues","Medicare Sequester, Health Workforce Issues, Medical Debt","Medicare Sequester, Health Workforce Issues, Provider Medicare Reimbursements, ACA Premium Subsidies","Medicare Sequester, Provider Medicare Reimbursements, FY2023 Inpatient Prospective Payment System (IPPS) Proposed Rule, Physician Owned Hospitals, Medicare Low Volume Hospitals and Medicare Dependent Hospitals Extenders, Medicare inpatient rehabilitation facility (IRF) Review Choice Demonstration (RCD), H.R.6833 - Making continuing appropriations for fiscal year 2023, and for other purposes"],"years":[2018,2019,2020,2021,2022,2023]}