{
  "id": 202253,
  "name": "FINANCIAL DATA AND TECHNOLOGY ASSOCIATION, FORMERLY FIN'L DATA & TECH'Y ASS'N NA",
  "slug": "financial-data-and-technology-association-formerly-fin-l-data-tech-y-ass-n-na",
  "state": null,
  "description": "Trade association of North American financial technology firms.",
  "totalSpending": 1639000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 80000
    },
    {
      "year": 2019,
      "income": 120000
    },
    {
      "year": 2020,
      "income": 160000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 160000
    },
    {
      "year": 2023,
      "income": 315000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 414000
    }
  ],
  "firms": [
    "ALLON ADVOCACY, LLC"
  ],
  "lobbyists": [
    "STEVEN BOMS",
    "REBECCA MULHOLLAND",
    "KATHERINE FLOCKEN",
    "LAINE WILLIAMS"
  ],
  "issues": [
    "BAN",
    "CPI",
    "SMB",
    "FIN",
    null
  ],
  "sampleDescriptions": [
    "Issues related to implementation of open banking standards in the United States.",
    "Issues related to open data access, consumer privacy standards, implementation of GDPR in Europe",
    "Issues related to consumer financial data access, implementation of Open Banking, and national bank third-party risk management.",
    "Issues related to open data access, consumer privacy standards, implementation of GDPR and PSD2 in Europe",
    "Data security and data privacy issues regarding consumer financial transaction data",
    "Implementation of an open banking regime in the United States; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the Fair Credit Reporting Act on consumer-permissioned financial transaction data",
    "Implementation of an open banking regime in the United States; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the Fair Credit Reporting Act on consumer-permissioned financial transaction data; H.R. 6789 in the 115th Congress.",
    "Implementation of an open banking regime in the United States; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the Fair Credit Reporting Act on consumer-permissioned financial transaction data; H.R. 4047 in the 116th Congress.",
    "H.R. 748, The CARES Act; issues related to the role of financial technology as critical infrastructure to support small business funding under the Paycheck Protection Program during the COVID-19 health crisis (PL 116-136 and PL 116-123)",
    "Implementation of an open banking regime in the U.S.; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the FCRA on consumer-permissioned financial transaction data; H.R. 4047 - Open Banking Study Act of 2019 (116th Congress); H.R. 266 - Paycheck Protection Program and Health Care Enhancement Act (PL 116-139)",
    "S. 4116 - a bill to extend the authority for commitments for the paycheck protection program and separate amounts authorized for other loans under section 7(a) of the Small Business Act, and for other purposes (PL 116-147); H.R. 7010 - Paycheck Protection Program Flexibility Act of 2020 (PL 116-142); issues related to the role of financial technology as critical infrastructure to support small business funding under the Paycheck Protection Program, during the COVID-19 health crisis (PL 116-136 and PL 116-123)",
    "Implementation of an open banking regime in the U.S.; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the FCRA on consumer-permissioned financial transaction data; H.R. 4047 - Open Banking Study Act of 2019 (116th Congress); H.R. 6800 - The Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act; Section 1033 of the Dodd-Frank Wall Street Reform and C0nsumer Protection Act (PL 111-203)",
    "Access to consumer permissioned financial electronic records; third-party bank vendor risk management guidance; implementation of Open Banking regime in the U.S.",
    "Implementation of an open banking regime in the US; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the FCRA on consumer-permissioned financial transaction data; H.R. 4047 - Open Banking Study Act of 2019 (116th Congress); H.R. 6800 - The Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act; H.R. 133 - Consolidated Appropriations Act of 2021 (PL 116-260); ANPR implementing Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act (PL 111-203); S. 3548 - Coronavirus Aid, Relief, and Economic Security (CARES) Act",
    "Issues related to extending the authority for commitments for the Paycheck Protection Program and separate amounts authorized for other loans under section 7(a) of the Small Business Act (PL 116-147); H.R. 7010 - Paycheck Protection Program Flexibility Act of 2020 (PL 116-142); issues related to the role of financial technology as critical infrastructure to support small business funding under the Paycheck Protection Program, during the COVID-19 health crisis (PL 116-136 and PL 116-123)",
    "Access to consumer permissioned financial electronic records; third-party bank vendor risk management guidance; implementation of open finance regime in the U.S.",
    "Implementation of an open banking regime in the US; application of existing regulatory structure, including Regulation E, on consumer-permissioned aggregation; application of the FCRA on consumer-permissioned financial transaction data; OCC third-party vendor risk management FAQs; issues related to Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act (PL 111-203).",
    "Issues related to extending the authority for commitments for the Paycheck Protection Program and separate amounts authorized for other loans under section 7(a) of the Small Business Act (PL 116-147); issues related to the role of financial technology as critical infrastructure to support small business funding under the Paycheck Protection Program, during the COVID-19 health crisis (PL 116-136 and PL 116-123).",
    "Data security and data privacy issues regarding consumer financial transaction data.",
    "Implementation of an open banking regime in the US; Application of existing regulatory structure, including Regulation E, on consumer-permissioned data aggregation; bank third-party vendor risk management; Issues related to Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act (PL 111-203)."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 418,
  "trajectory": "exploding",
  "yearsActive": 8,
  "avgAnnualSpending": 204875,
  "peakYear": 2025,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 4,
  "industry": "technology"
}