{"id":209888,"name":"FIRST SOLAR INC.","slug":"first-solar-inc","state":"AZ","description":"&#226;€‹Solar panel manufacturing and R&D","totalSpending":1390000,"filings":15,"yearlySpending":[{"year":2021,"income":470000},{"year":2022,"income":270000},{"year":2023,"income":360000},{"year":2024,"income":290000}],"firms":["COGENT STRATEGIES LLC"],"lobbyists":["RANDALL GERARD","ANDREW KAUDERS","CLAUDIA JAMES","DAVID ADAMS","EDDA COLLINS COLEMAN"],"issues":["TRD","TRA","TAX","ENG",null],"sampleDescriptions":["- Issues related to Section 201 and 301 tariffs on solar panels\n- Issues related to domestic manufacturing tax credits and US solar manufacturing and Buy America.","- Issues related to domestic manufacturing tax credits\n- S. 2140/H.R.5423 - Solar Energy Manufacturing for America Act\n- S.2118, Clean Energy for America Act","- Issues related to US solar manufacturing\n- S. 2140/H.R.5423 - Solar Energy Manufacturing for America Act","- Issues related to tariffs on solar panels\n- Issues related to US solar manufacturing and Buy America\n- Issues related to forced labor with respect to Chinese solar panel manufacturing\n- S. 2140/H.R.5423 - Solar Energy Manufacturing for America Act","- Issues related to US solar manufacturing","- Issues related to domestic manufacturing tax credits - S. 2140, Solar Energy Manufacturing for America Act - S.2118, Clean Energy for America Act","- Issues related to tariffs on solar panels - Issues related to US solar manufacturing and Buy America - Issues related to forced labor with respect to Chinese solar panel manufacturing","- Issues related to US solar manufacturing - S. 2140/H.R.5423 - Solar Energy Manufacturing for America Act","- Issues related to domestic manufacturing tax credits - S. 2140/H.R.5423 - Solar Energy Manufacturing for America Act - S.2118, Clean Energy for America Act","- Issues related to tariffs on solar panels - Issues related to US solar manufacturing and Buy America - Issues related to forced labor with respect to Chinese solar panel manufacturing - S. 2140/H.R.5423 - Solar Energy Manufacturing for America Act","- Issues related to tariffs on solar panels - Issues related to US solar manufacturing and Buy America - Issues related to forced labor with respect to Chinese solar panel manufacturing - Issues related to HR 5376, Inflation Reduction Act of 2022","- Issues related to US solar manufacturing - Implementation of HR 5376, Inflation Reduction Act of 2022","- Issues related to domestic manufacturing tax credits - Implementation of HR 5376, Inflation Reduction Act of 2022"],"years":[2021,2022,2023,2024]}