{"id":184871,"name":"FITBIT LLC","slug":"fitbit-llc","state":"CA","description":"Health and fitness device company","totalSpending":1700000,"filings":13,"yearlySpending":[{"year":2018,"income":330000},{"year":2019,"income":410000},{"year":2020,"income":800000},{"year":2021,"income":160000}],"firms":["INVARIANT LLC"],"lobbyists":["HEATHER PODESTA","BENJAMIN KLEIN","ROBERT HOFFMAN","ANNE PALISI","KATHRYN WISE","ANNABELL STOKES","CHRISTOPHER GILLOTT","NICK MIKULA"],"issues":["HCR","TRD","CPI","LBR","DEF"],"sampleDescriptions":["Educate policymakers about company initiatives and benefits of wearable fitness technology; monitor S. 482 / H.R. 1267, the Personal Health Investment Today Act; and discuss issues related to troop readiness.","Educate policymakers about company initiatives and benefits of wearable fitness technology; monitor S. 482 / H.R. 1267, the Personal Health Investment Today Act, and H.R. 5138, the Bipartisan HSA Improvement Act of 2018.","Discuss impact of proposed Section 301 tariffs.","Monitor Section 301 tariffs and U.S.-China trade policy.","Working to remove smartwatches and wearables from Section 301 tariffs and monitor U.S.-China trade policy generally.","Educate policymakers about company initiatives and benefits of wearable fitness technology; monitor S. 12, the Health Savings Act of 2019.","Educate policymakers about company initiatives and benefits of wearable fitness technology.","Monitor issues related to privacy legislation as it relates to wearable devices.","Educate policymakers about company initiatives and benefits of wearable fitness technology; discuss use of aggregated data for public health monitoring.","Provide background information on the Google-Fitbit transaction.","Educate policymakers about company initiatives on COVID-19 and benefits of wearable fitness technology; discuss use of aggregated data for public health monitoring.","Monitor antitrust issues.","Encourage support for a comprehensive Department of Defense approach to wearable health trackers.","Monitor issues related to privacy legislation as is relates to wearable devices.","Educate policymakers about company initiatives on benefits of wearable fitness technology; discuss use of aggregated data for public health monitoring.","Monitor issues related to privacy legislation as is relates to wearable devices, including related provisions in H.R.4350/S.1605 National Defense Authorization Act.","Educate policymakers on benefits of wearable fitness technology; discuss use of aggregated data for public health monitoring."],"years":[2018,2019,2020,2021]}