{
  "id": 167855,
  "name": "FLORIDA SUGAR CANE LEAGUE",
  "slug": "florida-sugar-cane-league",
  "state": "DC",
  "description": null,
  "totalSpending": 1500000,
  "filings": 32,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 160000
    },
    {
      "year": 2019,
      "income": 160000
    },
    {
      "year": 2020,
      "income": 130000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 250000
    }
  ],
  "firms": [
    "CORNERSTONE GOVERNMENT AFFAIRS, INC."
  ],
  "lobbyists": [
    "THOMAS SHIPMAN",
    "LAVERNE HUBERT",
    "JAMES RICHARDS",
    "FRED CLARK",
    "PRESCOTT MARTIN"
  ],
  "issues": [
    "BUD",
    "AGR",
    null
  ],
  "sampleDescriptions": [
    "Agriculture Appropriations - Agriculture Research Service",
    "Administration of the commodity program for sugar under the Agriculture Act of 2014 (P.L. 113-79) and reauthorization of the 2018 Farm Bill",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018",
    "Agriculture appropriations - agriculture research service",
    "Implementation of PL 117-103 FY2022 Consolidated Appropriations Act, development of FY 23 Agriculture, Rural Development, Food and Drug Administration and Related Agencies Appropriations Act",
    "Implementation of PL 117-103 FY 2022 Consolidated Appropriations Act, HR 8239, HR 8294, S 4661 FY 2023 Agriculture Appropriations Act",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018.",
    "implementation of PL 117-328 Consolidated Appropriations Act, 2023, Consolidated Appropriations Act; HR 4368 and S 2131 FY 24 Agriculture Appropriations Act",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018; FY 25 Agriculture Appropriations",
    "implementation of PL 117-328 Consolidated Appropriations Act, 2023, Consolidated Appropriations Act; HR 4368 and S 2131 FY 24 Agriculture Appropriations Act; FY 25 Agriculture Appropriations",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018; FY 25 Agriculture Appropriations; HR 8467, Farm, Food and National Security Act of 2024",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018 and related laws; reauthorization of these authorities under an omnibus farm bill; HR 9027 and S 4690 FY 25 Agriculture appropriations and HR 1968, FY 25 Full-year Continuing Appropriations and Extensions Act.",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018 and related laws; reauthorization of these authorities under an omnibus farm bill; HR 9027 and S 4690 FY 25 Agriculture appropriations and HR 1968, FY 25 Full-year Continuing Appropriations and Extensions Act; HR 1 One Big Beautiful Bill Act.",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018 and related laws; reauthorization of these authorities under an omnibus farm bill; HR 9027 and S 4690 FY 25 Agriculture appropriations and HR 1968, FY 25 Full-year Continuing Appropriations and Extensions Act; HR 4121 FY 26 Agriculture Appropriations Act.",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018 and related laws; reauthorization of these authorities under an omnibus farm bill; H.R. 9027 and S. 4690 FY 25 Agriculture appropriations and H.R. 1968, FY 25 Full-year Continuing Appropriations and Extensions Act; H.R. 1 One Big Beautiful Bill Act; H.R. 4121/S. 2256, FY 26 Agriculture Appropriations.",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018 and related laws; reauthorization of these authorities under an omnibus farm bill; HR 9027 and S 4690 FY 25 Agriculture appropriations and HR 1968, FY 25 Full-year Continuing Appropriations and Extensions Act; HR 4121 FY 26 Agriculture Appropriations Act; S. 2256.",
    "Administration of the commodity program for sugar under the Agriculture Improvement Act of 2018 and related laws; reauthorization of these authorities under an omnibus farm bill; Implementation of P.L. 119-4 Full-Year Continuing Appropriations and Extensions Act; H.R. 1 One Big Beautiful Bill Act; H.R. 4121/S. 2256, FY 26 Agriculture Appropriations."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 56,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 187500,
  "peakYear": 2025,
  "lobbyistCount": 5,
  "firmCount": 1,
  "issueCount": 2
}