{"id":208409,"name":"FOOD AND AGRICULTURE CLIMATE ALLIANCE","slug":"food-and-agriculture-climate-alliance","state":"VA","description":"Agriculture coalition","totalSpending":1800000,"filings":20,"yearlySpending":[{"year":2021,"income":270000},{"year":2022,"income":360000},{"year":2023,"income":360000},{"year":2024,"income":450000},{"year":2025,"income":360000}],"firms":["THE RUSSELL GROUP, INC."],"lobbyists":["RANDALL RUSSELL","ANDREW HARKER","KARLA THIEMAN","SAMANTHA BUCHALTER","JESSICA SCHULKEN","ASHLEE JOHNSON","KATE THOMPSON"],"issues":["AGR",null,"ENV"],"sampleDescriptions":["Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; S.1251 - Growing Climate Solutions Act of 2021, FY22 appropriations.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; S.1251 - Growing Climate Solutions Act of 2021, FY23 appropriations.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; S.1251 - Growing Climate Solutions Act of 2021, FY2023 Omnibus Appropriations bill; H.R.2606 - SUSTAINS Act.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; farm bill.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; and H.R.8467 - Farm, Food, and National Security Act of 2024.","Issues related to FY25 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act; and issues related to FY25 Interior, Environment, and Related Agencies Appropriations Act.","H.R.9027/S. 4690 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2025; and H.R. 8998/S. 4842 Interior, Environment, and Related Agencies Appropriations Act, 2025.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; and issues pertaining to the Farm Bill.","Issues related to Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act; and issues related to Interior, Environment, and Related Agencies Appropriations Act.","Issues pertaining to climate and its impact in the agriculture, food, and forestry sectors; issues pertaining to the Farm Bill; issues related to Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act; and issues related to Interior, Environment, and Related Agencies Appropriations Act."],"years":[2021,2022,2023,2024,2025]}