{"id":172588,"name":"FREEDOM MORTGAGE CORPORATION","slug":"freedom-mortgage-corporation","state":"NJ","description":"Mortgage lender","totalSpending":1850000,"filings":26,"yearlySpending":[{"year":2019,"income":180000},{"year":2020,"income":270000},{"year":2021,"income":280000},{"year":2022,"income":400000},{"year":2024,"income":400000},{"year":2025,"income":320000}],"firms":["RICH FEUER ANDERSON"],"lobbyists":["JOHN ANDERSON","THOMAS KOONCE","JARED SAWYER","AMANDA SLATER","ANDREW PALMER","MITCHELL FEUER","JAE JANG","RASHAWN MITCHELL","JENNIFER RUST","TIANA LYEW"],"issues":["BAN","HOU","TAX","VET","FIN"],"sampleDescriptions":["Legislative and regulatory issues affecting nonbank mortgage lenders. Legislative and regulatory issues related to housing finance reform","Legislative and regulatory issues affecting nonbank mortgage lenders.  Legislative and regulatory issues related to housing finance reform.","Legislative and regulatory issues affecting nonbank mortgage lenders.  Legislative and regulatory issues related to housing finance reform, including proposed regulations to amend the ability to repay rule and qualified mortgage rule.","Legislative and regulatory issues affecting nonbank mortgage lenders, including H.R. 748, the \"CARES Act.\"  Legislative and regulatory issues related to housing finance reform, including proposed regulations to amend the ability to repay rule and qualified mortgage rule.","Legislative and regulatory issues affecting nonbank mortgage lenders,including H.R.748, the \"CARES Act.\"  Legislative and regulatory issues related to housing finance reform, including proposed regulations to amend the ability to repay rule and qualified mortgage rule.","Legislative and regulatory issues affecting nonbank mortgage lenders, including implementation of H.R. 748, the \"Coronavirus Aid, Relief, and Economic Security Act.\"  Legislative and regulatory issues related to housing finance reform, including proposed regulations to amend the ability to repay rule and qualified mortgage rule.","Legislative and regulatory issues affecting nonbank mortgage lenders,including implementation of H.R.748, the \"Coronavirus Aid, Relief, and Economic Security Act.\"  Legislative and regulatory issues related to housing finance reform, including proposed regulations to amend the ability to repay rule and qualified mortgage rule.","Legislative and regulatory issues affecting nonbank mortgage lenders,including implementation of H.R.748, the \"Coronavirus Aid, Relief, and Economic Security Act,\" and H.R.8900, the \"Further Continuing Appropriations Act, 2021.\"  Legislative and regulatory issues related to housing finance reform and FHA program, including proposed regulations to amend the ability to repay rule and qualified mortgage rule.","Legislative and regulatory issues affecting nonbank mortgage lenders, including implementation of H.R. 748, the \"Coronavirus Aid, Relief, and Economic Security Act,\" and H.R. 8900, the \"Further Continuing Appropriations Act, 2021.\"  Legislative and regulatory issues related to housing finance reform and FHA program, including proposed regulations to amend the \"ability to repay\" rule and qualified mortgage rule.","Tax proposals affecting mortgage servicers, including proposals related to a minimum tax on book income.","Legislative and regulatory issues affecting nonbank mortgage lenders, including implementation of H.R. 748, the \"Coronavirus Aid, Relief, and Economic Security Act.\"  Legislative and regulatory issues related to housing finance reform and FHA program, including legislation expanding down payment assistance opportunities.","Legislation and regulations affecting the VA mortgage lending program including issues related to forbearance and refinance policy.","Legislative and regulatory issues affecting nonbank mortgage lenders, including implementation of H.R. 748, the \"Coronavirus Aid, Relief, and Economic Security Act.\"   Legislative and regulatory issues related to housing finance reform and FHA program, including legislation expanding down payment assistance opportunities.","Legislative and regulatory issues affecting nonbank mortgage lenders, including implementation of H.R. 748, the \"Coronavirus Aid, Relief, and Economic Security Act.\" Legislative and regulatory issues related to housing finance reform and FHA program, including legislation expanding down payment assistance opportunities.","Legislation and regulations affecting the VA mortgage lending program including issues related to forbearance, appraisal, and refinance policy.","Legislative and regulatory issues affecting nonbank mortgage lenders. Legislative and regulatory issues related to housing finance reform and FHA program, including legislation expanding down payment assistance opportunities.","Legislative and regulatory issues affecting nonbank mortgage lenders. Legislative and regulatory issues related to housing finance reform and FHA program, including legislation expanding down payment assistance opportunities. Legislation and regulations affecting the Federal Loan Bank System.","Legislative and regulatory issues affecting nonbank mortgage lenders. S. 3502, Homebuyers Privacy Protection Act.","Legislation and regulations affecting the VA mortgage lending program including issues related to forbearance, appraisal, and loss mitigation options.","Legislative and regulatory issues affecting nonbank mortgage lenders. Legislation affecting trigger leads."],"years":[2019,2020,2021,2022,2024,2025]}