{"id":125570,"name":"FRONT LINE HOSPITAL ALLIANCE","slug":"front-line-hospital-alliance","state":"CO","description":"Joint advocacy ad hoc coalition","totalSpending":1940000,"filings":18,"yearlySpending":[{"year":2019,"income":400000},{"year":2020,"income":480000},{"year":2021,"income":360000},{"year":2022,"income":360000},{"year":2024,"income":40000},{"year":2025,"income":300000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["LISA HAWKE","MIRANDA FRANCO","ROBERT BRADNER","KARL KOCH","THOMAS REYNOLDS","ETHAN JORGENSEN-EARP","SCOTT MASON","SHAWNA FRANCIS WATLEY","JIM DAVIS","RONALD KLEIN","TODD WOOTEN","DEVIN BARRETT","ABIGAIL HEMENWAY","ED PERLMUTTER","ALISON WRIGHT","PARKER REYNOLDS","JORDAN BROSSI","LARRY BUCSHON"],"issues":["HCR","MMM"],"sampleDescriptions":["Pursue demonstration program and modernization of payment streams under Medicare & Medicaid; Pursue pilot program for drug discounts for front line hospitals.","Pursue demonstration program and modernization of payment streams under Medicare & Medicaid; Pursue pilot program for drug discounts for front line hospitals; Pursue reauthorization of community care collaborative program and designation of front line  hospitals in federal law.","Issues related to demonstration program of super-safety-net hospitals; issues related to statutory recognition of super-safety net hospitals and Medicaid and Medicare funding for disproportionate share hospitals; issues related to COVID-19 pandemic including funding for super-safety hospitals from the Provider Relief Fund.","Advocacy for modern safety-net payment model for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals; issues related to COVID-19 pandemic including Provider relief funding for deemed DSH hospitals and other high Medicaid providers; funding for infrastructure projects for front line hospitals under Hill Burton.","Advocacy for modern safety-net payment model for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals; issues related to COVID-19 pandemic including Provider relief funding for deemed DSH hospitals and other high Medicaid providers.","Advocacy for modern safety-net payment model for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals; issues related to COVID-19 pandemic including Provider relief funding for deemed DSH hospitals and other high Medicaid providers; funding for infrastructure projects for front line hospitals under Hill Burton; funding of graduate medical education in Build Back Better Act.","Advocacy for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals and the definition of Medicaid shortfall; demonstration program on physical and mental health comorbidities.","Advocacy for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals (H.R. 7327); demonstration program on physical and mental health comorbidities (S.3450); transparency issues related to 340B Drug Discount Program, Medicaid managed care funding for 340B hospitals.","Advocacy for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals (H.R. 7327); demonstration program on physical and mental health comorbidities (S.3450); transparency issues and modernization related to 340B Drug Discount Program; Medicaid and other provisions in H.R. 1 - the One Big Beautiful Bill Act.","Advocacy for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals (H.R. 7327); demonstration program on physical and mental health comorbidities (S.3450); transparency issues related to 340B Drug Discount Program, site neutral legislation affecting front line hospitals; Medicaid and other provisions in H.R. 1 - the One Big Beautiful Bill Act.","Advocacy for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals (H.R. 7327); transparency issues and modernization related to 340B Drug Discount Program; support Health Safety-Net Fund for high need hospitals.","Advocacy for front line hospitals; statutory recognition of front line hospitals and Medicaid and Medicare funding for disproportionate share hospitals (H.R. 7327); site neutral legislation affecting front line hospitals."],"years":[2019,2020,2021,2022,2024,2025]}