{
  "id": 186701,
  "name": "FUELS AMERICA",
  "slug": "fuels-america",
  "state": "DC",
  "description": "Promote benefits of renewable fuel and the Renewable Fuel Standard.",
  "totalSpending": 2990000,
  "filings": 32,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 280000
    },
    {
      "year": 2019,
      "income": 350000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 180000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 250000
    }
  ],
  "firms": [
    "KOUNTOUPES DENHAM CARR & REID, LLC"
  ],
  "lobbyists": [
    "JULIE CARR",
    "MARY REID",
    "ROSE SULLIVAN (LISTED IN ERROR)",
    "DAVID PELUSO",
    "LISA KOUNTOUPES",
    "MJ KENNY",
    "ADAM HECHAVARRIA",
    "DENISE MOUSOURIS",
    "MARY BEAL",
    "DENISE NORTHRUP"
  ],
  "issues": [
    "ENG",
    "TRA",
    "TAX",
    null,
    "DEF",
    "AGR"
  ],
  "sampleDescriptions": [
    "Issues related to the Renewable Fuel Standard (RFS) including point of obligation, proposals to cap renewable identification number (RIN)s, proposals change octane standards, and H. R. 5212/S.2519 - the GREENER Fuels Act and S.517 - Consumer and Fuel Retailer Choice Act.",
    "Issues related to the Renewable Fuel Standard (RFS) including point of obligation, proposals to cap renewable identification number (RIN)s, proposals change octane standards, and H. R. 5212/S.2519 - the GREENER Fuels Act and S.517 - Consumer and Fuel Retailer Choice Act, and discussion draft H.R. _ the 21st Century Transportation Fuels Act.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers, regulations regarding Reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers, regulations regarding Reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).  H. R. 3006, Renewable Fuel Standard Integrity Act of 2019 and S.1840, A bill to establish certain requirements for the small refineries exemption of the renewable fuels provisions under the Clean Air Act, and for other purposes.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).  H. R. 3006, Renewable Fuel Standard Integrity Act of 2019 and S.1840, A bill to establish certain requirements for the small refineries exemption of the renewable fuels provisions, and for other purposes.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).  H. R. 3006, Renewable Fuel Standard Integrity Act of 2019 and S.1840, A bill to establish certain requirements for the small refineries exemption of the renewable fuels provisions, and for other purposes.  H. R. 1865, Further Consolidated Appropriations Act, 2020.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).  H. R. 3006, Renewable Fuel Standard Integrity Act of 2019 and S.1840, A bill to establish certain requirements for the small refineries exemption of the renewable fuels provisions, and for other purposes.  Issues related to the role of biofuels in addressing climate change.",
    "Issues related to transportation fuel infrastructure in H.R. 2, INVEST in America Act (Moving Forward Act).",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs). Issues related to the role of biofuels in addressing climate change.  H.R. 6800, The Health and Economic Recovery Omnibus Emergency Solutions Act (HEROES Act), including relief for biofuels sector.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs). Issues related to the role of biofuels in addressing climate change.  Issues related to small refinery exemptions in the Clean Economy Jobs and Innovation Act (H.R. 4447).  Renewable Fuel Feedstock Reimbursement Act of 2020 (S.3756).",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs). Issues related to the role of biofuels in addressing climate change.  Issues related to small refinery exemptions in the Clean Economy Jobs and Innovation Act (H.R. 4447).  Renewable Fuel Feedstock Reimbursement Act of 2020 (S.3756).  Issues related to H.R. 133, Consolidated Appropriations Act for Fiscal Year 2021.",
    "Issues related to the deployment of fueling infrastructure for higher blends of biofuels.  Renewable Fuel Infrastructure Investment and Market Expansion Act of 2021 (S.227/H.R. 1542).",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).  Issues related to the role of biofuels in addressing climate change.  Issues related to the inclusion of biofuels in the U. S. Nationally Determined Contributions, Renewable Fuel Standard Integrity Act of 2021 (H.R. 1113).",
    "Issues related to the deployment of fueling infrastructure for higher blends of biofuels.  Renewable Fuel Infrastructure Investment and Market Expansion Act of 2021 (S.227/H.R. 1542).  Issues related to Biofuel Infrastructure and Agricultural Product Market Expansion Act.",
    "Issues related to tax credits impacting the biofuels industry, including H.R.4254/S.2262, the Low Carbon Biofuel Credit Act and S.2267, a bill to amend the Internal Revenue Code of 1986 to provide a tax credit for the production of flexible fuel vehicles, and to amend title 49, United States Code to restore certain flexible fuel vehicle credits.",
    "Issues related to the deployment of fueling infrastructure for higher blends of biofuels. Issues related to Biofuel Infrastructure and Agricultural Product Market Expansion Act.  Issues related to the deployment of fueling infrastructure for higher blends of biofuels in the FY2022 budget reconciliation process.",
    "Issues related to tax credits impacting the biofuels industry, including H.R.4254/S.2262, the Low Carbon Biofuel Credit Act and S.2267, a bill to amend the Internal Revenue Code of 1986 to provide a tax credit for the production of flexible fuel vehicles, and to amend title 49, United States Code to restore certain flexible fuel vehicle credits, and issues related to extending the biodiesel tax credit, and providing incentives for the deployment of biofuels as part of the FY2022 budget reconciliation process.  Issues related to sustainable aviation fuel (SAF), including H.R. 3440/S.2263, the Sustainable Skies Act and SAF  provisions in the FY 2022 budget reconciliation process.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and proposals to regulate renewable identification numbers (RINs).  Issues related to the role of biofuels in addressing climate change.  Issues related to sustainable aviation fuel in H.R. 4350, the National Defense Authorization Act for Fiscal Year 2022.",
    "Issues related to the Renewable Fuel Standard (RFS) including, small refinery waivers regulations on the annual renewable volume obligations, regulations regarding reid vapor pressure (RVP), and issues related to renewable identification numbers (RINS).  Issues related to the role of biofuels in addressing climate change.  Issues related to sustainable aviation fuel.",
    "Issues related to the deployment of fueling infrastructure for higher blends of biofuels. Issues related to the deployment of fueling infrastructure for higher blends of biofuels in the FY2022 budget reconciliation process."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -11,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 252500,
  "peakYear": 2019,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 5
}