{"id":199309,"name":"GE AEROSPACE","slug":"ge-aerospace","state":"CT","description":"Global infrastructure, healthcare and financial services company","totalSpending":2090000,"filings":30,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":270000},{"year":2022,"income":270000},{"year":2023,"income":540000},{"year":2024,"income":150000},{"year":2025,"income":200000}],"firms":["HARBINGER STRATEGIES, LLC"],"lobbyists":["MANNY ROSSMAN","STEVE STOMBRES","KYLE NEVINS","JOHN O'NEILL","JONATHAN SLEMROD","PARKER POLING","JOHN LEGANSKI"],"issues":["FIN","TRD","TAX","DEF","AVI",null,"BUD"],"sampleDescriptions":["Issues related to the Export-Import Bank.","Issues related to Committee on Foreign Investment in the US.","H.R.1, Tax Reform Act of 2017 (Public Law No. 115-97) - Issues related to tax reform.","Issues related to trade and investment in the US.","National Defense Authorization Act for FY2020 including Improved Turbine Engine Program (ITEP).","H.R.1, Tax Reform Act of 2017 (Public Law No. 115-97) - Issues related to tax reform. Medical Devise Excise Tax. Tax Extender legislation.","S. 3548, CARES Act.","Implementation of P.L. 115-97, tax reform legislation.  Tax extender legislation.","Issues relating to the National Defense Authorization Act for FY2021.","Issues related to the Export-Import Bank. Pension funding.","Corporate tax reform implementation. Renewable Energy Standards (including Section 45 PTC).  Taxation of international operations. Pensions.","Corporate tax reform. Taxation of International Operations.","Issues relating to the National Defense Authorization Act for FY2022.","Issues relating to the National Defense Authorization Act for FY2022. Issues related to military engine and component programs. Issues related to defense appropriations, FY22.","Corporate tax reform. Taxation of International Operations.  Issues related to Corporate Tax Reform.","Corporate tax reform. Taxation of International Operations. Issues related to Corporate Tax Reform.","Taxation of International Operations. Issues related to Corporate Tax Reform. HR 5376, Inflation Reduction Act of 2022. Tax extender legislation.","Issues related to trade and investment in the US. Issues related to CFIUS (Committee on Foreign Investment in the U.S.).","Issues relating to the National Defense Authorization Act for FY2023. Issues related to military engine and component programs. Issues related to defense appropriations, FY23.","The FY2025 Department of Defense Appropriations Act (No Bill Number): Issues related to the funding of military engine and component programs."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}