{"id":194272,"name":"GE HEALTHCARE","slug":"ge-healthcare","state":"DC","description":"Provider of technologies, digital infrastructure, data analytics, related healthcare tools","totalSpending":1200000,"filings":20,"yearlySpending":[{"year":2019,"income":20000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":280000}],"firms":["RED+BLUE STRATEGIES"],"lobbyists":["MELANIE NATHANSON","MEGAN MARSHALL","BENJAMIN KLEIN","KATHRYN WISE"],"issues":["HCR","MMM"],"sampleDescriptions":["Issues related to the ability to maintain, create and advance healthcare technologies in the United States.","H.R. 1865 - Further Consolidated Appropriations Bill for FY 2020- policies focused on device tax and new technologies for the diagnosis and potential treatment of Alzheimer's disease.","H.R. 748 - CARES Act - Issues related to supporting the national work fighting COVID-19 and increasing capacity for needed equipment.\n\nH.R. 6201 - Families First Coronavirus Response Act -  Issues related to ensuring that the federal government is best supporting programs to allow states and localities to best support and equip hospitals and health care providers fight COVID-19.\n\nH.R. 6074 - Coronavirus Preparedness and Response Supplemental Appropriations Act of 2020 - Issues related to supporting programs and institutions supporting during the current pandemic. \nExecutive actions impacting children's health care including potential regulations designed to restructure the Medicaid program. \n\nWork with the Administration to ensure that national equipment needs are met to fight the disease and care for patients.","H.R. 6800 - The HEROES Act - Issues related to data collection and work to ensure that states and localities have the tools necessary to manage spikes in COVID-19 in their communities.\n\nH.R. 748 - CARES Act - Issues related to supporting the national work fighting COVID-19 and increasing capacity for needed equipment.\n\nH.R. 6201 - Families First Coronavirus Response Act -  Issues related to ensuring that the federal government is best supporting programs to allow states and localities to best support and equip hospitals and health care providers fight COVID-19.\n\nH.R. 6074 - Coronavirus Preparedness and Response Supplemental Appropriations Act of 2020 - Issues related to supporting programs and institutions supporting during the current pandemic. \nExecutive actions impacting children's health care including potential regulations designed to restructure the Medicaid program. \n\nWork with the Administration to ensure that national equipment needs are met to fight the disease and care for patients.","H.R. 8406 - The HEROES Act (Modified) - Issues supporting providers and patients to access technology and equipment needed to fight against the coronavirus. \n\nH.R. 8319 - Continuing Appropriations Act of 2021 - Ensuring that vital programs covered by HHS, the VA and other agencies continue.\n\n\nH.R. 6800 - The HEROES Act - Issues related to data collection and work to ensure that states and localities have the tools necessary to manage spikes in COVID-19 in their communities.\n\nThe Senate HEALS Act (bill number not available) - Issues supporting providers and patients to access technology and equipment needed to fight against the coronavirus. \n\nIssues related to ensuring access and appropriate reimbursement of radiopharmaceuticals in the Medicare program\n\nWork with the Administration to ensure that national equipment needs are met to fight the disease and care for patients.","PL 116-260/H.R. 133- Consolidated Appropriations Act of 2021 - Issues related to Medicare Provider support and relief and Covid-19 relief and response. \n\nIssues related to ensuring access and appropriate reimbursement of radiopharmaceuticals in the Medicare program\n\nWork with the Administration to ensure that national equipment needs are met to fight the disease and care for patients.","PL 117- 2- The American Rescue Plan Act - Issues related to ensuring access to technologies for the fight against COVID-19. \n\nS. 748 - Medicare Sequester Relief Act - Issues related to allowing Medicare providers the support to continue their work during the pandemic. \n\nIssues related to ensuring that vital information regarding hospital bed availability and other key issues are made available in all states to ensure patient access and safety during disasters and emergencies. \n\nIssues related to payment for and access to radiopharmaceuticals.","H.R.4479/S.2609 - The FIND Act - Legislation focused on ensuring equitable access to radio pharmaceuticals. \n\nPL 117- 2- The American Rescue Plan Act - Implementation issues related to ensuring access to technologies for the fight against COVID-19. \n\nIssues related to ensuring that vital information regarding hospital bed availability and other key issues are made available in all states to ensure patient access and safety during disasters and emergencies.","H.R. 2471 Consolidated Appropriations Act for FY 2022 - Issues related to CDC and ASPR's ability to support real-time health information sharing during pandemics and other emergencies. H.R.4479/S.2609 - The FIND Act - Legislation focused on ensuring equitable access to radio pharmaceuticals. PL 117- 2- The American Rescue Plan Act - Implementation issues related to ensuring access to technologies for the fight against COVID-19. Issues related to ensuring that vital information regarding hospital bed availability and other key issues are made available in all states to ensure patient access and safety during disasters and emergencies.","H.R. 7667 - The Food and Drug Amendments of 2022 Act - Issues related to FDA and Medical Devices. S 4348 - The FDA Safety and Landmark Advancements Act - Issues related to FDA and Medical Devices. H.R.4479/S.2609 - The FIND Act - Legislation focused on ensuring equitable access to radio pharmaceuticals. PL 117- 2- The American Rescue Plan Act - Implementation issues related to ensuring access to technologies for the fight against COVID-19. Issues related to ensuring that vital information regarding hospital bed availability and other key issues are made available in all states to ensure patient access and safety during disasters and emergencies.","H.R. 5305 - Extending Government Funding and Delivering Emergency Assistance Act. Issues related to FDA User Fee Agreements. H.R. 7667 - The Food and Drug Amendments of 2022 Act - Issues related to FDA and Medical Devices. S 4348 - The FDA Safety and Landmark Advancements Act - Issues related to FDA and Medical Devices. H.R.4479/S.2609 - The FIND Act - Legislation focused on ensuring equitable access to radio pharmaceuticals. PL 117- 2- The American Rescue Plan Act - Implementation issues related to ensuring access to technologies for the fight against COVID-19. Issues related to ensuring that vital information regarding hospital bed availability and other key issues are made available in all states to ensure patient access and safety during disasters and emergencies.","HR 2617 - Consolidated Appropriations Act for Fiscal Year 2023 - Issues related to health care preparedness and information sharing to support real time health care decision making across the country. H.R. 5305 - Extending Government Funding and Delivering Emergency Assistance Act. Issues related to FDA User Fee Agreements. H.R. 7667 - The Food and Drug Amendments of 2022 Act - Issues related to FDA and Medical Devices. S 4348 - The FDA Safety and Landmark Advancements Act - Issues related to FDA and Medical Devices. H.R.4479/S.2609 - The FIND Act - Legislation focused on ensuring equitable access to radio pharmaceuticals. PL 117- 2- The American Rescue Plan Act - Implementation issues related to ensuring access to technologies for the fight against COVID-19. Issues related to ensuring that vital information regarding hospital bed availability and other key issues are made available in all states to ensure patient access and safety during disasters and emergencies.","HR 2882 - Further Consolidation Appropriations- Support for critical government programs remaining operational and available. HR 4366 - Consolidated Appropriations Act of FY 2024 and other Extensions Act - Support for critical government programs remaining operational and available. H.R. 7024 - Tax Relief for American Families and Workers Act of 2024 - Issues related to the R&D tax credit and other tax treatments to support job creation and innovation. Regulations, guidance and other activity related to artificial intelligence and health care. Regulations, guidance and other activity related to women's health care and research. Rules and regulations regarding the availability of diagnostic treatments and testing related to neurological disorders. S. 1544 - Facilitating Innovative Nuclear Diagnostics Act of 2023 - A bill to ensure that there is equitable and accessible coverage of radio-diagnostic treatments to detect diseases like Alzheimer's and Parkinson's across the country. Issues related to ensuring access to real time hospital data during national emergencies and pandemics for physicians and relevant health care personnel. Issues related to ensuring rural, underserved and other communities access to certain procedures and related drugs used to diagnose neurological disorders, such as Parkinson's disease. Issues related to women's health specific to access to imaging and other procedures used to assess the health of breasts and other organs. Issues related to ensuring access to cancer screening and treatments.","H.R. 1199 - Facilitating Innovative Nuclear Diagnostics Act (The FIND Act) - Issues related to ensuring access to diagnostic testing for neurological disorders, cancer and other diseases requiring PET scans for accurate diagnosis. HR 2882 - Further Consolidation Appropriations- Support for critical government programs remaining operational and available. HR 4366 - Consolidated Appropriations Act of FY 2024 and other Extensions Act - Support for critical government programs remaining operational and available. H.R. 7024 - Tax Relief for American Families and Workers Act of 2024 - Issues related to the R&D tax credit and other tax treatments to support job creation and innovation. Regulations, guidance and other activity related to artificial intelligence and health care. Regulations, guidance and other activity related to women's health care and research. Rules and regulations regarding the availability of diagnostic treatments and testing related to neurological disorders. Issues related to ensuring access to real time hospital data during national emergencies and pandemics for physicians and relevant health care personnel. Issues related to ensuring rural, underserved and other communities access to certain procedures and related drugs used to diagnose neurological disorders, such as Parkinson's disease. Issues related to women's health specific to access to imaging and other procedures used to assess the health of breasts and other organs. Issues related to ensuring access to cancer screening and treatments.","H.R. 10545 - The Continuing Appropriations and Extensions Act, 2025 - Issues related to physician payment and access to critical medical technology. CMS Outpatient Prospective Payment (OPPS) Regulations - Issues related to ensuring better access to coverage of diagnostic tools for Americans with neurological disorders, cancer and other diseases across the country. H.R. 1199 - Facilitating Innovative Nuclear Diagnostics Act (The FIND Act) - Issues related to ensuring access to diagnostic testing for neurological disorders, cancer and other diseases requiring PET scans for accurate diagnosis. H.R. 7024 - Tax Relief for American Families and Workers Act of 2024 - Issues related to the R&D tax credit and other tax treatments to support job creation and innovation. Regulations, guidance and other activity related to artificial intelligence and health care. Regulations, guidance and other activity related to women's health care and research. Rules and regulations regarding the availability of diagnostic treatments and testing related to neurological disorders. Issues related to ensuring access to real time hospital data during national emergencies and pandemics for physicians and relevant health care personnel. Issues related to ensuring rural, underserved and other communities access to certain procedures and related drugs used to diagnose neurological disorders, such as Parkinson's disease. Issues related to women's health specific to access to imaging and other procedures used to assess the health of breasts and other organs. Issues related to ensuring access to cancer screening and treatments.","Issues related to research and access to women's health screenings Issues related to reseach and coverage of diagnostic procedures utilizing radiopharmaceuticals Issues related to the impact of FCC spectrum on health technology Issues related to artificial intelligence and its role in the health care system","Issues related to research and access to women's health screenings. Issues related to research and coverage of diagnostic procedures utilizing radiopharmaceuticals. Issues related to artificial intelligence and its role in the health care system. Monitor proposals related to NIH's calculation of indirect costs."],"years":[2019,2020,2021,2022,2024,2025]}