{"id":184932,"name":"GOTENNA","slug":"gotenna","state":"NY","description":"Communications company","totalSpending":1530000,"filings":23,"yearlySpending":[{"year":2018,"income":50000},{"year":2019,"income":170000},{"year":2020,"income":240000},{"year":2021,"income":320000},{"year":2022,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":270000}],"firms":["INVARIANT LLC"],"lobbyists":["HEATHER PODESTA","BENJAMIN KLEIN","ANNE PALISI","NOAH KOWALSKI","TIMOTHY MARTIN","MARK FRIEDMANN","MAIA ESTES","NICK MIKULA","DENA BARON SMITH","CHARLES LADD","PAUL ARCANGELI","MONICA MATOUSH","JESSICA POWELL"],"issues":["COM","DIS","BUD","HOM","DEF","FOR","ECN","INT"],"sampleDescriptions":["Introduce company to policymakers.","Educate Members of Congress and the Administration on communications technology.","Educate Members of Congress and the Administration about commercial, off-the-shelf communications and mesh networks.","Discuss wildfire modernization technology provision in the John D. Dingell, Jr. Conservation, Management, and Recreation Act (P.L. 116-9).","Monitor and discuss Federal Emergency Management Agency disaster response communications infrastructure in FY20 Homeland Security appropriations bill.","Monitor and discuss Federal Emergency Management Agency disaster response communications infrastructure in FY20 Homeland Security appropriations bill (H.R. 3931/draft Senate bill).","Educate Members of Congress and the Administration about commercial off-the-shelf communications and mesh networks; support the interoperable communications language in the FY 2020 Department of Homeland Security Appropriations bill (H.R. 3931/draft Senate bill) and the FY 2020 Consolidated Appropriations Act (H.R. 1158) that highlights mobile mesh networking technology.","Support funding for interoperable mesh network communications and situational awareness technology in the FY21 Homeland Security Appropriations bill.","Support funding for agency implementation of the wildfire modernization provision of the John D. Dingell Conservation, Management, and Recreation Act (P.L. 116-9) in the FY21 Interior Appropriations bill; discuss interoperable mobile mesh networking communications and disaster relief efforts.","Support funding for interoperable mesh network communications and situational awareness technology in the FY21 Homeland Security Appropriations bill (H.R. 7669).","Support funding for interoperable mesh network communications and situational awareness technology in the FY21 Homeland Security Appropriations bill (H.R. 7669); promote interoperable mobile mesh networking communications for federal customers.","Support funding for interoperable mesh network communications and situational awareness technology in the FY22 Homeland Security Appropriations bill; promote interoperable mobile mesh networking communications for federal customers.","Support funding for interoperable mesh network communications and situational awareness technology in H.R.4431, Department of Homeland Security Appropriations Act, 2022; promote interoperable mobile mesh networking communications for federal customers.","Support funding for interoperable mesh network communications and situational awareness technology in H.R.4431/S.3058, Department of Homeland Security Appropriations Act, 2022; promote interoperable mobile mesh networking communications for federal customers.","Educate members on interoperable mesh networks and capabilities.","Educate members and Department of Defense officials on interoperable mesh networks and capabilities.","Educate and support funding for interoperable mesh network communications and situational awareness technology in FY23 House and Senate homeland security appropriations bills; promote interoperable mobile mesh networking communications for federal customers.","Educate and support funding for interoperable mesh network communications and situational awareness technology in H.R. 8257 and the FY23 Senate Department of Homeland Security Appropriations bill; promote interoperable mobile mesh networking communications for federal customers.","Educate members on interoperable mesh networks and capabilities in H.R. 8236 and FY23 Senate Department of Homeland Security appropriations bill.","Educate and support funding for interoperable mesh network communications and situational awareness technology in H.R. 8257/S.4678, the FY23 Department of Homeland Security appropriations bill; promote interoperable mobile mesh networking communications for federal customers."],"years":[2018,2019,2020,2021,2022,2024,2025]}