{"id":212605,"name":"H-E-B GROCERY COMPANY, LP","slug":"h-e-b-grocery-company-lp","state":"TX","description":"Supermarket chain operating in Texas and northeast Mexico","totalSpending":1360000,"filings":17,"yearlySpending":[{"year":2021,"income":80000},{"year":2022,"income":320000},{"year":2023,"income":320000},{"year":2024,"income":320000},{"year":2025,"income":320000}],"firms":["INVARIANT LLC"],"lobbyists":["ANNE MACMILLAN","ERIC ROSEN","TIMOTHY MARTIN","JOEL RICHARD","AMY SWONGER","DANIELLE BECK","ADAM TARR","KENNETH BARBIC","KEVIN DIESTELOW","JAMES OBRIEN"],"issues":["AGR","FOO","LBR","TAX","GOV",null,"FIN"],"sampleDescriptions":["Agriculture, food industry, workplace","Monitor tax proposals in H.R.5376, Build Back Better Act.","Monitor issues around the nutrition safety net including the Supplemental Nutrition Assistance Program (SNAP) and the Women, Infants and Children Program (WIC).","Monitor issues impacting the grocery industry including supply chain concerns and other potential market disruptions.","Monitor issues related to competition policy reform; monitor OSHA ETS on vaccines.","Monitor tax proposals in H.R.5376, Build Back Better Act and draft Senate legislation.","Educate policymakers regarding efforts to reform the Freedom of Information Act (FOIA), including S.742, the Open and Responsive Government Act.","Monitor issues related to competition policy reform.","Monitor issues impacting the grocery industry including supply chain concerns and other potential market disruptions. Monitor issues around the nutrition safety net including the Supplemental Nutrition Assistance Program (SNAP) and the Women, Infants and Children Program (WIC). Monitor the planning and implementation of the White House Conference on Hunger, Nutrition, and Health with regard to federal nutrition programs and standards.","Monitor H.R.5376, The Inflation Reduction Act.","Monitor issues related to competition policy.","Monitor efforts to enact end-of-year tax extenders.","Educate policymakers regarding reform to the Freedom of Information Act.","Monitor issues impacting the grocery industry, including supply chain concerns and other potential market disruptions. Advocate for a strengthened nutrition safety net, including the Supplemental Nutrition Assistance Program (SNAP) and the Women, Infants and Children Program (WIC). Monitor the implementation of nutrition regulations from the National Strategy on Hunger, Nutrition, and Health.","Monitor tax policy.","Monitor S.1838 / H.R.3881, the Credit Card Competition Act debate.","Monitor issues impacting the grocery industry, including supply chain concerns and other potential market disruptions. Advocate for a strengthened nutrition safety net, including the Supplemental Nutrition Assistance Program (SNAP) and the Women, Infants and Children Program (WIC). Monitor regulations related to nutrition, including those contained in the National Strategy on Hunger, Nutrition, and Health.","Monitor the impacts of pending tax proposals.","Monitor issues impacting the grocery industry, including supply chain concerns and other potential market disruptions. Advocate for a strengthened nutrition safety net, including the Supplemental Nutrition Assistance Program (SNAP) and the Women, Infants and Children Program (WIC). Monitor regulations related to nutrition, including those contained in the National Strategy on Hunger, Nutrition, and Health. Monitor the development of the FY 2026 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Bill.","Monitor issues impacting the grocery industry, including supply chain concerns and other potential market disruptions. Advocate for a strengthened nutrition safety net, including the Supplemental Nutrition Assistance Program (SNAP) and the Women, Infants and Children Program (WIC). Monitor regulations related to nutrition, including those contained in the National Strategy on Hunger, Nutrition, and Health. Monitor the development of H.R.4121/S.2256, the FY 2026 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Act. Monitor the Farm Bill reauthorization process. Monitor nutrition-related provisions in P.L.119-21, the One Big Beautiful Bill Act, and educate Members on H-E-B's priorities."],"years":[2021,2022,2023,2024,2025]}