{"id":184954,"name":"H&R BLOCK MANAGEMENT, LLC","slug":"h-r-block-management-llc","state":"DC","description":"Operates and franchises tax preparation services","totalSpending":1370000,"filings":21,"yearlySpending":[{"year":2019,"income":90000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":320000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["INVARIANT LLC"],"lobbyists":["MARY STANTON","NICOLE VENABLE","QUINCY ENOCH","HEATHER PODESTA","NOAH MARINE","PAUL NEMETZ"],"issues":["BAN","FIN","TAX","CSP","LBR","DEF","TEC","BUD"],"sampleDescriptions":["Improve tax administration and tax fraud prevention.","Discuss issues pertaining to tax-time financial products and small dollar lending.","Educate Members of Congress on tax preparation services and related legislation, including H.R. 3466, to amend the Internal Revenue Code of 1986 to clarify the authority of the Secretary of the Treasury to rescind identifying numbers of tax return preparers; and H.R. 3330 / S. 1192, the Taxpayer Protection and Preparer Proficiency Act of 2019.","Educate Members of Congress on tax preparation services and related legislation, including H.R. 3466, to amend the Internal Revenue Code of 1986 to clarify the authority of the Secretary of the Treasury to rescind identifying numbers of tax return preparers; H.R. 3330 / S. 1192, the Taxpayer Protection and Preparer Proficiency Act of 2019; and H.R. 1865, the Further Consolidated Appropriations Act, 2020 regarding IRS funding; oppose S. 1194, the Tax Simplification Act of 2019.","Educate Members of Congress on tax preparation services and related legislation, including H.R. 3466, to amend the Internal Revenue Code of 1986 to clarify the authority of the Secretary of the Treasury to rescind identifying numbers of tax return preparers; H.R. 3330 / S. 1192, the Taxpayer Protection and Preparer Proficiency Act of 2019; and H.R. 1865, the Further Consolidated Appropriations Act, 2020 regarding IRS funding; oppose S. 1194, the Tax Simplification Act of 2019; advocate for clarification on tax filing deadlines.","Discuss issues pertaining to tax-time financial products; monitor issues related to small dollar lending.","Educate Members of Congress on tax preparation services and related legislation, including H.R. 3466, to amend the Internal Revenue Code of 1986 to clarify the authority of the Secretary of the Treasury to rescind identifying numbers of tax return preparers; and H.R. 3330 / S. 1192, the Taxpayer Protection and Preparer Proficiency Act of 2019; monitor H.R. 6800, the HEROES Act, and implementation of the CARES Act (P.L. 116-136); educate Members of Congress on reforming the PTIN issuance process, the IRS Free File program, extending the tax filing deadline, and the Government Populated Return.","Educate Members of Congress on tax preparation services and related legislation, including H.R. 3466, to amend the Internal Revenue Code of 1986 to clarify the authority of the Secretary of the Treasury to rescind identifying numbers of tax return preparers; and H.R. 3330 / S. 1192, the Taxpayer Protection and Preparer Proficiency Act of 2019. Monitor H.R. 6800, the Heroes Act; H.R. 925, the Heroes Act (revised); S. 1624, HEALS Act; and implementation of the CARES Act (P.L. 116-136). Educate Members of Congress on reforming the PTIN issuance process, extending the tax filing deadline, and the Government Populated Return; monitor and educate on issues pertaining to the administration of Economic Impact Payments.","Monitor issues related to small dollar lending.","Educate Members of Congress on tax preparation services and related legislation, including H.R. 3466, to amend the Internal Revenue Code of 1986 to clarify the authority of the Secretary of the Treasury to rescind identifying numbers of tax return preparers; and H.R. 3330 / S. 1192, the Taxpayer Protection and Preparer Proficiency Act of 2019. Monitor H.R. 6800, the Heroes Act; H.R. 925, the Heroes Act (revised); S. 1624, HEALS Act; and implementation of the CARES Act (P.L. 116-136). Educate Members of Congress on reforming the PTIN issuance process, extending the tax filing deadline, and the Government Populated Return; monitor and educate on issues pertaining to the administration of Economic Impact Payments; support S. 3995 / H.R. 8056, the Remote and Mobile Worker Relief Act of 2020.","Educate Members of Congress on tax preparation services and related legislation; educate Members of Congress on reforming PTIN issuance process, extending the tax filing deadline, and the Government Populated Return; monitor and educate on issues pertaining to the administration of the Economic Impact Payments.","Educate Members of Congress on tax preparation services and related legislation; educate Members of Congress on reforming PTIN issuance process and the Government Populated Return; monitor tax proposals in Build Back Better Act.","Monitor the PRO Act and updated guidance from OSHA on COVID vaccines.","Monitor S.2875, Cyber Incident Reporting Act and track the related amendment in the National Defense Authorization Act.","Educate Members of Congress on tax preparation services and related legislation; educate Members of Congress on reforming PTIN issuance process and the Government Populated Return; monitor tax proposals in H.R.5376, Build Back Better Act.","Monitor S.420/H.R. 842, Protecting the Right to Organize Act of 2021, and updated guidance from OSHA on COVID vaccines.","Educate Members of Congress on tax preparation services and related legislation; educate Members of Congress on reforming PTIN issuance process and the Government Populated Return; monitor tax proposals in H.R.5376, Build Back Better Act; monitor potential changes to the tax filing deadline.","Monitor S.420 / H.R.842, Protecting the Right to Organize Act of 2021, and updated guidance from OSHA on COVID vaccines.","Monitor S.2875, Cyber Incident Reporting Act and the related language in FY 2022 appropriations bills.","Monitor S.420/H.R. 842, Protecting the Right to Organize Act of 2021."],"years":[2019,2020,2021,2022,2024,2025]}