{
  "id": 195950,
  "name": "HAMPTON ROADS MILITARY AND FEDERAL FACILITIES ALLIANCE",
  "slug": "hampton-roads-military-and-federal-facilities-alliance",
  "state": "VA",
  "description": "Regional support group for federal facilities in the Hampton Roads Region..",
  "totalSpending": 3840000,
  "filings": 32,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 360000
    },
    {
      "year": 2019,
      "income": 480000
    },
    {
      "year": 2020,
      "income": 360000
    },
    {
      "year": 2021,
      "income": 720000
    },
    {
      "year": 2022,
      "income": 480000
    },
    {
      "year": 2023,
      "income": 480000
    },
    {
      "year": 2024,
      "income": 480000
    },
    {
      "year": 2025,
      "income": 480000
    }
  ],
  "firms": [
    "THE ROOSEVELT GROUP"
  ],
  "lobbyists": [
    "JOHN SIMMONS",
    "CHRISTOPHER GOODE",
    "KATHLEEN FERGUSON",
    "KEVIN FELIX",
    "MATTHEW HERRMANN",
    "JAMIE MILLER",
    "BOBBY CORNETT",
    "TERAN JUDD",
    "KYLE KLEIN"
  ],
  "issues": [
    "DEF",
    null
  ],
  "sampleDescriptions": [
    "FY19 Defense Appropriations; FY19 Military Construction Appropriations; FY19 National Defense Authorization Act, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY20 Defense Appropriations; FY20 Military Construction Appropriations; FY20 National Defense Authorization Act, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY20 Defense Appropriations; FY20 Military Construction Appropriations; FY20 National Defense Authorization Act, F-22 Beddown and EIS at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY21 Defense Appropriations; FY21 Military Construction Appropriations; FY21 National Defense Authorization Act, F-22 Beddown and EIS at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY22 Defense Appropriations; FY22 Military Construction Appropriations; FY22 National Defense Authorization Act, F-22 FTU Beddownand at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY23 Defense Appropriations; FY23 Military Construction Appropriations; FY23 National Defense Authorization Act, F-22 FTU Beddownand at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY24 Defense Appropriations; FY24 Military Construction Appropriations; FY24 National Defense Authorization Act, F-22 FTU Beddownand at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY25 Defense Appropriations; FY25 Military Construction Appropriations; FY25 National Defense Authorization Act, F-22 FTU Beddownand at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement.",
    "FY26 Defense Appropriations; FY26 Military Construction Appropriations; FY26 National Defense Authorization Act, F-22 FTU Beddownand at Langley AFB, DOD Training Range Enhancement, Shipyard Optimization and Revitalization, Unmanned Systems Research, Military Construction, Whole of Government Center of Excellence and mission enhancement."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 33,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 480000,
  "peakYear": 2021,
  "lobbyistCount": 9,
  "firmCount": 1,
  "issueCount": 1,
  "industry": "defense"
}