{"id":210492,"name":"HARRIS COUNTY","slug":"harris-county","state":"TX","description":"County Government","totalSpending":1180000,"filings":17,"yearlySpending":[{"year":2021,"income":140000},{"year":2022,"income":400000},{"year":2024,"income":320000},{"year":2025,"income":320000}],"firms":["CARPI & CLAY, INC"],"lobbyists":["JULIE MINERVA","LAURA MORGAN-KESSLER","DAVID WETMORE"],"issues":["BUD","NAT","CAW","DIS","HCR","TRA","HOU","TEC"],"sampleDescriptions":["Support for the advancement of the County's infrastructure portfolio.","Support for the advancement of the Countys infrastructure portfolio.","Support for the advancement of the Countys infrastructure portfolio. Support for the Infrastructure Investment & Jobs Act.","Support for the advancement of the Countys infrastructure portfolio. Support for FEMAs BRIC Program. Support for the Infrastructure Investment & Jobs Act.","Advocate for federal funding assistance for implementation of the Countys Accessing Coordinated Care and Empowering Self-Sufficiency (ACCESS) integrated care model.","Support for the advancement of the Countys infrastructure portfolio. Support for implementation of the Infrastructure Investment and Jobs Act (P.L. 117-58).","Support for the advancement of the Countys infrastructure portfolio. Support for FEMAs BRIC Program. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58).","Support for the advancement of the Countys infrastructure portfolio. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for the development of the Water Resources Development Act of 2022.","Support for the advancement of the Countys infrastructure portfolio. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for the Consolidated Appropriations Act, 2022 (H.R. 2471, P.L. 117-103).","Support for the advancement of the Countys infrastructure portfolio and long-term flood risk reduction efforts. Support for implementation of the Infrastructure Investment and Jobs Act (P.L. 117-58).","Support for the advancement of the Countys infrastructure portfolio. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for the County's FY 2023 Community Project Funding requests for flood risk reduction efforts.","Support for the County's transportation infrastructure investments.","Support for the implementation of Hurricane Harvey disaster relief funding.","Support for the advancement of the Countys infrastructure portfolio. Support for implementation of the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for implementation of the Inflation Reduction Act of 2022 (P.L. 117-169).","Support for the advancement of the Countys infrastructure portfolio. Support for FEMAs BRIC Program. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for disaster recovery assistance.","Support for the advancement of the Countys infrastructure portfolio. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for the County's FY 2023 Community Project Funding requests for flood risk reduction efforts. Support for implementation of the Inflation Reduction Act of 2022 (P.L. 117-169).","Support for the County's transportation infrastructure investments. Support for implementation of the Infrastructure Investment and Jobs Act (P.L. 117-58).","Implementation of the Infrastructure Investment and Jobs Act (P.L. 117-58), broadband.","Support for the advancement of the Countys infrastructure portfolio and long-term flood risk reduction efforts. Support for implementation of the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for the completion of the Water Resources Development Act of 2022 (H.R. 7776, P.L. 117-263).","Support for the advancement of the Countys infrastructure portfolio. Support for the Infrastructure Investment and Jobs Act (P.L. 117-58). Support for the County's FY 2023 Community Project Funding requests for flood risk reduction efforts in the Consolidated Appropriations Act, 2023 (H.R. 2617, P.L. 117-328). Support for implementation of the Inflation Reduction Act of 2022 (P.L. 117-169)."],"years":[2021,2022,2024,2025]}