{"id":184798,"name":"HEARST CORPORATION","slug":"hearst-corporation","state":null,"description":null,"totalSpending":2180000,"filings":26,"yearlySpending":[{"year":2018,"income":280000},{"year":2019,"income":280000},{"year":2020,"income":270000},{"year":2021,"income":360000},{"year":2022,"income":360000},{"year":2024,"income":270000},{"year":2025,"income":360000}],"firms":["INVARIANT LLC"],"lobbyists":["HEATHER PODESTA","BENJAMIN KLEIN","LARISSA MARTINEZ","ANNE PALISI","JONATHAN BECKER","ERIC ROSEN","KATHRYN WISE","CHRISTOPHER GILLOTT","ANNABELL STOKES","JOEL RICHARD","STEPHEN WEYLER","JESSICA HATCHER","KAETLYN FANNING","DREW GRIFFIN"],"issues":["CSP","PHA","HCR","MIA","COM","LAW","VET","CPI"],"sampleDescriptions":["Monitor issues related to data privacy and data security.","Monitor efforts to streamline patient medication information and FDA guidance related to biosimilar naming conventions.","Monitor health policy issues, including implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidenced-based care guidelines; discuss efforts to address opioids epidemic; and discuss issues related to medical device database.","Monitor efforts to strengthen journalist protections.","Monitor efforts to streamline patient medication information.","Monitor health policy issues, including implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines; discuss efforts to address opioids epidemic; and discuss issues related to medical device database.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines; monitor COVID-19 legislation, including H.R. 6800, the Heroes Act, and H.R. 925, the Heroes Act (revised).","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines. Monitor legislation related to prior authorization.","Monitor congressional oversight over law enforcement and first amendment issues.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines. Monitor legislation related to prior authorization; educate lawmakers on factors that should be considered for EUA and technology integration.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines. Monitor legislation related to prior authorization including S.3018/H.R.3173, Improving Seniors Timely Access to Care Act of 2021.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines; monitor mental health legislation including mental health parity. Monitor legislation related to prior authorization including S.3018/H.R.3173, Improving Seniors' Timely Access to Care Act of 2021.","Monitor congressional oversight over law enforcement and first amendment issues, including H.R. 7072, the NDO Fairness Act.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines; monitor mental health legislation, including mental health parity. Monitor legislation related to prior authorization, including S. 3018/H.R. 3173, Improving Seniors Timely Access to Care Act of 2021.","Monitor congressional oversight over law enforcement and first amendment issues, including H.R. 7072, the NDO Fairness Act and H.R. 4330, the PRESS Act.","Monitor congressional oversight over law enforcement and first amendment issues, including H.R.7072, the NDO Fairness Act and H.R. 4330, the PRESS Act.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence-based care guidelines; monitor mental health legislation, including mental health parity. Monitor legislation related to prior authorization, including S.3018 / H.R.3173, Improving Seniors Timely Access to Care Act of 2021.","Monitor implementation of Medicare appropriate use criteria; educate Members of Congress about the importance of independent, evidence- based care guidelines; monitor mental health legislation, including mental health parity. Monitor issues related to prior authorization. Monitor issues related to home health reimbursement. Monitor issues related to the use of artificial intelligence in health care.","Monitor congressional oversight over law enforcement and First Amendment issues, including H.R.3089, the NDO Fairness Act, and H.R.4250 / S.2074, the PRESS Act."],"years":[2018,2019,2020,2021,2022,2024,2025]}