{"id":200225,"name":"HII","slug":"hii","state":"DC","description":"Shipbuilding, Maritime services","totalSpending":1230000,"filings":25,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":30000}],"firms":["THEGROUP DC, LLC"],"lobbyists":["DARREL THOMPSON","DWAYNE BOLTON","ERIADE WILLIAMS"],"issues":["DEF"],"sampleDescriptions":["H.R. 1625 The Consolidated Appropriations Act, 2018; defense funding for FY-2019; issues involving the Los Alamos National Laboratories","H.R. 5515 National Defense Authorization Act for FY 2019; Issues involving Los Alamos National Laboratories","H.R. 6157 Department of Defense and Labor, Health and Human Services, and Education Appropriations Act, 2018 and Continuing Appropriations Act, 2019 (Fiscal Year 2019 Appropriations Minibus)\n\nIssues involving the Los Alamos National Laboratories","Congressional funding for FY-19 (the Government Shutdown); Organization for the 116th Congress; Issues involving the Los Alamos National Laboratories","FY 2020 National Defense Authorization Act; FY 2020 Defense Appropriations (LHA 9 Amphibious Assault Ship)","FY 2020 National Defense Authorization Act; FY 2020 Defense Appropriations; FY 2020 Department of Homeland Security Appropriations Bill, Funding for a 12th National Security Cutter (NSC)","S. 1790/H.R. 2500--National Defense Authorization Act for Fiscal Year 2020\nS.2474/H.R. 2968--Department of Defense Appropriations Act, 2020","S. 1790/H.R. 2500--National Defense Authorization Act for Fiscal Year 2020\n\nH.R. 1158-- Consolidated Appropriations Act, 2020 (Defense; Commerce, Justice, Science and Related Agencies; Financial Services and General Government; Homeland Security). Issues involving the Nevada National Security Site; Issues involving National Security Cutter 12.","FY 2021 Defense Authorizations and Appropriations\n\nIssues involving the Los Alamos National Laboratory","H.R. 6395 - National Defense Authorization Act for Fiscal Year 2021 (NDAA)\nS. 4049 - National Defense Authorization Act for Fiscal Year 2021 (NDAA)\n\nFY 2021 Defense Appropriations\nFunding for National Security Cutter (NSC 12)\nIssues involving the Los Alamos National Laboratory","H.R. 8406/H.R. 925, The Heroes Act. Making emergency supplemental appropriations for the fiscal year ending September 30, 2021, and for other purposes\n\nFY 2021 Defense Appropriations","Senate Amendment to H.R. 133, Consolidated Appropriations Act, 2021\nIssues related to shipbuilding","Issues related to shipbuilding.  Funding for National Security Cutter 12.","H.R. 3114, Longshore and Harbor Workers COVID-19 Compensation Act of 2021, including provisions relating to COVID-19\n\nFY 2022 Defense Authorizations and Appropriations\n\nIssues related to shipbuilding.","S.1605 - National Defense Authorization Act for Fiscal Year 2022\nShipbuilding Issues related to the 2023 Defense Budget","Issues related to FY-2023 Defense Authorizations and Appropriations Issues related to shipbuilding","Issues related to FY-2023 Defense Authorizations and Appropriations Issues related to shipbuilding Issues related to the Hawaii Defense Workforce Initiative","Issues related to FY-2023 Defense Authorizations and Appropriations Issues related to shipbuilding Issues related to the Hawaii Defense Workforce Initiative FY-2023 Continuing Resolution","H.R. 7776, National Defense Authorization Act for Fiscal Year 2023 H.R. 2617, Consolidated Appropriations Act, 2023 Issues related to shipbuilding Issues related to the Hawaii Defense Workforce Initiative","H.R. 4366 Consolidated Appropriations Act 2024 FY 2025 Defense Authorization and Appropriations Issues related to shipbuilding and components."],"years":[2018,2019,2020,2021,2022,2024,2025]}