{
  "id": 139542,
  "name": "HO-CHUNK NATION LEGISLATURE",
  "slug": "ho-chunk-nation-legislature",
  "state": "WI",
  "description": "Federally-recognized Indian Tribe undertaking governmental and other activities.",
  "totalSpending": 1340000,
  "filings": 24,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 190000
    },
    {
      "year": 2019,
      "income": 230000
    },
    {
      "year": 2020,
      "income": 250000
    },
    {
      "year": 2021,
      "income": 80000
    },
    {
      "year": 2022,
      "income": 190000
    },
    {
      "year": 2023,
      "income": 190000
    },
    {
      "year": 2024,
      "income": 120000
    },
    {
      "year": 2025,
      "income": 90000
    }
  ],
  "firms": [
    "POWERS PYLES SUTTER & VERVILLE, P.C."
  ],
  "lobbyists": [
    "PAUL MOOREHEAD",
    "BRIAN GUNN",
    "NATASHA JOHN"
  ],
  "issues": [
    "IND",
    null
  ],
  "sampleDescriptions": [
    "General tribal matters; physical infrastructure; tribal consultation; marijuana legalization; the Tribal Labor Sovereignty Act (S.63/H.R.986); the Restoring Accountability in the Indian Health Service Act (H.R.2662/S.1250); the Tribal Tax and Investment Reform Act (H.R.3138 and S.1935); Indian gaming; land acquisition and consolidation matters; and DOI reorganization matters; sovereign immunity legislation (S.1948), employment and training matters.",
    "General tribal matters and appropriations; physical infrastructure; tribal consultation; marijuana legislation; the Tribal Labor Sovereignty Act (S.63/H.R.986); the Restoring Accountability in the Indian Health Service Act (H.R.2662/S.1250); the Tribal Tax and Investment Reform Act (H.R.3138 and S.1935); Indian gaming; land acquisition and consolidation matters; and DOI reorganization matters; sovereign immunity legislation (S.1948); employment and training matters; DOI self-governance legislation (S.1250); CMS work requirements.",
    "General tribal matters and appropriations; physical infrastructure; tribal consultation; the Tribal Labor Sovereignty Act (S.63/H.R.986); the Restoring Accountability in the Indian Health Service Act (H.R.2662/S.1250); the Tribal Tax and Investment Reform Act (H.R.3138 and S.1935); Indian gaming; land acquisition and consolidation matters; and DOI reorganization matters; DOI self-governance legislation (S.1250); CMS work requirements; IRA legislation (H.R.130, H.R.131); Rural Broadband Permitting (H.R. 6824); NAHASDA Re-authorization.",
    "General tribal matters and appropriations; physical infrastructure; Tribal Labor Sovereignty Act (H.R.779; S.226); Tribal Tax and Investment Reform Act; Indian gaming; land acquisition and consolidation matters; DOI reorganization; Tribal tax provisions; Assessment of the Indian Health Service Act (S.498); Consolidated Appropriations Act (H.R.648); Indian Programs Advanced Appropriations Act (S.229; H.R.1128); land into trust issues; Farm Bill implementation; Carcieri legislation; IPAA \"Dear Colleague\" letter; and implementation of the Native American Business Development, Trade Promotion and Tourism Act.",
    "General tribal matters and appropriations; physical infrastructure; Tribal Labor Sovereignty Act (H.R.779; S.226); Tribal Tax and Investment Reform Act(H.R.2484); Indian gaming; land acquisition and consolidation matters; DOI reorganization; Indian Programs Advanced Appropriations Act (S.229; H.R.1128); land into trust issues; 2018 Farm Bill implementation; Carcieri legislation (H.R.375); Indian Reorganization Act; Pauma Casino; Beloit Project;implementation of the Native American Business Development, Trade Promotion and Tourism Act; AUTOS Act (S.1211);Indian Buffalo Management Act; Interior Improvement Act; Tax Fairness for Tribal Youth Act of 2019 (H.R.2810); The RESPECT Act (S.2071); land and resource management legislation; and the Mashpee Wampanoag Tribe Reservation Reaffirmation Act(H.R.312).",
    "General tribal matters and appropriations; Tribal Labor Sovereignty Act (H.R.779; S.226); DOI reorganization; Indian Programs Advanced Appropriations Act (S.229; H.R.1128); 2018 Farm Bill implementation; Carcieri legislation (H.R.375); Beloit fee-to-trust application; implementation of the Native American Business Development, Trade Promotion and Tourism Act; Indian Buffalo Management Act; Tax Fairness for Tribal Youth Act of 2019 (H.R.2810; S.2079); FY2020 appropriations legislation; PACED Act (S.440); Indian Community Economic Development Enhancement Act of 2019 (S.212; H.R.1937); and energy-related matters.",
    "Indian Buffalo Management Act (H.R.5153); tribal tax-related matters; Community Reinvestment Act of 1977; Tribal Nutrition Improvement Act; Remove the Stain Act (H.R.3467); NEPA proposed reform; Beloit fee to trust application; meteor mining project; infrastructure development on Indian land; funding for the Indian Health Service; Pioneer Cemetery; Indian Health Service reform; eagle feather policy; FTT; NAHASDA Veterans housing and federal funding; land into trust issues; Interior Improvement Act; tax and mandatory leave provisions; business loans and loan guarantee programs; Tribal Labor Sovereignty Act (H.R.779; S.226); CARES Act; Families First Act; Coronavirus Supplemental Appropriations Act.",
    "CDC grant opportunities; Paycheck Protection Program; Beloit fee-to-trust application; Coronavirus Relief Fund; FY2021 appropriations; the CARES Act; energy provisions in CARES Act; IHS third-party reimbursements; medical stockpile legislation; Indian Buffalo Management Act (H.R.5153); casinos eligibility for the Paycheck Protection Program; and the Indian Self-Determination statement by POTUS.",
    "Tribal Self-Governance legislation; Paycheck Protection Program and EIN; potential Coronavirus Relief Fund volume 2 and related matters; CARES Act 2.0; grant awards for the Nation on EPA program; Indian Loan Guarantee Program amendments for next CARES Act; the HEALS Act; FY2021 appropriations; Department of Health and Human Services grant; Wild Virginia PI denied decision; Indian Buffalo Management Act (H.R.5153); energy poverty legislation; business liability protection relating to COVID-19.",
    "Census and tribal medical supplies legislation; Paycheck Protection Program; tribal provisions in COVID-19 relief legislation; FY2021 appropriations; Indian Buffalo Management Act (H.R.5153).",
    "Tribal Labor Sovereignty Act introduction; CARES Act implementation; COVID-19 grant notice for the Ho-Chunk Nation; Rep. Haaland's nomination to be Secretary of Interior; the GREEN Act; American Rescue Plan Act; earmarks; FY2022 appropriations; Moore's tax credit legislation (Earned Income and Child Tax Credits Outreach Act of 2021 (H.R.574)); cattle and bison issues; Coronavirus Relief Fund (CRF) formula and distribution; tribal regulatory reform in Commerce Department; energy-related tribal matters; Beloit Project; Native American Business Development, Trade Promotion, and Tourism Act of 2000.",
    "CARES Act implementation; COVID-19 grant notice for the Ho-Chunk Nation; Rep. Haaland's nomination to be Secretary of Interior; the GREEN Act; American Rescue Plan Act; earmarks; FY2022 appropriations; Moore's tax credit legislation (Earned Income and Child Tax Credits Outreach Act of 2021 (H.R.574)); cattle and bison issues; Coronavirus Relief Fund (CRF) formula and distribution; tribal regulatory reform in Commerce Department; energy-related tribal matters; Beloit Project; Native American Business Development, Trade Promotion, and Tourism Act of 2000.",
    "COVID-19 Relief Funds; FY2022 and FY2023 Appropriations; Beloit Land Project; Sale of Tribal Fee Lands; Violence Against Women Act (VAWA).",
    "COVID-19 Relief Funds; FY2022 and FY2023 Appropriations; Beloit Land Project; Sale of Tribal Fee Lands; Violence Against Women Act (VAWA); FY2023 President's Budget Request; clean water issues, RESPECT Act, Indian health care, Department of the Interior Federal Boarding School Initiative, land into trust application, H.R.6063 Land Disputes in Illinois, and FY2023 Interior Appropriations.",
    "FY2022 and FY2023 Appropriations; Sale of Tribal Fee Lands; Violence Against Women Act (VAWA); FY2023 President's Budget Request; Clean Water Issues, RESPECT Act, Indian Health Care, Department of the Interior Federal Boarding School Initiative, Land into Trust Application, H.R.6063 Land Disputes in Illinois, FY2023 Interior Appropriations; Tribal Parity Act; and Renewable Energy Projects.",
    "Clean Energy FY2023 Appropriations; Sale of Tribal Fee Lands; Violence Against Women Act (VAWA); Clean Water Issues; RESPECT Act; Indian Health Care; Land into Trust Application; H.R.6063 Land Disputes in Illinois; Tribal Parity Act; Renewable Energy Projects; BIA Land and Realty Functions; Tribal Tax Matters.",
    "FY2025 Appropriations; Indian Health Care; Parity for Tribal Law Enforcement Act (H.R.4524); Renewable Energy Projects; BIA Land and Realty Functions; Tribal Tax and Investment Reform Act (Draft); NAHASDA reauthorization (S.2285); Farm Bill reauthorization; Low Income Household Water Assistance Program; Miami Tribe Land Claim Bill (S.2796; S.1783); Truth and Healing Commission on Indian Boarding School Policies (S.1723; H.R.7227); Indian land leasing bill (H.R.1532).",
    "FY2025 Appropriations; Indian Health Care; Parity for Tribal Law Enforcement Act (H.R.4524); Renewable Energy Projects; BIA Land and Realty Functions; Tribal Tax and Investment Reform Act (Draft); NAHASDA reauthorization (S.2285); Farm Bill reauthorization; Low Income Household Water Assistance Program; Miami Tribe Land Claim Bill (S.2796; S.1783); Truth and Healing Commission on Indian Boarding School Policies (S.1723; H.R.7227); Indian land leasing bill (H.R.1532); Strengthening State and Tribal Child Support Enforcement Act (H.R.7906); American Indian Religious Freedom Act matters; Land into trust for gaming in Wisconsin; Farm Bill reauthorization.",
    "FY2025 and FY2026 Appropriations; Parity for Tribal Law Enforcement Act; Renewable Energy Projects; BIA Land and Realty Functions; Tribal Tax and Investment Reform Act; NAHASDA reauthorization; Farm Bill reauthorization; Low Income Household Water Assistance Program; Miami Tribe Land Claim Bill (S.550, H.R.____); Truth and Healing Commission on Indian Boarding School Policies; Land into trust for gaming in Wisconsin; H.R.1, One Big Beautiful Bill Act.",
    "FY2026 Appropriations; Parity for Tribal Law Enforcement Act; Renewable Energy Projects; BIA Land and Realty Functions; Tribal Tax and Investment Reform Act; NAHASDA reauthorization; Farm Bill reauthorization; Low Income Household Water Assistance Program; Miami Tribe Land Claim Bill (S.550); Truth and Healing Commission on Indian Boarding School Policies; Land into trust for gaming in Wisconsin; H.R.1, One Big Beautiful Bill Act."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -53,
  "trajectory": "declining",
  "yearsActive": 8,
  "avgAnnualSpending": 167500,
  "peakYear": 2020,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 1
}