{"id":178539,"name":"HOSPICE ACTION NETWORK","slug":"hospice-action-network","state":"VA","description":"Organization dedicated to preserving and expanding access to hospice care in America.","totalSpending":1341247,"filings":29,"yearlySpending":[{"year":2018,"income":131247},{"year":2019,"income":120000},{"year":2020,"income":240000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2023,"income":250000},{"year":2024,"income":200000}],"firms":["THE NICKLES GROUP, LLC"],"lobbyists":["JEFF CHOUDHRY","STEPHANIE BADGER","MARY SAVARY TAYLOR"],"issues":["VET","MMM","BUD","HCR","HOM",null],"sampleDescriptions":["Issues related to We Honor Veterans program.","Issues concerning reimbursement for the Medicare hospice benefit. S. 1334 and H.R. 2797, Patient Choice and Quality Care Act of 2017 and issues related to advanced illness care and management. S. 980 and H.R. 1828, Rural Access to Hospice Act of 2017. S. 693 and H.R. 1676, Palliative Care and Hospice Education and Training Act. H.R. 1284 and S. 2214, Medicare Patient Access to Hospice Act of 2017. Issues related to regulatory relief. H.R. 1892, Bipartisan Budget Act of 2018, H.R. 1625, Consolidated Appropriations Act of 2018 and issues concerning patient access to hospice. H.R. 5041, The Safe Disposal of Unused Medication Act and issues regarding the disposal of unused controlled substances.","H.R. 1892, Bipartisan Budget Act of 2018 and H.R. 1625, Consolidated Appropriations Act of 2018, as they relate to access to hospice care.","Issues concerning reimbursement for the Medicare hospice benefit. S. 980 and H.R. 1828, Rural Access to Hospice Act of 2017. S. 1334 and H.R. 2797, Patient Choice and Quality Care Act of 2017. Issues related to advanced illness care and management. S. 693 and H.R. 1676, Palliative Care and Hospice Education and Training Act. H.R. 1284 and S. 2214, Medicare Patient Access to Hospice Act of 2017. Issues related to regulatory relief. H.R. 5041 / S. 2659, Safe Disposal of Unused Medication Act. H.R. 6, SUPPORT for Patients and Communities Act as it pertains to the disposal of unused controlled substances; S. 2661, Hospice Safe Drug Disposal Act of 2018, S.2680, Opioid Crisis Response Act of 2018 as they pertain to the disposal of unused controlled substances.","Issues concerning reimbursement for the Medicare hospice benefit. S. 980 and H.R. 1828, Rural Access to Hospice Act of 2017. S. 1334 and H.R. 2797, Patient Choice and Quality Care Act of 2017. Issues related to advanced illness care and management. S. 693 and H.R. 1676, Palliative Care and Hospice Education and Training Act. Issues related to regulatory relief. H.R. 5041 / S. 2659, Safe Disposal of Unused Medication Act. H.R. 6, SUPPORT for Patients and Communities Act as it pertains to the disposal of unused controlled substances; S. 2661, Hospice Safe Drug Disposal Act of 2018, S.2680, Opioid Crisis Response Act of 2018 as they pertain to the disposal of unused controlled substances.","Monitored H.R. 6157, Department of Defense and Labor, Health and Human Services, and Education Appropriations Act and Continuing Appropriations Act. Monitored H.R. 695, Further Additional Continuing Appropriations Act of 2019.","Issues related to the We Honor Veterans program.","Issues concerning access to the Medicare hospice benefit. S. 1190 / H.R. 2594, Rural Access to Hospice Act of 2019 and issues involving access to hospice for Rural Health Clinic (RHC) and Federally Qualified Health Clinic (FQHC) patients. Issues regarding reimbursement for the Medicare hospice benefit. Issues related to advanced care illness management. H.R. 647, Palliative Care and Hospice Education and Training Act and issues regarding access to palliative care. Issues related to regulatory relief. Issues regarding program integrity. Issues regarding co-location of healthcare entities.","S. 2080 / H.R. 647, Palliative Care and Hospice Education and Training Act and issues regarding access to palliative care.","Issues concerning access to the Medicare hospice benefit. S. 1190 / H.R. 2594, Rural Access to Hospice Act of 2019 and issues involving access to hospice for Rural Health Clinic (RHC) and Federally Qualified Health Clinic (FQHC) patients. Issues regarding reimbursement for the Medicare hospice benefit. Issues related to advanced care illness management. Issues related to regulatory relief. Issues regarding program integrity.","Monitored H.R. 4378, the Continuing Appropriations Act of 2020 and Health Extenders Act of 2019","Monitored H.R. 1158, the Consolidated Appropriations Act of 2020 and H.R. 1865, Further Consolidated Appropriations Act, 2020, as it relates to access to hospice for FQHC and RHC patients.","Issues concerning access to the Medicare hospice benefit. S. 1190 / H.R. 2594, Rural Access to Hospice Act of 2019 and issues involving access to hospice for Rural Health Clinic (RHC) and Federally Qualified Health Clinic (FQHC) patients. Issues regarding reimbursement for the Medicare hospice benefit. Issues related to advanced care illness management. Issues related to regulatory relief. S. 2807, Hospice Care Improvement Act of 2019 and issues regarding hospice program integrity.","Issues concerning access to the Medicare hospice benefit. S. 1190 / H.R. 2594, Rural Access to Hospice Act of 2019 and issues involving access to hospice for Rural Health Clinic (RHC) and Federally Qualified Health Clinic (FQHC) patients. Issues regarding reimbursement for the Medicare hospice benefit. Issues related to advanced care illness management. Issues related to regulatory relief. S. 2807, Hospice Care Improvement Act of 2019, H.R. 5821, Helping Our Senior Population in Comfort Environments Act, and issues regarding hospice program integrity. Coronavirus Aid, Relief and Economic Security Cares Act, P.L. 116-136, as it relates to COVID-19 funding for hospices.","Issues related to the We Honor Veterans program and bereavement services for Veterans. FY21 Military Construction, Veterans Affairs and Related Agencies Appropriations Act.","Securing PPE for hospice providers.","Issues concerning access to the Medicare hospice benefit. S. 1190 / H.R. 2594, Rural Access to Hospice Act of 2019 and issues involving access to hospice for Rural Health Clinic (RHC) and Federally Qualified Health Clinic (FQHC) patients. Issues regarding reimbursement for the Medicare hospice benefit. Issues related to advanced care illness management. Issues related to regulatory relief. S. 2807, Hospice Care Improvement Act of 2019, H.R. 5821, Helping Our Senior Population in Comfort Environments Act, and issues regarding hospice program integrity. Issues concerning Medicare Advantage and the hospice benefit.  Issues involving palliative care and issues involving inpatient respite care.  Issues involving hospice providers and The Cares Act provider relief fund. Issues related to the corona virus.","S. 2080 / H.R. 647, Palliative Care and Hospice Education and Training Act and issues regarding access to palliative care. H.R. 925 / H.R. 8406, The HEROES Act. S. 4317, SAFE TO WORK Act. S. 4322 Safely Back to School and Back to Work Act.","Issues concerning access to the Medicare hospice benefit. S. 1190 / H.R. 2594, Rural Access to Hospice Act of 2019 and issues involving access to hospice for Rural Health Clinic (RHC) and Federally Qualified Health Clinic (FQHC) patients. Issues regarding reimbursement for the Medicare hospice benefit. Issues related to community based palliative care and advanced care illness management. Issues related to regulatory relief. S. 2807, Hospice Care Improvement Act of 2019, H.R. 5821, Helping Our Senior Population in Comfort Environments Act, and issues regarding hospice program integrity. Issues concerning Medicare Advantage and the hospice benefit. S. 4423 / H.R. 8322, COVID-19 Hospice Respite Care Relief Act of 2020 and issues involving inpatient respite care.  Issues involving hospice providers and The Cares Act provider relief fund. Issues related to the corona virus. S. 2741 / H.R. 4931, CONNECT for Health Act of 2019 as it relates to use of telehealth in the recertification of a beneficiary for the hospice benefit. Monitored H.R. 8337, Continuing Appropriations Act, 2021 and Other Extensions Act.","S. 2080 / H.R. 647, Palliative Care and Hospice Education and Training Act and issues regarding access to palliative care. H.R. 925 / H.R. 8406, The HEROES Act. S. 4317, SAFE TO WORK Act. S. 4322 Safely Back to School and Back to Work Act. Issues related to covid testing and vaccine dissemination to hospice caregivers."],"years":[2018,2019,2020,2021,2022,2023,2024]}