{"id":186504,"name":"HR POLICY ASSOCIATION","slug":"hr-policy-association","state":"VA","description":null,"totalSpending":15220000,"filings":25,"yearlySpending":[{"year":2018,"income":2600000},{"year":2019,"income":2680000},{"year":2020,"income":2100000},{"year":2021,"income":3040000},{"year":2022,"income":3390000},{"year":2024,"income":960000},{"year":2025,"income":450000}],"firms":["TRIBUTARY LLP"],"lobbyists":["TIMOTHY BARTL","DANIEL YAGER","ELIZABETH ANDERSON","MARGARET FASO","DANIEL CHASEN","CHATRANE BIRBAL"],"issues":["FIN","HCR","LBR","SCI","TAX","GOV","RET"],"sampleDescriptions":["FIN1/4/2018 Meeting with SEC Staff concerning unfinished Dodd-Frank Executive Compensation rules.","HC1/17/2018Meeting with House Educ and Workforce staff re: opioid issue\nHC3/19/2018Meeting with DOL EBSA staff re: mental health parity issues\nHC3/27/2018Meeting with Rep. Chu's staff re: employer-sponsored health care issues\nHC3/27/2018Meeting with Rep. Kelly's staff re: employer-sponsored health care issues\nHC3/27/2018Meeting with Rep. Kind's staff re: employer-sponsored health care issues\nHC3/27/2018Meeting with Rep. Chu's staff re: employer-sponsored health care issues\nHC3/28/2018Meeting with Rep. Blumenauer's staff re: employer-sponsored health care issues\nHC3/28/2018Meeting with Rep. Buchanan's staff re: employer-sponsored health care issues\nHC3/28/2018Meeting with Rep. Nunes' staff re: employer-sponsored health care issues\nHC3/28/2018Meeting with Rep. Higgins' staff re: employer-sponsored health care issues\nHC3/29/2018Meeting with Rep. Reed's staff re: employer-sponsored health care issues","LBR1/8/2018Meeting with Senate HELP staff, introduction and review of issues generally\nLBR1/9/2018Meeting with Senate HELP Committee staff re: harassment and arbitration issues\nLBR1/19/2018Meeting with House Educ and Workforce staff re: workflex bill\nLBR2/13/2018Meeting with Rep. Ferguson's staff re: workflex bill\nLBR2/13/2018Meeting with Rep. Wilson's staff re: workflex bill\nLBR2/13/2018Meeting with Rep. Handel's staff re: workflex bill\nLBR2/14/2018Meeting with Rep. Byrne staff re: workflex bill\nLBR2/14/2018Meeting with Rep. Roe staff re: workflex bill\nLBR2/14/2018Meeting with Rep. Jason Lewis staff re: workflex bill\nLBR2/15/2018Meeting with Rep. Guthrie staff re: workflex bill\nLBR2/15/2018Meeting with Rep. Rokita staff re: workflex bill\nLBR2/20/2018Meeting with Rep. Messer staff re: workflex bill\nLBR2/20/2018Meeting with Rep. Grothman staff re: workflex bill\nLBR2/20/2018Meeting with Rep. Brat's staff re: workflex bill\nLBR2/21/2018Meeting with Rep. Mitchell's staff re: workflex bill\nLBR2/21/2018Meeting with Rep. Thompson's staff re: workflex bill\nLBR2/21/2018Meeting with Rep. Rooney's staff re: workflex bill\nLBR2/21/2018Meeting with Rep. Stefanik's staff re: workflex bill\nLBR2/22/2018Meeting with Senate HELP staff, get acquainted\nLBR2/22/2018Meeting with Rep. Aguilar staff re: workflex bill\nLBR2/22/2018Meeting with Rep. Murphy staff re: workflex bill\nLBR2/22/2018Meeting with Rep. Cardenas staff re: workflex bill\nLBR2/22/2018Meeting with Rep. Bera staff re: workflex bill\nLBR2/23/2018Meeting with DOL Wage and Hour staff re: workforce issues\nLBR2/27/2018Meeting with Rep. Cuellar staff re: workflex bill\nLBR2/27/2018Meeting with Rep. Sewell staff re: workflex bill\nLBR3/14/2018Meeting with Rep. Allen staff re: workflex bill\nLBR3/14/2018Meeting with Rep. David Young staff re: workflex bill\nLBR3/14/2018Meeting with Rep. Fitzpatrick staff re: workflex bill\nLBR3/15/2018Meeting with Rep. Byrne on workplace issues\nLBR3/15/2018Meeting with Sen. Murray, HELP staff on workplace issues\nLBR3/15/2018Meeting with Rep. Lipinski staff re: workflex bill\nLBR3/15/2018Meeting with Rep. Shrader staff re: workflex bill\nLBR3/20/2018Meeting with Rep. Soto staff re: workflex bill\nLBR3/20/2018Meeting with Rep. Kilmer staff re: workflex bill\nLBR3/20/2018Meeting with Rep. Castro staff re: workflex bill\nLBR3/21/2018Meeting with Rep. MacArthur's staff re: workflex bill\nLBR3/21/2018Meeting with Rep. Herrera Beutler's staff re: workflex bill\nLBR3/22/2018Meeting with Rep. Crowley's staff re: workflex bill\nLBR3/22/2018Meeting with Rep. Foster's staff re: workflex bill\nLBR3/27/2018Meeting with Rep. Kind's staff re: workflex bill\nLBR3/27/2018Meeting with Rep. O'Rourke's staff re: workflex bill\nLBR3/28/2018Meeting with Rep. Crist staff re: workflex bill\nLBR3/28/2018Meeting with Rep. Demmings staff re: workflex bill\nLBR3/28/2018Meeting with Rep. Custer staff re: workflex bill\nLBR3/29/2018Meeting with Rep. Scott staff re: workflex bill\nLBR3/29/2018Meeting with Rep. Rosen staff re: workflex bill\nLBR3/29/2018Meeting with Rep. OHalleran staff re: workflex bill\nLBR 2/15/2018Meeting with Rep. Barletta staff re: workflex bill","HC7/18/2018Meeting with Rep. Sam Johnson's staff re: employer-sponsored health care issues\nHC7/18/2018Meeting with Rep. Tim Walberg's staff re: employer-sponsored health care issues\nHC7/18/2018Meeting with Rep. Leonard Lance's staff re: employer-sponsored health care issues\nHC7/18/2018Meeting with Rep. Duncan Hunter's staff re: employer-sponsored health care issues\nHC7/23/2018Meeting with Sen. Portman's staff re: employer-sponsored health care issues\nHC7/24/2018Meeting with Rep. Warner's staff re: employer-sponsored health care issues\nHC7/24/2018Meeting with Rep. Toomey's staff re: employer-sponsored health care issues\nHC7/24/2018Meeting with Senate HELP Committee staff re: employer-sponsored health care issues\nHC7/24/2018Meeting with Rep. Perdue's staff re: employer-sponsored health care issues\nHC7/31/2018Meeting with Sen. Gradner's staff re: employer-sponsored health care issues\nHC7/31/2018Meeting with Sen. Young's staff re: employer-sponsored health care issues\nHC8/8/2018Meeting with Sen. Hassan's staff re: employer-sponsored health care issues","LBR7/12/2018Meeting with Rep. Banks staff re: workflex bill\nLBR7/12/2018Meeting with Rep. Roe staff re: workflex bill\nLBR7/12/2018Meeting with Rep. Francis Rooney staff re:  workflex bill\nLBR7/17/2018Meeting with Rep. Polis staff re: Workplace Dem. Act\nLBR7/17/2018Meeting with Rep. Sean Maloney staff re: Workplace Dem. Act\nLBR7/17/2018Meeting with Rep. Foster staff re: Workplace Dem. Act\nLBR7/17/2018Meeting with Rep. Moulton staff re: Workplace Dem. Act\nLBR7/18/2018Meeting with Rep. Barletta staff re: workflex bill\nLBR7/18/2018Meeting with Rep. Estes staff re: workflex bill\nLBR7/18/2018Meeting with Walberg staff, workflex bill\nLBR7/19/2018Meeting with Rep. Bonamici staff re: workflex bill\nLBR7/19/2018Meeting with Rep. Courtney staff re: workflex bill\nLBR7/19/2018Meeting with Rep. Sablan staff re: workflex bill\nLBR7/20/2018Meeting with Rep. Blunt Rochester staff re: workflex bill\nLBR7/23/2018Meeting with Rep. Fudge staff re: workflex bill\nLBR7/23/2018Meeting with Rep. Joe Wilson staff re: workflex bill\nLBR7/23/2018Meeting with Rep. F. Wilson staff re: workflex bill\nLBR8/8/2018Meeting with Senate HELP Committee staff re: NLRB issues\nLBR9/20/2018Meeting with Rep. McCarthy staff re: workflex bill\nLBR9/20/2018Meeting with Rep. Courtney staff re: Workplace Dem. Act\nLBR9/27/2018Meeting with Rep. Byrne and his staff re: EMPOWER Act","LBR7/12/2018Meeting with Rep. Banks staff re: workflex bill\nLBR7/12/2018Meeting with Rep. Roe staff re: workflex bill\nLBR7/12/2018Meeting with Rep. Francis Rooney staff re:  workflex bill\nLBR7/17/2018Meeting with Rep. Polis staff re: Workplace Dem. Act\nLBR7/17/2018Meeting with Rep. Sean Maloney staff re: Workplace Dem. Act\nLBR7/17/2018Meeting with Rep. Foster staff re: Workplace Dem. Act\nLBR7/17/2018Meeting with Rep. Moulton staff re: Workplace Dem. Act\nLBR7/18/2018Meeting with Rep. Barletta staff re: workflex bill\nLBR7/18/2018Meeting with Rep. Estes staff re: workflex bill\nLBR7/18/2018Meeting with Walberg staff, workflex bill\nLBR7/19/2018Meeting with Rep. Bonamici staff re: workflex bill\nLBR7/19/2018Meeting with Rep. Courtney staff re: workflex bill\nLBR7/19/2018Meeting with Rep. Sablan staff re: workflex bill\nLBR7/20/2018Meeting with Rep. Blunt Rochester staff re: workflex bill\nLBR7/23/2018Meeting with Rep. Fudge staff re: workflex bill\nLBR7/23/2018Meeting with Rep. Joe Wilson staff re: workflex bill\nLBR7/23/2018Meeting with Rep. F. Wilson staff re: workflex bill\nLBR8/8/2018Meeting with Senate HELP Committee staff re: NLRB issues\nLBR9/20/2018Meeting with Rep. McCarthy staff re: workflex bill\nLBR9/20/2018Meeting with Rep. Courtney staff re: Workplace Dem. Act\nLBR9/27/2018Meeting with Rep. Byrne and his staff re: EMPOWER Act \n\n7/31/18 Meeting in Senator Mitch McConnell's Office - Discussion regarding the pending NLRB nomination of former NLRB Member Mark Pearce.\n9/4/18 Meeting with Philip Miscimarra and Rob Green, House Committee on Education and the Workforce - Discussion regarding NLRB recusal rules and the pending nomination of former NLRB Member Mark Pearce.\n9/6/18 Meeting with Andy Banducci and Philip Miscimarra - Discussion regarding NLRB recusal rules and the pending nomination of former NLRB Member Mark Pearce.","FIN11/29/2018Meeting with Sen. Reed staff re: proxy advisors\nFIN11/29/2018Meeting with Sen. Perdue staff re: proxy advisors\nFIN12/3/2018Meeting with Sen. Tillis staff re: proxy advisors\nFIN12/3/2018Meeting with Sen. Kennedy staff re: proxy advisors","HC10/16/2018Meeting with Sen. Thune's staff re: employer-sponsored health care issues\nHC10/30/2018Meeting with Sen. Wyden's staff re: employer-sponsored health care issues\nHC11/1/2018Meeting with House Ways and Means Committee staff re: employer-sponsored health care issues\nHC11/28/2018Meeting with Treasury staff re: employer-sponsored health care issues\nHC12/20/2018Meeting with DOL staff re: employer-sponsored health care issues\nHC11/29/201Meeting with DOL and HHS staff re: employer-sponsored health care issues","LBR12/19/2018Meeting with Rep. Bobby Scott staff re: workplace issues\nLBR12/19/2018Meeting with Rep. Foxx staff re: workplace issues\nLBR10/3/2018Meeting with DOL staff re: general employment issues\nLBR10/17/2018Meeting with DOL staff re: overtime listening session\nLBR10/31/2018Meeting with EEOC staff re: workplace harassment issues\nLBR12/12/2018Meeting with Sen. Murray's staff re: workplace harassment and arbitration issues\nLBR12/12/2018Meeting with EEOC staff re: workplace harassment issues\nLBR12/19/2018Meeting with House Ed and Workforce staff re: general employment issues\nLBR12/22/2018Telephone conference with Senator McConnells office regarding NLRB nomination issues.","FIN1/8/2019Meeting with Rep. Duffy staff re: proxy advisors\nFIN2/12/2019Meeting with Rep. Fosters Staff RE: proxy advisory firms\nFIN2/21/2019Meeting with SEC Commissioner Roisman and Staff about Proxy Advisory Firms\nFIN3/20/2019Meeting with SEC Commissioner Peirce and Staff about Proxy Advisory Firms\nFIN3/20/2019Meeting with Staff of Division of Corporation Finance and Investment Management about Proxy Advisory Firms","HC1/22/2019Meeting with Rep. Allred's staff re: employer-sponsored health care issues\nHC1/24/2019Meeting with Rep. Green's staff re: employer-sponsored health care issues\nHC2/11/2019Meeting with DOL staff re: employer-sponsored health care issues\nHC2/14/2019Meeting with Sen. Cassidy's staff re: employer-sponsored health care issues\nHC2/14/2019Meeting with Sen. Carper's staff re: employer-sponsored health care issues\nHC2/14/2019Meeting with Sen. Hassan's staff re: employer-sponsored health care issues\nHC2/14/2019Meeting with Sen. Bennet's staff re: employer-sponsored health care issues\nHC2/14/2019Meeting with Sen. Murkowski's staff re: employer-sponsored health care issues\nHC3/4/2019Meeting with Senate HELP Committee staff re: employer-sponsored health care issues","LBR1/31/2019Meeting with Rep. Walker staff re: labor issues\nLBR1/31/2019Meeting with Rep. Meuser staff re: labor issues\nLBR1/31/2019Meeting with Rep. Wright staff re: labor issues\nLBR1/31/2019Meeting with Rep. Dusty Johnson staff re: labor issues\nLBR1/31/2019Meeting with Rep. Walker's staff re: general employment issues\nLBR1/31/2019Meeting with Rep. Wright's staff re: general employment issues\nLBR1/31/2019Meeting with Rep. Johnson's staff re: general employment issues\nLBR2/4/2019Meeting with Rep. Van Taylor staff re: labor issues\nLBR2/4/2019Meeting with Rep. Taylor's staff re: general employment issues\nLBR2/5/2019Meeting with Rep. Van Taylor staff re: labor issues\nLBR2/5/2019Meeting with Rep. Riggleman staff re: labor issues\nLBR2/5/2019Meeting with Rep. Craig staff re: labor issues\nLBR2/5/2019Meeting with Rep. Spanberger staff re: labor issues\nLBR2/8/2019Meeting with Rep. Byrne's staff re: general employment issues\nLBR2/12/2019Meeting with Rep. Foster staff re: labor issues\nLBR2/15/2019Meeting with Rep. Cline staff re: labor issues\nLBR2/19/2019Meeting with Rep. McAdams staff re: labor issues\nLBR2/19/2019Meeting with Rep. Small staff re: labor issues\nLBR2/19/2019Meeting with Rep. Spano staff re: labor issues\nLBR2/19/2019Meeting with Rep. Muscarsel-Powell staff re: labor issues\nLBR2/21/2019Meeting with House Ways and Means Committee staff re: general employment issues\nLBR3/1/2019Call with Rep. Stefanik staff re: workplace issues\nLBR3/1/2019Meeting with Rep. Stefanik's staff re: general employment issues\nLBR3/20/2019Meeting with Ways and Means staff re: workplace issues\nLBR3/20/2019Meeting with House Ways and Means Committee staff re: general employment issues\nLBR3/26/2019Meeting with Sen. Cassidy staff re: paid leave\nLBR3/26/2019Meeting with Help committee staff re: paid leave\nLBR3/28/2019Meeting with Ed and labor staff re: paid leave\nLBR3/28/2019Meeting with House Education and Labor Committee staff re: general employment issues","LBR4/10/2019Meeting with Sen. Fischer re: paid leave\nLBR4/11/2019Meeting with Rep. Stefanik's staff re: workplace issues\nLBR5/2/2019Meeting with House Ways and Means staff re: paid leave\nLBR6/6/2019Meeting with Rep. Houlihan staff re: paid leave\nLBR6/6/2019Meeting with Rep. Kilmer staff re: paid leave\nLBR6/11/2019Meeting with Representatives from Committee on Education and Labor regarding the Committee Labor and Employment Agenda for 2019","HC4/23/2019Meeting with  Rep. Ron Estes (R-KS-04) staff regarding ACA reporting requirements, surprise billing legislation \nHC4/23/2019Meeting Sean McCabe w/ Rep. Mark Walker (R-NC-06) regarding ACA reporting requirements, surprise billing legislation\nHC4/24/2019Meeting with Rep. Ferguson's staff re: employer sponosed HC issues\nHC4/25/2019 Meeting with Kelly Nickel w/ Rep. Kurt Schrader (D-OR-05) regarding ACA reporting requirements, surprise billing legislation \nHC4/25/2019Meeting with Maddie Daly w/ Rep. Jahana Hayes (D-CT-05) regarding ACA reporting requirements, surprise billing legislation \nHC4/25/2019Meeting with Lainey Lothian w/ Rep. Steven Watkins (R-KS-02) regarding ACA reporting requirements, surprise billing legislation \nHC4/25/2019Meeting with Kevin Dawson w/ Rep. Mike Kelly (R-PA-16) regarding ACA reporting requirements, surprise billing legislation \nHC4/25/2019Meeting with Madison Hardimon w/ Rep. Ron Wright (R-TX-06) regarding ACA reporting requirements, surprise billing legislation \nHC4/26/2019Meeting with Sam Morgante w/ Rep. Susie Lee (D-NV-03) regarding ACA reporting requirements, surprise billing legislation \nHC4/26/2019 Meeting with Carla McGarvey w/ Rep. Donna Shalala (D-FL-27) regarding ACA reporting requirements, surprise billing legislation \nHC4/26/2019Meeting with Josie Villanueva w/ Rep. Steven Horsford (D-NV-04) regarding ACA reporting requirements, surprise billing legislation \nHC5/28/2019Meeting with Rep. Jordan's staff re: employer sponsored health care\nHC5/29/2019Meeting with William Seabrook w/ Rep. Susan Davis (D-CA-53) regarding ACA reporting requirements, surprise billing legislation \nHC5/29/2019Meeting with Sarah Gilbert w/ Rep. George Holding (R-NC-02) regarding ACA reporting requirements, surprise billing legislation \nHC5/29/2019Meeting with Rep. Craig's staff re: employer sponsored HC issues\nHC6/6/2019Meeting with Rep. Villaueva's staff re: employer sponsored HC \nHC6/12/2019Meeting with Rep. Meadows' staff re: employer sponsored HC \nHC6/20/2019Meeting with Laila Goharioon w/ Rep. Linda Sanchez (D-CA-38) regarding ACA reporting requirements, surprise billing legislation \nHC6/20/2019Meeting with Rep. Schweikert's staff re: employer sponsored HC \nHC6/20/2019Meeting with Rep. Sewell's staff re: employer sponsored HC \nHC6/20/2019Meeting with Rep. Wenstrup's staff re:employer sponsored health care issues\nHC6/24/2019Meeting with Sen. Collins' staff re: employer sponsored health care issues\nHC6/24/2019Meeting with Sen Hyde Smith's staff re: employer sponsored health care issues\nHC6/24/2019Meeting with Sen. Braun's staff re: employer sponsored health care issues\nHC6/24/2019Meeting with Sen. Carper's staff re: employer sponsored health care issues\nHC6/25/2019Meeting with Senate HELP staff re: employer sponsored health care issues\nHC6/26/2019Meeting with Rep. Barragan's staff re: employer sponsored health care issues\nHC 5/29/2019Meeting with Rep. McMorris Rodgers staff re: employer sponsored health care","Labor8/20/2019Meeting with White House staff re: paid leave issues","FIN7/1/2019Meeting with House Financial Services Committee Staff on Board Diversity Legislation\nFIN7/9/2019Meeting with House Financial Services Committee Staff on Board Diversity Legislation\nFIN7/11/2019Meeting with Rep. Beatty's Staff on Board Diversity Legislation","Health7/1/2019Meeting with Rep. Brindisi's staff re: employer-sponsored health care issues\nHealth7/8/2019Meeting with Rep. Wilson's staff re: employer-sponsored health care issues\nHealth7/8/2019Meeting with Sen. Romney's staff re: employer-sponsored health care issues\nHealth7/8/2019Meeting with Rep. McMorris-Rogers' staff re: employer-sponsored health care issues\nHealth7/9/2019Meeting with Rep. Robin Kelly's staff re: employer-sponsored health care issues\nHealth7/9/2019Meeting with Rep. Schrader's staff re: employer-sponsored health care issues\nHealth7/9/2019Meeting with Rep. Mike Thompson's staff re: employer-sponsored health care issues\nHealth7/9/2019Meeting with Rep. Matsui's staff re: employer-sponsored health care issues\nHealth7/9/2019Meeting with Senate HELP Committee staff re: employer-sponsored health care issues\nHealth7/10/2019Letter to House Energy and Commerce Committee staff re: employer-sponsored health care issues\nHealth7/15/2019Meeting with Rep. Olson's staff re: employer-sponsored health care issues\nHealth7/16/2019Meeting with Rep. Olson's staff re: employer-sponsored health care issues\nHealth7/16/2019Meeting with Rep. Kinzinger's staff re: employer-sponsored health care issues\nHealth7/16/2019Meeting with Rep. Welch's staff re: employer-sponsored health care issues\nHealth7/16/2019Meeting with Rep. Tonko's staff re: employer-sponsored health care issues\nHealth7/16/2019Meeting with Rep. Cardenas' staff re: employer-sponsored health care issues\nHealth7/17/2019Meeting with Sen. Risch's staff re: employer-sponsored health care issues\nHealth7/17/2019Meeting with Sen. Gardner's staff re: employer-sponsored health care issues\nHealth7/17/2019Meeting with Sen. Cruz's staff re: employer-sponsored health care issues\nHealth7/17/2019Meeting with Sen. Shelby's staff re: employer-sponsored health care issues\nHealth7/17/2019Meeting with Rep. Scalise's staff re: employer-sponsored health care issues\nHealth7/23/2019Meeting with Sen. Boozman's staff re: employer-sponsored health care issues\nHealth7/23/2019Meeting with Sen. Fischer's staff re: employer-sponsored health care issues\nHealth7/24/2019Meeting with Rep. Foxx's staff re: employer-sponsored health care issues\nHealth7/24/2019Meeting with Rep. Cline's staff re: employer-sponsored health care issues\nHealth7/26/2019Coalition meeting with Rep. Craig on health care\nHealth7/29/2019Meeting with Rep. Gomez's staff re: employer-sponsored health care issues\nHealth7/29/2019Meeting with Rep. Meuser's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. Chu's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. Levin's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. VanNess's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. DeGette's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. Doyle's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. Bilirakis' staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. Clarke's staff re: employer-sponsored health care issues\nHealth7/30/2019Meeting with Rep. Schakowsky's staff re: employer-sponsored health care issues\nHealth7/31/2019Meeting with Rep. Fudge's staff re: employer-sponsored health care issues\nHealth7/31/2019Meeting with Rep. Harder's staff re: employer-sponsored health care issues\nHealth7/31/2019Meeting with Rep. Trone's staff re: employer-sponsored health care issues\nHealth8/1/2019Meeting with Rep. Hayes' staff re: employer-sponsored health care issues\nHealth8/1/2019Meeting with Rep. Adrian Smith's staff re: employer-sponsored health care issues\nHealth8/5/2019Meeting with Sen. McConnell's staff re: employer-sponsored health care issues\nHealth8/5/2019Meeting with Sen. Thune's staff re: employer-sponsored health care issues\nHealth8/7/2019Meeting with Rep. Pocan's staff re: employer-sponsored health care issues\nHealth8/7/2019Meeting with House Energy and Commerce Committee staff re: employer-sponsored health care issues\nHealth8/7/2019Meeting with Rep. Duncan's staff re: employer-sponsored health care issues\nHealth8/8/2019Meeting with Rep. Mike Kelly's staff re: employer-sponsored health care issues\nHealth8/8/2019Meeting with Rep. Arrington's staff re: employer-sponsored health care issues\nHealth8/8/2019Meeting with Rep. Kildee's staff re: employer-sponsored health care issues\nHealth8/14/2019Meeting with Senate HELP Committee staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Tanko's staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Delbene's staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Trone's staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Sablan's staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Latta's staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Furguson's staff re: employer-sponsored health care issues\nHealth8/21/2019Meeting with Rep. Dusty Johnson's staff re: employer-sponsored health care issues\nHealth8/22/2019Meeting with Rep. Timmons' staff re: employer-sponsored health care issues\nHealth8/22/2019Meeting with Rep. Keller's staff re: employer-sponsored health care issues\nHealth8/22/2019Meeting with Rep. Byrne's staff re: employer-sponsored health care issues\nHealth8/26/2019Meeting with HHS staff re: employer-sponsored health care issues\nHealth8/27/2019Meeting with Rep. Wenstrup's staff re: employer-sponsored health care issues\nHealth9/3/2019Meeting with Senate Finance Committee staff re: employer-sponsored health care issues\nHealth9/10/2019Meeting with Rep. Keller's staff re: employer-sponsored health care issues\nHealth9/10/2019Meeting with Rep. Comer's staff re: employer-sponsored health care issues\nHealth9/10/2019Meeting with Rep. Kind's staff re: employer-sponsored health care issues\nHealth9/10/2019Meeting with Rep. Timmons' staff re: employer-sponsored health care issues\nHealth9/11/2019Meeting with Rep. Marchant's staff re: employer-sponsored health care issues\nHealth9/11/2019Meeting with Rep. Wright's staff re: employer-sponsored health care issues\nHealth9/11/2019Meeting with Rep. Walorski's staff re: employer-sponsored health care issues\nHealth9/12/2019Meeting with Rep. Smucker's staff re: employer-sponsored health care issues\nHealth9/12/2019Meeting with House Ways and Means Committee staff re: employer-sponsored health care issues\nHealth9/25/2019Meeting with Rep. Pelosi's staff re: employer-sponsored health care issues","Science/Technology9/12/2019Meeting with Sen. Cantwell staff on employer data privacy\nScience/Technology9/12/2019Meeting with Chm Walden staff on employer data privacy\nScience/Technology9/12/2019Meeting with Rep. Craig staff on privacy","FIN10/21/2019Meeting with OCC Staff re: Dodd-Frank 956","Health10/2/2019Meeting with Rep. Duncan re employer sponsored health care issues\nHealth10/2/2019Meeting with Rep. J. Smith staff re employer sponsored health care issues\nHealth10/2/2019Meeting with Rep. Butterfield staff re employer sponsored health care issues\nHealth10/2/2019Meeting with Rep. DeGette staff re employer sponsored health care issues\nHealth10/9/2019Meeting with Sen. T. Scott staff re employer sponsored health care issues\nHealth10/9/2019Meeting with Sen. Paul staff re employer sponsored health care issues\nHealth10/10/2019Meeting with House Ways and Means Committee staff on employer sponsored health care issues\nHealth10/10/2019Meeting with Sen. Hassan staff on employer sponsored health care issues\nHealth10/10/2019Meeting with Sen. Daines staff on employer sponsored health care issues\nHealth10/10/2019Meeting with Sen. S. Brown staff on employer sponsored health care issues\nHealth10/10/2019Meeting with Sen. Stabenow staff on employer sponsored health care issues\nHealth10/30/2019Meeting with House Energy and Commerce Committee staff on employer sponsored health care issues\nHealth10/30/2019Meeting with Sen. S. Kaine staff on employer sponsored health care issues\nHealth11/1/2019Meeting with WH DPC, NEC staff re employer sponsored health care issues\nHealth11/5/2019Meeting with Sen. Cassidy staff on employer sponsored health care issues\nHealth11/5/2019Meeting with Sen. Hassan staff on employer sponsored health care issues\nHealth11/14/2019Meeting with Rep. Hoyer staff re employer sponsored health care issues\nHealth11/20/2019Meeting with Sen. McConnell staff re employer sponsored health care issues\nHealth11/21/2019Meeting with Sen. Rosen staff re employer sponsored health care issues\nHealth11/21/2019Meeting with Sen. Toomey staff re employer sponsored health care issues\nHealth11/21/2019Meeting with Sen. Cotton staff re employer sponsored health care issues\nHealth11/21/2019Meeting with Sen. Ernst staff re employer sponsored health care issues\nHealth11/21/2019Meeting with Sen. McSally staff re employer sponsored health care issues\nHealth11/21/2019Meeting with Sen. Capito staff re employer sponsored health care issues"],"years":[2018,2019,2020,2021,2022,2024,2025]}