{
  "id": 184866,
  "name": "HUDSON TECHNOLOGIES",
  "slug": "hudson-technologies",
  "state": "NY",
  "description": "Specializes in refrigerant reclamation &amp; optimizing energy efficiency of existing systems",
  "totalSpending": 1670000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 220000
    },
    {
      "year": 2019,
      "income": 170000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 180000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 140000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "HEATHER PODESTA",
    "BENJAMIN KLEIN",
    "LARISSA MARTINEZ",
    "LANDON STROPKO",
    "QUINCY ENOCH",
    "LOGAN HOLLERS",
    "IAN FOLEY",
    "JARED SONCRANT",
    "ANNIE D'AMATO",
    "DOUGLAS DZIAK"
  ],
  "issues": [
    "ENV",
    "SMB",
    "TRD",
    null,
    "DEF"
  ],
  "sampleDescriptions": [
    "Educate Members of Congress and Administration officials about reclaimed refrigerants; monitor efforts related to an international phase-out of HFC refrigerants and related legislation, including S. 2448, the American Innovation and Manufacturing Act of 2018; support H.R. 2269, the Federal Refrigerant Management and Stewardship Act.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants; encourage support for the international phase-out of HFC refrigerants and related legislation, including S. 2448, the American Innovation and Manufacturing Act of 2018; support H.R. 2269, the Federal Refrigerant Management and Stewardship Act.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to refrigerant management; encourage support for the international phase-out of HFC refrigerants and related legislation, including S. 2448, the American Innovation and Manufacturing Act of 2018; support H.R. 2269, the Federal Refrigerant Management and Stewardship Act.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to refrigerant management; encourage support for the international phase-out of HFC refrigerants and related legislation.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to refrigerant management; support the American Innovation and Manufacturing Act of 2019.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to refrigerant management; support the American Innovation and Manufacturing Act of 2019 (S. 2754 and H.R. 5544); monitor the Advanced Geothermal Innovation Leadership Act (S. 2657 - legislative vehicle for Senate energy bill).",
    "Advocate for access to small business lending programs, including in H.R. 748, the CARES Act.",
    "Educate policymakers on Commerce proceedings regarding HFC blend components.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to refrigerant management; support the American Innovation and Manufacturing Act of 2019 (S. 2754 and H.R. 5544) and related provisions in H.R. 4447, the Clean Economy Jobs and Innovation Act; monitor the Advanced Geothermal Innovation Leadership Act (S. 2657 - legislative vehicle for Senate energy bill).",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to refrigerant management; support the American Innovation and Manufacturing Act of 2019 (S. 2754 and H.R. 5544) and related provisions in H.R. 4447, the Clean Economy Jobs and Innovation Act, and H.R. 133, the Consolidated Appropriations Act, 2021.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to the implementation of the American Rescue Plan Act of 2021 (P.L. 117-2).",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and issues related to the implementation of The American Innovation and Manufacturing Act (P.L. 116-260), including ensuring reclaimers have access to virgin HFC components.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and advocate for issues related to the implementation of P.L.116-260, The American Innovation and Manufacturing Act (AIM ACT). Support funding for reclamation under the AIM Act in the fiscal year (FY) 2025 Interior and Environment Appropriations Bill.",
    "Discuss the implementation of P.L.116-260, The American Innovation and Manufacturing Act (AIM ACT) and Hudson's support work for the Department of Defense.",
    "Educate Members of Congress and Administration officials about reclaimed refrigerants and advocate for issues related to the implementation of P.L. 116-260, The American Innovation and Manufacturing Act (AIM ACT). Support funding for reclamation under the AIM Act."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 9,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 208750,
  "peakYear": 2020,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 4,
  "industry": "technology"
}