{
  "id": 197328,
  "name": "IBM",
  "slug": "ibm",
  "state": "DC",
  "description": "technology, software &amp; services",
  "totalSpending": 1450000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 150000
    },
    {
      "year": 2020,
      "income": 150000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "KAMINS CONSULTING"
  ],
  "lobbyists": [
    "SCOTT KAMINS"
  ],
  "issues": [
    "TRD",
    "EDU",
    "CPI",
    "CPT",
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "Provisions that would protect the ability to move data across borders freely and that limit government requirements to store data on servers within national boundaries.  Potential renegotiation of the North American Free Trade Agreement.  H.R. 4311/S. 2098, the Foreign Investment Risk Review Modernization Act, provisions relating to potential review of outbound international commercial activity.",
    "H.R. 2353, Reauthorization of the Carl D. Perkins Perkins CTE Act to improve the supply of workforce-ready graduates, align CTE programs to local, state, and regional market needs, and support collaboration between secondary and post-secondary institutions and employers.",
    "H.R. 1770/S. 760, the Open Government Data Act; S.1671, the International Communications Privacy Act, proposals that would enhance digital privacy protections while imposing legal safeguards on government access to data; H.R. 589, exascale computing research program. S.1693/H.R. 1865, Stop Enabling Sex Traffickers Act, provisions to  to prevent new technologies and online services from being abused by criminals.",
    "Patent reform; provisions relating to software patents",
    "The Tax Cuts and Jobs Act; proposals relating to changes to the tax treatment of foreign earnings, base erosion and anti-abuse tax.",
    "H.R. 1770/S. 760, the Open Government Data Act; S.1671, the International Communications Privacy Act, proposals that would enhance digital privacy protections while imposing legal safeguards on government access to data; H.R. 589, exascale computing research program.",
    "Provisions that would protect the ability to move data across borders freely and that limit government requirements to store data on servers within national boundaries, U.S.-Mexico-Canada Agreement.  China trade tariffs.",
    "Higher Education Act, provisions relating to work study programs, workforce Pell grants, federal student loans.",
    "Regulations relating to implementation of the base erosion and anti-abuse tax.",
    "U.S. Mexico Canada Free Trade Agreement, particularly provisions allowing the free movement of data across borders, prohibiting requirements to store or process data locally, ensuring free and fair market access for digital goods and services, and protecting source code, algorithms and other sensitive IP from disclosure requirements.  U.S.-China trade issues.  U.S. Department of Commerce on Advance Notice of Proposed Rulemaking concerning review of export controls for certain emerging technologies.",
    "legislative proposals to protect the contribution that software inventions make to the U.S. economy",
    "Legislative proposals to update the Higher Education Act, particularly provisions designed to reform work-study programs, expand Pell Grants to individuals in the workforce, and increase flexibility around federal student loans.",
    "Legislative proposals related to AI, blockchain, and quantum computing",
    "Legislative proposals to update the Higher Education Act, particularly provisions designed to reform work-study programs, expand Pell Grants to individuals in the workforce, and increase flexibility around federal student loans.  Jumpstart Our Businesses By Supporting Students (JOBS) Act, provisions that would close this skills-gap by expanding Pell Grant eligibility to cover high-quality and rigorous short-term job training programs.",
    "Legislative proposals related to AI, blockchain, and quantum computing.  Legislative proposals relating to a federal data privacy framework.",
    "U.S. Mexico Canada Free Trade Agreement, particularly provisions allowing the free movement of data across borders, prohibiting requirements to store or process data locally, ensuring free and fair market access for digital goods and services, and protecting source code, algorithms and other sensitive IP from disclosure requirements.  U.S.-China trade issues.",
    "Legislative proposals related to AI, blockchain, a competitive 5G market based on open technologies, Section 230 reform, and quantum computing (the National Quantum Initiative).  Legislative proposals relating to a federal data privacy framework.  The National Artificial Intelligence Initiative Act, the EARN IT Act, the Creating Helpful Incentives to Produce Semiconductors for America Act, the American Foundries Act.",
    "U.S.-China trade and supply chain issues.",
    "U.S.-China trade policy matters. Commerce Department Rule on Securing the Information and Communications Technology and Services Supply Chain. Section 301 tariff issues.",
    "Legislative proposals related to AI, blockchain, a competitive 5G market based on open technologies, Section 230 reform, quantum computing. Legislative proposals relating to a federal data privacy framework. The Endless Frontiers Act, proposals to stimulate domestic design and production of semiconductors. Implementation of the CHIPS for America Act provisions of the National Defense Authorization Act."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 181250,
  "peakYear": 2018,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 5,
  "industry": "technology"
}