{"id":127169,"name":"ICKES & ENRIGHT GROUP (NORTHWELL HEALTH FKA NORTH SHORE-LIJ)","slug":"ickes-enright-group-northwell-health-fka-north-shore-lij","state":"DC","description":"Government relations.","totalSpending":3190000,"filings":32,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":450000},{"year":2020,"income":450000},{"year":2021,"income":430000},{"year":2022,"income":440000},{"year":2023,"income":440000},{"year":2024,"income":220000},{"year":2025,"income":440000}],"firms":["TIBER CREEK GROUP"],"lobbyists":["ANDREW MCKECHNIE","LINDSEY LEDWIN","SEAN RICHARDSON","COREY MALMGREN"],"issues":["BUD","TAX","MMM","HCR","MED","FIR",null,"GOV","DIS"],"sampleDescriptions":["Budget and Appropriations for FY2018 particularly related to NIH, opioids","Tax Cuts and Jobs Act of 2017 Public Law 115-97 issues related to hospitals","Issues related to funding for medical research; Issues related to implementation of the Medicare Access and CHIP Reauthorization Act (PL: 114-10) and health care delivery system reforms; the Independence at Home Act (S 464). Funding for graduate medical education (GME); Disproportionate Share Hospital Funding","Issues related to funding for medical research; Health care delivery system reforms; funding for graduate medical education (GME); Disproportionate Share Hospital Funding","Budget and Appropriations for FY2019 particularly related to NIH, opioids","Issues related to funding for medical research; Health care delivery system reforms; funding for graduate medical education (GME)","Issues related to implementation of the Medicare Access and CHIP Reauthorization Act (PL: 114-10) and health care delivery system reforms;  Funding for graduate medical education (GME)","Issues related to funding for medical research; Health care delivery system reforms;  Funding for graduate medical education. Funding for graduate medical education. H.R. 2267/S. 1301, Resident Physician Shortage Reduction Act of 2017, FY19 appropriations for NIH funding; general opioid issues, H.R. 6 SUPPORT Patients and Communities Act","Issues related to funding for medical research; Health care delivery system reforms. Funding for graduate medical education. H.R. 2267/S. 1301, Resident Physician Shortage Reduction Act of 2017, FY19 appropriations for NIH funding; general opioid issues, H.R. 6 SUPPORT Patients and Communities Act","Issues related to organ transplantation","General Medicaid/Medicare issues, funding for graduate medical education","General bioelectronic medicine issues","General Medicaid/Medicare issues, eligibility for emergency transport demonstration, Opioid Workforce Act H.R. 2439, Resident Physician Shortage Reduction Act of 2019 H.R. 1763/S. 348","Never Forget the Heroes Act (H.R. 1327/S. 546)","General Medicaid/Medicare issues, general surprise billing issues, Opioid Workforce Act H.R. 2439, Resident Physician Shortage Reduction Act of 2019 H.R. 1763/S. 348","General Medicaid/Medicare issues, general surprise billing issues, Opioid Workforce Act (H.R. 2439), Resident Physician Shortage Reduction Act of 2019 (H.R. 1763/S. 348), Opioid Workforce Act of 2019 (S.2892), Medicare Star Rating Program","General Medicaid/Medicare issues, Opioid Workforce Act (H.R. 2439), Resident Physician Shortage Reduction Act of 2019 (H.R. 1763/S. 348), Opioid Workforce Act of 2019 (S.2892), Issues related to surprise billing","Coronavirus Preparedness and Response Supplemental Appropriations Act (Public Law No. 116-123). Families First Coronavirus Response Act (Public Law No. 116-127). Coronavirus Aid, Relief, and Economic Security (CARES) Act (Public Law No. 116-136). Paycheck Protection Program and Health Care Enhancement Act (Public Law No. 116-139). H.R. 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act. General Safety Nets funds. Medical Nutrition Therapy Act of 2020 (H.R. 6971)","General Medicaid/Medicare issues; Issues related to surprise billing; HR 7292 COVID-19 Hospital Forgiveness","NIH Gun Violence Prevention grant proposal"],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}