{"id":206746,"name":"INFUSION PROVIDERS ALLIANCE","slug":"infusion-providers-alliance","state":"DE","description":"Association representing infusion drug providers.","totalSpending":1200000,"filings":15,"yearlySpending":[{"year":2020,"income":120000},{"year":2021,"income":160000},{"year":2022,"income":320000},{"year":2024,"income":240000},{"year":2025,"income":360000}],"firms":["THE MCMANUS GROUP"],"lobbyists":["JOHN MCMANUS","ALANNA TEMME","LAWREN GEER","ALEX WHALEN"],"issues":["MMM","HCR"],"sampleDescriptions":["Issues related to Medicare Part B.","Access to Part B drugs.","Access to Part B drugs. \n\nMost Favored Nation (MFN) Model, (CMS-5528-IFC).\n\nExtension of Medicare sequester delay in Division N Sec. 102 of H.R. 133 The Consolidated Appropriations Act of 2020.","Access and appropriate reimbursement to Part B drugs.\n\nExtension to Medicare sequester delay in S. 748 - A Bill to Provide for an Extension of the Temporary Suspension of Medicare Sequestration During the COVID-19 Public Health Emergency, H.R. 1868 - To Prevent Across-The-Board Direct Spending Cuts, and For Other Purposes, H.R. 315 - Medicare Sequester COVID Moratorium Act and H.R.1999 - To delay and offset the sequester under the Statutory Pay-As-You-Go Act of 2010 as a result of the enactment of the American Rescue Plan Act of 2021, and for other purposes.","Access and appropriate reimbursement of Part B drugs in clinic setting and provisions included in Subtitle J of H.R. 5376 - Build Back Better Act.\n\nSupport of reinstating step therapy prohibition in Medicare Advantage Plans for Part B drugs.\n\nIssues related to provider payment cuts addressed in S. 610 - Protecting Medicare and American Farmers from Sequester Cuts Act and H.R. 6143 - Supporting Health Care Providers During the COVID-19 Pandemic Act.","Access and appropriate reimbursement of Part B drugs in clinic setting and provisions included in Subtitle J of H.R. 5376 - Build Back Better Act. Issues related to downcoding of certain complex Part B drugs by regional Medicare Administrative Contractors (MACs). Support for site neutrality policies. Access to Alzheimer's Disease therapies.","Access and appropriate reimbursement of Part B drugs in clinic setting and provisions included in Subtitle J of H.R. 5376 - Build Back Better Act and Senate reconciliation bill. Issues related to downcoding of certain complex Part B drugs by regional Medicare Administrative Contractors (MACs). Support for site neutrality policies.","Policies to remove barriers to physician prescribing decisions including in H.R. 2163/S.464 - Safe Step Act of 2021.","Access and appropriate reimbursement of Part B drugs in clinic setting and provisions included in Title I-Subtitle B of P.L. 117-169/H.R. 5376 - Inflation Reduction Act of 2022. Issues related to downcoding of certain complex Part B drugs by regional Medicare Administrative Contractors (MACs). Support for site neutrality policies. Issues related to physician payments included in H.R.8800 - Supporting Medicare Providers Act of 2022.","Access and appropriate reimbursement of Part B drugs in clinic setting and provisions included in Title I-Subtitle B of P.L. 117-169/H.R. 5376 - Inflation Reduction Act of 2022. Issues related to downcoding of certain complex Part B drugs by regional Medicare Administrative Contractors (MACs). Support for site neutrality policies. Issues related to payments cuts to the Medicare Physician Fee Schedule including in H.R.8800 - Supporting Medicare Providers Act of 2022 and Sec. 4112 of H.R. 2617 - Consolidated Appropriations Act of 2023 (P.L. No: 117-328)/","Implementation of provisions included in Subtitle B of PL. 117-169 - Inflation Reduction Act of 2022. HR 5391, S. 2764, Protecting Patient Access to Cancer and Complex Therapies Act. Issues related to White Bagging. Issues related to virtual supervision of infusion drugs. Issues related to down coding of certain complex Part B drugs by regional Medicare Administrative Contractors (MACs).","Issues related to the CHANGE Healthcare Cyber-Attack Support for site neutrality policies including in H.R. 3561 - the Promoting Access to Treatments and Increasing Extremely Needed Transparency Act of 2023 or the PATIENT Act of 2023. Advocating for access to biosimilars. S. 652/HR 2630, Safe Step Act. S. 1375/HR 830, HELP Copays Act. Access to Alzheimer's Disease therapies.","Support for site neutrality policies including in H.R. 3561 - the Promoting Access to Treatments and Increasing Extremely Needed Transparency Act of 2023 or the PATIENT Act of 2023. Advocating for access to biosimilars.","Implementation of provisions included in Subtitle B of PL. 117-169 - Inflation Reduction Act of 2022. HR 5391, S. 2764, Protecting Patient Access to Cancer and Complex Therapies Act. Issues related to White Bagging. Issues related to virtual supervision of infusion drugs. Issues related to down coding of certain complex Part B drugs by regional Medicare Administrative Contractors (MACs). Extension of certain telehealth flexibilities included in H.R. 10545 the American Relief Act, 2025 Issues related to MACRA Reform including HR 2474 - Strengthening Medicare for Patients and Providers Act. Issues related to physician payment included in H.R.10445 - Further Continuing Appropriations and Disaster Relief Supplemental Appropriations Act.","Advocating for access to biosimilars.","Implementation of provisions included in Subtitle B of PL.117-169-Inflation Reduction Act of 2022. Issues related to physician reimbursement for Part B drugs. Issues related to virtual supervision of infusion drugs. H.R. 879 Medicare Patient Access and Practice Stabilization Act Issues related to physician reimbursement to complex drug administration. Issues related to appropriate reimbursement for administration of Part B drugs.","Advocating for access to and reimbursement for biosimilars. Issues related to patient access to infusion products for asthma and allergies.","Implementation of provisions included in Subtitle B of PL.117-169-Inflation Reduction Act of 2022. Issues related to physician reimbursement for Part B drugs. Issues related to virtual supervision of infusion drugs. H.R. 879 Medicare Patient Access and Practice Stabilization Act Issues related to physician reimbursement to complex drug administration. Issues related to appropriate reimbursement for administration of Part B drugs. H.R. 4299, Protecting Patient Access to Cancer and Complex Therapies Act","Advocating for access to and reimbursement for biosimilars.","Implementation of provisions included in Subtitle B of PL.117-169-Inflation Reduction Act of 2022. Issues related to physician reimbursement for Part B drugs. Issues related to virtual supervision of infusion drugs. Issues related to physician reimbursement to complex drug administration. Issues related to appropriate reimbursement for administration of Part B drugs. H.R. 4299, Protecting Patient Access to Cancer and Complex Therapies Act Issues related to the 2026 Medicare Physician Fee Schedule Proposed Rule (CMS-1832-P)."],"years":[2020,2021,2022,2024,2025]}