{
  "id": 131710,
  "name": "INTERMOUNTAIN HEALTH",
  "slug": "intermountain-health",
  "state": "UT",
  "description": null,
  "totalSpending": 1340000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 170000
    },
    {
      "year": 2019,
      "income": 160000
    },
    {
      "year": 2020,
      "income": 140000
    },
    {
      "year": 2021,
      "income": 160000
    },
    {
      "year": 2022,
      "income": 140000
    },
    {
      "year": 2023,
      "income": 180000
    },
    {
      "year": 2024,
      "income": 170000
    },
    {
      "year": 2025,
      "income": 220000
    }
  ],
  "firms": [
    "MCDERMOTT WILL & SCHULTE LLP"
  ],
  "lobbyists": [
    "KAREN SEALANDER",
    "DEBRA CURTIS",
    "RODNEY WHITLOCK"
  ],
  "issues": [
    "BUD",
    "HCR",
    "MMM",
    null
  ],
  "sampleDescriptions": [
    "Issues relating to accurately identifying patients to their records.",
    "Issues affecting integrated health care delivery systems including health care reform implementation and health information technology legislation and regulation.",
    "Issues relating to helping Medicare and Medicaid beneficiaries live their healthiest lives possible; issues relating to Medicare Advantage; issues relating to operational efficiencies of plans, including timing for Medicaid rate approvals.",
    "Issues affecting integrated health care delivery systems including movement to value-based payment and health information technology legislation and regulation.",
    "Issues affecting integrated health care delivery systems including movement to value-based payment and health information technology legislation and regulation, and including advancing interoperability.",
    "Issues affecting integrated health care delivery systems including movement to value-based payment and health information technology legislation and regulations, including efforts to accurately identify patients to their data and efforts to advance interoperability.",
    "Issues affecting integrated health care delivery systems including movement to value-based payment; health information technology legislation and regulation, including efforts to accurately identify patients to their data and efforts to advance interoperability; and efforts to address the health impacts of the coronavirus.",
    "Issues relating to helping Medicare and Medicaid beneficiaries live their healthiest lives possible, including issues relating to Medicare Advantage; issues relating to operational efficiencies of plans, including timing for Medicaid rate approvals; issues relating to accurately identifying patients to their data; and issues relating to the health impacts of the coronavirus.",
    "Issues relating to helping Medicare and Medicaid beneficiaries live their healthiest lives possible, including issues relating to Medicare Advantage; issues relating to accurately identifying patients to their data; and issues relating to the health impacts of the coronavirus.",
    "Remove Section 510 that prohibits the promulgation or adoption of a unique patient health identifier so that patients can consistently and accurately be connecting to their health information.",
    "Issues affecting integrated health care delivery systems including movement to value-based payment; health information technology legislation and regulation, including efforts to accurately identify patients to their data, efforts to advance interoperability, and efforts to enhance cybersecurity including promoting the sharing of cyber threat indicators and defensive measures; and efforts to address the health impacts of the coronavirus.",
    "Issues relating to helping Medicare and Medicaid beneficiaries live their healthiest lives possible, including issues relating to Medicare Advantage; issues relating to accurately identifying patients to their data; issues relating to cybersecurity; and issues relating to the health impacts of the coronavirus.",
    "Issues affecting integrated health care delivery systems including accelerating the movement to value-based payment; leveraging health information technology to improve care, including virtual care; efforts to advance interoperability, including efforts to accurately identify patients to their data; and efforts to enhance cybersecurity preparedness and resilience.",
    "Issues affecting integrated health care delivery systems including advancing proactive care; leveraging health information technology to improve care, including virtual care; efforts to advance interoperability, including efforts to accurately identify patients to their data; efforts to enhance cybersecurity preparedness and resilience; and advancing HR 7379, the Patient Matching and Transparency in Certified Health IT (MATCH IT) Act of 2024.",
    "Remove Section 510 that prohibits the promulgation or adoption of a unique patient health identifier so that patients can consistently and accurately be connecting to their health information; support FY 2025 Community Project Funding for the City of Wells, Nevada hybrid - click and mortar - medical clinic.",
    "Issues affecting integrated health care delivery systems including advancing proactive care; leveraging health information technology to improve care, including virtual care; efforts to advance interoperability, including efforts to accurately identify patients to their data; efforts to enhance cybersecurity preparedness and resilience; efforts to protect the privacy of individually identifiable health information; and advancing HR 7379, the Patient Matching and Transparency in Certified Health IT (MATCH IT) Act of 2024.",
    "Issues affecting integrated health care delivery systems including advancing proactive care; leveraging health information technology to improve care, including virtual care; efforts to advance interoperability, including efforts to accurately identify patients to their data; efforts to enhance cybersecurity preparedness and resilience; efforts to protect the privacy of individually identifiable health information; and advancing HR 2002, the Patient Matching and Transparency in Certified Health IT (MATCH IT) Act of 2025.",
    "Issues affecting integrated health care delivery systems including advancing proactive care; leveraging health information technology to improve care, including virtual care; efforts to advance interoperability, including efforts to accurately identify patients to their data; efforts to enhance cybersecurity preparedness and resilience; and advancing HR 2002, the Patient Matching and Transparency in Certified Health IT (MATCH IT) Act of 2025.",
    "Remove Section 510 that prohibits the promulgation or adoption of a unique patient health identifier so that patients can consistently and accurately be connecting to their health information; support FY 2026 Community Project Funding for the City of Wells, Nevada hybrid - click and mortar -medical clinic."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 29,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 167500,
  "peakYear": 2025,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 3,
  "industry": "technology"
}