{
  "id": 196608,
  "name": "IRON MOUNTAIN INFORMATION MANAGEMENT, LLC",
  "slug": "iron-mountain-information-management-llc",
  "state": "MA",
  "description": "A global business dedicated to storing, protecting and managing, information and assets.",
  "totalSpending": 1350000,
  "filings": 27,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 150000
    },
    {
      "year": 2020,
      "income": 150000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "FORBES-TATE"
  ],
  "lobbyists": [
    "ELIZABETH GREER",
    "JEFFREY FORBES",
    "ZACHARY WILLIAMS",
    "FRANCESCA MCCRARY",
    "ADRIENNE SCHWEER",
    "MICHAEL WILLIAMS"
  ],
  "issues": [
    "TAX",
    "GOV",
    "CPI",
    "HOM",
    "BUD",
    "CSP",
    null
  ],
  "sampleDescriptions": [
    "Issues related to the implementation of tax reform.",
    "Issues related to federal records management; Issues related to House Transportation and Infrastructure Committee Resolution regarding Prospectus PPA-FBC-BO17.",
    "Issues related to consolidation of federal data centers under the Federal Information Technology Acquisition and Reform Act (Public Law 113-291)",
    "Issues related to federal records management.",
    "Issues related to Financial Services and General Government Appropriations for FY 2018.",
    "Privacy and data security legislation related to consumer data breach notification.",
    "Issues related to Financial Services and General Government FY 2019 & 2018 Appropriations.",
    "Issues related to federal records management; Issues related to federal background check.",
    "Issues related to Financial Services and General Government FY 2019 Appropriations.",
    "Issues related to H.R. 6147 Financial Services and General Government FY 2019 Appropriations.",
    "Issues related to the implementation of  H.R. 6147  Financial Services and General Government FY 2019 Appropriations.",
    "Issues related to consolidation of federal data centers under the Federal Information Technology Acquisition and Reform Act (Public Law 113-291).",
    "Issues related to the implementation of H.R. 6147 (115th Congress) - Financial Services and General Government FY 2019 Appropriations; Issues related to the implementation of H.R. 695 (115th Congress) - Department of Defense FY 2019 Appropriations; Issues related to FY 2020 Dept. of Defense Appropriations (H.R. 2968/S. 2474).",
    "Issues relating to Department of Defense operations, including records management, in the National Defense Authorization Act (S.1790) and FY 2020 Department of Defense Appropriations (H.R. 2968/S. 2474).",
    "Issues related to the implementation of tax reform (Public Law 115-97).",
    "Issues relating to Department of Defense operations, including records management, in the National Defense Authorization Act (S.1790) and FY 2020 Department of Defense Appropriations (H.R. 2968/S. 2474); Issues related to H.R. 925 - The Heroes Act.",
    "Issues relating to Department of Defense operations, including records management; Issues regarding H.R. 1319 - American Rescue Plan Act of 2021 (Public Law No: 117-2).",
    "Issues related to federal records management; Issues related to federal background checks.",
    "Issues related to consolidation of federal data centers under the Federal Information Technology Acquisition and Reform Act (Public Law No: 113-291).",
    "Issues related to federal records management; Issues related to House Transportation and Infrastructure Committee Resolution regarding Prospectus PPA-FBC-BO17; Issues related to federal record storage."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -25,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 168750,
  "peakYear": 2018,
  "lobbyistCount": 6,
  "firmCount": 1,
  "issueCount": 6,
  "industry": "technology"
}