{"id":199343,"name":"IRON MOUNTAIN","slug":"iron-mountain","state":"MD","description":"Dedicated to the storage, protection, and management of information, records, & assets.","totalSpending":1450000,"filings":29,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":200000},{"year":2022,"income":150000},{"year":2023,"income":250000},{"year":2024,"income":100000},{"year":2025,"income":150000}],"firms":["HARBINGER STRATEGIES, LLC"],"lobbyists":["STEVE STOMBRES","KYLE NEVINS","JOHN O'NEILL","MANNY ROSSMAN","JONATHAN SLEMROD","PARKER POLING","JOHN LEGANSKI"],"issues":["GOV","BUD","CSP","CPI","TAX","DEF",null],"sampleDescriptions":["General monitoring of issues related to federal records management.   House Transportation and Infrastructure Committee Resolution regarding Prospectus PPA-FBC-B017.","H.R. 3280 Financial Services and General Government Appropriations Act 2018;  Issues related to federal records management.","Privacy and data security legislation related to consumer data breach notification","Issues related to consolidation of federal data centers under the Federal Information Technology Acquisition and Reform Act.","H.R.1, Tax Reform Act of 2017 (Public Law No. 115-97) - Issues related to tax reform.","The Fiscal year 2019 Financial Services and General Government Appropriations Act (H.R. 3280, S3107):  Issues related to federal records management.","Privacy and data security legislation related to consumer data breach notification.","The FY2020 Financial Services and General Government Appropriations Act (No Bill Number):  Issues related to federal records management.","The Financial Services and General Government Appropriations Act of FY2020 (H.R.3351):  Issues related to federal records management.","The Financial Services and General Government Appropriations Act of FY2021 (No Bill Number): Issues related to federal records management.","Issues relating to Department of Defense operations, including records management, in the FY 2021 National Defense Authorization Act (No Bill Number) and FY 2021 Department of Defense Appropriations Act (No Bill Number).","Issues relating to Department of Defense operations, including records management, in the William M. (Mac) Thornberry National Defense Authorization Act for FY 2021 (H.R. 6395) and FY 2021 Department of Defense Appropriations Act (No Bill Number).","The Financial Services and General Government Appropriations Act of 2021 (H.R. 7668):  Issues related to federal records management.","The William M. (Mac) Thornberry National Defense Authorization Act for FY 2021 (H.R. 6395) and FY 2021 Department of Defense Appropriations Act (H.R. 7617):  issues relating to Department of Defense operations, including records management.","The FY 2022 National Defense Authorization Act (No Bill Number):  Issues related to Department of Defense operations, including records management.","The FY 2022 Financial Services and General Government Appropriations Act (No Bill Number):  Issues related to federal records management.","The FY 2022 Financial Services and General Government Appropriations Act (H.R. 4345):  Issues related to federal records management.","The FY 2022 National Defense Authorization Act (H.R. 4350):  Issues related to Department of Defense operations, including records management.","The FY 2022 National Defense Authorization Act (Public Law 117-81): Issues related to Department of Defense operations, including records management.","The FY 2022 Financial Services and General Government Appropriations Act (H.R. 4345): Issues related to federal records management."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}