{"id":178572,"name":"JOHNSON & JOHNSON SERVICES, INC.","slug":"johnson-johnson-services-inc","state":"DC","description":"Healthcare company.","totalSpending":1210000,"filings":25,"yearlySpending":[{"year":2019,"income":100000},{"year":2020,"income":250000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":260000}],"firms":["THE NICKLES GROUP, LLC"],"lobbyists":["DON NICKLES","EMILY PORTER","STACEY HUGHES","MARY SAVARY TAYLOR","RACHEL JONES HENSLER","GREG D'ANGELO","BRETT BAKER","JEFF CHOUDHRY"],"issues":["HCR","MMM","BUD","LAW","TAX","GOV","CSP","BNK","TRD"],"sampleDescriptions":["Issues related to drug pricing.","Issues related to drug pricing and transparency; issues related to S. 1895, Lower Health Care Costs Act of 2019; S. 340, CREATES Act of 2019; issues related to the regulation of cosmetics.","Issues related to biosimilars; H.R. 2296, the METRIC Act; S. 2543, Prescription Drug Pricing Reduction Act of 2019, issues related to ASP reporting.","H.R. 1158, the Consolidated Appropriations Act of 2020 and H.R. 1865, Further Consolidated Appropriations Act, 2020.","Issues related to biosimilars; H.R. 2296, the METRIC Act; S. 2543, Prescription Drug Pricing Reduction Act of 2019, issues related to ASP reporting; H.R. 3, Elijah E. Cummings Lower Drug Costs Now Act.","Issues related to biosimilars; S. 2543, Prescription Drug Pricing Reduction Act of 2019, issues related to ASP reporting; H.R. 3, Elijah E. Cummings Lower Drug Costs Now Act.","Issues related to drug pricing and transparency; issues related to S. 1895, Lower Health Care Costs Act of 2019; S. 340, CREATES Act of 2019; issues related to the regulation of cosmetics; monitored issues related to P.L. 116-136, Coronavirus Aid, Response, and Economic Security Act (CARES Act); issues related to maternal mortality.","Issues related to drug pricing; monitored issues related to S. 1895, Lower Health Care Costs Act of 2019; monitored issues related to P.L. 116-136, Coronavirus Aid, Response, and Economic Security Act (CARES Act); issues related to maternal mortality; issues related to vaccines and liability.","Monitored issues related to biosimilars; S. 2543, Prescription Drug Pricing Reduction Act of 2019, issues related to ASP reporting.","Monitored issues related to H.R. 7120, the George Floyd Justice in Policing Act, and S. 3985, the JUSTICE Act.","S. 2543, Prescription Drug Pricing Reduction Act of 2019, issues related to ASP reporting; issues related to Medicare coverage of vaccines.","Monitored issues related to S. 1895, Lower Health Care Costs Act of 2019; monitored issues related to P.L. 116-136, Coronavirus Aid, Response, and Economic Security Act (CARES Act); issues related to maternal mortality; H.R. 925 / H.R. 8406, The HEROES Act and The Health, Economic Assistance, Liability Protection and Schools (HEALS) Act and issues related to vaccines and liability; issues related to the Executive Order on Lowering Drug Prices by Putting America First.","Monitored issues related to S. 1895, Lower Health Care Costs Act of 2019; monitored issues related to P.L. 116-136, Coronavirus Aid, Response, and Economic Security Act (CARES Act); issues related to maternal mortality.","S. 2543, Prescription Drug Pricing Reduction Act of 2019, issues related to ASP reporting; issues related to Medicare coverage of vaccines; issues related to H.R. 133, the Consolidated Appropriations Act of 2021, including vaccines, ASP reporting and liability. Monitored issues related to Most Favored Nation (MFN) rule and drug rebates.","Monitor implementation of The Tax Cut and Jobs Act, as it relates to corporate tax and the taxation of U.S. multinational corporations. H.R. 133, the Consolidated Appropriations Act of 2021, as it relates to tax extenders.","Issues related to H.R. 133, the Consolidated Appropriations Act of 2021, including ASP reporting. S. 2543, Prescription Drug Pricing Reduction Act of 2019, as it relates to ASP reporting.","American Jobs Plan, as it relates to corporate taxes.","Monitored issues related to P.L. 117-2, the American Rescue Plan, as it relates to COVID relief.","Issues related to Medicare coverage of vaccines. Monitored P.L. 117-2, the American Rescue Plan, as it relates to drug pricing provisions and COVID relief and issues related to maternal health.","Monitored FY'21 Budget Resolution."],"years":[2019,2020,2021,2022,2024,2025]}