{
  "id": 195182,
  "name": "JPMORGAN CHASE HOLDINGS LLC",
  "slug": "jpmorgan-chase-holdings-llc",
  "state": "NY",
  "description": "financial institution",
  "totalSpending": 1350000,
  "filings": 27,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 100000
    },
    {
      "year": 2021,
      "income": 100000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "S-3 GROUP"
  ],
  "lobbyists": [
    "JOHN SCOFIELD",
    "MARTIN DELGADO",
    "KATE DICKENS",
    "ROBERT COLLINS",
    "MICHAEL FERENCE",
    "MATT BRAVO",
    "KEVIN CASEY",
    "OLIVIA KURTZ",
    "MARTIN REISER"
  ],
  "issues": [
    "BAN",
    "BUD",
    null
  ],
  "sampleDescriptions": [
    "Issues related to banking and financial services",
    "issues related to financial institution bankruptcy reform; issues related to the budget and the implementation of financial services legislation",
    "Issues related to banking and financial services. Inter-Affiliated provision in FY19 Financial Services",
    "BAN- Issues related to banking and financial services. Inter-Affiliated provision in FY20 Financial Services",
    "BUD- issues related to financial institution bankruptcy reform; issues related to the budget and the implementation of financial services legislation",
    "BAN- Issues related to banking and financial services and FY20 Financial Services Appropriations.",
    "Issues related to banking and financial services and FY20 Financial Services Appropriations.",
    "Issues related to financial institution bankruptcy reform; issues related to the budget and the implementation of financial services legislation",
    "Issues related to banking and financial services and FY21 Financial Services Appropriations.",
    "Issues related to banking and financial services and FY21 Financial Services Appropriations",
    "Issues related to banking and financial services and FY22 Financial Services Appropriations",
    "Issues related to banking and financial services and Financial Services Appropriations",
    "Issues related to the budget and the implementation of financial services legislation"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -25,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 168750,
  "peakYear": 2018,
  "lobbyistCount": 9,
  "firmCount": 1,
  "issueCount": 2
}