{"id":193510,"name":"JUUL LABS INC","slug":"juul-labs-inc","state":"CA","description":"Vaporizers and e-cigarettes manufacturer and supplier.","totalSpending":1290000,"filings":24,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":180000},{"year":2020,"income":220000},{"year":2021,"income":200000},{"year":2022,"income":240000},{"year":2024,"income":90000},{"year":2025,"income":120000}],"firms":["W STRATEGIES, LLC"],"lobbyists":["DARREN WILLCOX"],"issues":["HCR","TRD","TOB","TAX","BUD"],"sampleDescriptions":["Issues related to vaping products, including FDA regulation.","Issues related to vaping products, including FDA regulation and education about the value of these products in harm reduction.","Issues regarding the imposition of tariffs on China related to USTRs proposed actions pursuant to Section 301 of the U.S. Trade Act of 1974 and their effect on e-cigarettes and vaping products.","Issues related to vaping products, including education about the value of these products in harm reduction.  \n\nEducation about the companys efforts to reduce youth access to vaping products as well as FDA proposals in this area.","Issues related to vaping products, including education about the value of these products in harm reduction.\n\nEducation about the companys efforts to reduced youth access to vaping products as well as FDA proposals in this area.  \n\nAdvocating for legislation to create a federal age 21 requirement for all nicotine products.","Education about the companys efforts to reduced youth access to vaping products as well as FDA proposals in this area.  \n\nEducation about counterfeit product detection and prevention with vapor products.\n\nS.1541: Tobacco-Free Youth Act.\n\nS.1258: Tobacco to 21 Act.","H.R.4742: Impose Tax on Nicotine Used in Vaping Products.","Education about the companys efforts to reduced youth access to vaping products as well as FDA proposals in this area.  \n\nEducation about counterfeit product detection and prevention with vapor products.\n\nS.1541: Tobacco-Free Youth Act.\n\nS.1258: Tobacco to 21 Act.\n\nH.R. 2339: Reversing the Youth Tobacco Epidemic Act of 2019.","Education about the companys efforts to reduced youth access to vaping products as well as FDA proposals in this area.  \n\nEducation about counterfeit product detection and prevention with vapor products.\n\nH.R. 2339: Reversing the Youth Tobacco Epidemic Act of 2019.","Regulation of electronic nicotine delivery system products as a less harmful alternative for adult smokers.\n\nIssues related to enforcement of illicit tobacco products including importation of counterfeit products.\n\nEducation about counterfeit product detection and prevention with vapor products.","Regulation of electronic nicotine delivery system products as a less harmful alternative for adult smokers and the FDAs authority to regulate such products under P.L. 111-31, the Family Smoking Prevention and Tobacco Control Act.\n\nIssues related to enforcement of illicit tobacco products including importation of counterfeit productions.","H.R.133: Consolidated Appropriations Act 2021, provisions related to online sale of e-cigarettes.","Regulation of electronic nicotine delivery system products as a less harmful alternative for adult smokers.\n\nIssues related to enforcement of illicit tobacco products including importation of counterfeit productions.","Risk-proportionate regulation for electronic nicotine delivery system products to advance tobacco harm reduction for adult smokers and policies to combat underage use.\n\nIssues related to enforcement of illicit tobacco products, including importation of counterfeit products, and unregulated nicotine products.\n\nIssues related to taxation and user fees for tobacco and electronic nicotine delivery system products.\n\nEducation related to implementation of Public Law 111-31, the Family Smoking Prevention and Tobacco Control Act, and PMTA submissions for deemed tobacco products.","Risk-proportionate regulation of electronic nicotine delivery system products to advance tobacco harm reduction for adult smokers and policies to combat underage use.\n\nIssues related to enforcement of illicit tobacco products, including importation of counterfeit products, and unregulated nicotine products.\n\nEducation related to implementation of Public Law 111-31, the Family Smoking Prevention and Tobacco Control Act, and PMTA submissions for deemed tobacco products.","Issues related to taxation and user fees for tobacco and electronic nicotine delivery systems.","FY'22 Budget Reconciliation including issues related to taxation of tobacco and electronic nicotine delivery systems.","H.R.5376: Build Back Better Act, including issues related to taxation of tobacco and electronic nicotine delivery systems.","Risk-proportionate regulation of electronic nicotine delivery system products to advance tobacco harm reduction for adult smokers and policies to combat underage use.\n\nIssues related to enforcement of illicit tobacco products, including importation of counterfeit products, and unregulated nicotine products.\n\nEducation related to implementation of Public Law 111-31, the Family Smoking Prevention and Tobacco Control Act, and PMTA submissions for deemed tobacco products.\n\nIssues related to regulation of synthetic nicotine products.","Risk-proportionate regulation of electronic nicotine delivery system products to advance tobacco harm reduction for adult smokers and policies to combat underage use. Issues related to enforcement of illicit tobacco products, including importation of counterfeit products, and unregulated nicotine products. Education related to implementation of Public Law 111-31, the Family Smoking Prevention and Tobacco Control Act, and PMTA submissions for deemed tobacco products. Issues related to regulation of synthetic nicotine products."],"years":[2018,2019,2020,2021,2022,2024,2025]}