{"id":100894,"name":"KOHLBERG KRAVIS ROBERTS & COMPANY","slug":"kohlberg-kravis-roberts-company","state":null,"description":null,"totalSpending":1750000,"filings":28,"yearlySpending":[{"year":2018,"income":230000},{"year":2019,"income":180000},{"year":2020,"income":260000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":180000}],"firms":["AKIN GUMP STRAUSS HAUER & FELD"],"lobbyists":["RYAN THOMPSON","JEFF MCMILLEN","GEOFF VERHOFF","ZACHARY RUDISILL","VIC FAZIO","CHRISTINA HALEY","ED PAGANO","ARSHI SIDDIQUI","CARYN LESTER","JUSTIN MCCARTHY","VALERIE WHITE","SEAN D'ARCY","BRENDAN DUNN","VIRGIL MILLER","GALEN ROEHL","ERIC ETTORRE","SAM OLSWANGER","JOSE BORJON"],"issues":["UTI","TAX","ECN","TRD","LBR","FIN","TEC","INS",null,"RET","HCR","ENG"],"sampleDescriptions":["Public private partnerships.","Tax issues affecting private equity firms and their portfolio companies, including implementation of tax reform.","Discussions regarding public/private partnerships.","Outreach and communications related to portfolio company bankruptcy.","Issues affecting private equity firms and their portfolio companies.","Tax issues affecting private equity firms and their portfolio companies, including implementation of tax reform. Issues related to Covid","Discussions regarding public/private partnerships. Implementation of CARES Act.","Matters relating to private equity firms and their role in job creation.","163(n) limitation on the deduction for interest expense.","General economic policy issues, including ESG.","Issues related to federal funding for broadband deployment.","Issues related to financial services and housing; Issues affecting private equity firms and their portfolio companies.","Implementation of international tax reform, taxation of funds and their portfolio companies; interest deductibility; Issues related to corporate taxation under the Build Back Better Act/Inflation Reduction Act (PL 117-169), including book minimum tax.","Issues related to private equity and insurance.","Issues related to housing and financial services; issues related to private equity firms and their role in job creation.","Implementation of international tax reform, taxation of funds and their portfolio companies; Interest deductibility; Issues related to corporate taxation under the Build Back Better Act/Inflation Reduction Act (PL 117-169), including book minimum tax; ESOPs.","Issues related to housing and financial services; Issues related to private equity firms and their role in job creation.","Implementation of international tax reform and taxation of funds and their portfolio companies; Issues related to interest deductibility; Issues related to corporate taxation under the Inflation Reduction Act of 2022 (PL 117-169), including book minimum tax; Issues related to employee benefits.","Issues related to employee benefits.","Issues related to general economic policy."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}