{"id":129513,"name":"KRAFT HEINZ COMPANY","slug":"kraft-heinz-company","state":"DC","description":null,"totalSpending":1160000,"filings":24,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":200000},{"year":2022,"income":60000},{"year":2024,"income":150000},{"year":2025,"income":150000}],"firms":["THE RUSSELL GROUP, INC."],"lobbyists":["RANDALL RUSSELL","TYSON REDPATH","ANDREW HARKER","JESSICA SCHULKEN","KARLA THIEMAN","ASHLEE JOHNSON"],"issues":["AGR","TRD"],"sampleDescriptions":["Public Law No. 114-216, National Bioengineered Food Disclosure Standard; advocacy on issues pertaining to labeling harmonization between USDA and FDA; issues pertaining to the reauthorization of the Farm Bill; H.R.4828 - CURD Act; Intentional Adulteration provisions of the Food Safety Modernization Act (FSMA).","Public Law No. 114-216, National Bioengineered Food Disclosure Standard; advocacy on issues pertaining to labeling harmonization between USDA and FDA; H.R.2 - Agriculture Improvement Act of 2018, issues pertaining to the peanut program in the commodity title; H.R.4828 - CURD Act; Intentional Adulteration provisions of the Food Safety Modernization Act (FSMA); issues related to trade and tariffs.","Public Law No. 114-216, National Bioengineered Food Disclosure Standard; H.R. 2/S. 3042, Agriculture Improvement Act of 2018, issues pertaining to the peanut program in the commodity title; H.R.4828/S. 2322, CURD Act; issues related to trade and tariffs.","Public Law No. 114-216, National Bioengineered Food Disclosure Standard; H.R. 2/S. 3042, Agriculture Improvement Act of 2018, issues pertaining to the peanut program in the commodity title; H.R.4828/S. 2322, CURD Act; issues related to trade and tariffs; issues pertaining to Puerto Rico disaster aid funding.","H.R. 4828/S. 2322, CURD Act; issues related to trade and tariffs; issues pertaining to Puerto Rico disaster aid funding.","Issues pertaining to trade and tariffs; issues pertaining to plastics regulations.","S. 1669: CURD Act; issues pertaining to the Fruit and Vegetable Program under the Specialty Crops Inspection Division at AMS.","Issues pertaining to trade and tariffs, specifically USMCA; issues pertaining to plastics regulations.","S. 1669: CURD Act; issues pertaining to imports of tomato seeds.","Issues pertaining to imports of tomato seeds; implementation of the National Bioengineered Food Disclosure Standard.","Issues pertaining to trade and tariffs; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act.","Issues pertaining to trade and tariffs; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act; issues pertaining to US-EU trade agreement.","Issues pertaining to imports of tomato seeds; implementation of the National Bioengineered Food Disclosure Standard; matters pertaining to food standards; H.R.6044 - Accurate Labels Act; matters pertaining to COVID-19.","Issues pertaining to imports of tomato seeds; implementation of the National Bioengineered Food Disclosure Standard; matters pertaining to food standards; H.R.6044 - Accurate Labels Act; matters pertaining to COVID-19; FY21 appropriations.","Issues pertaining to trade and tariffs.","Issues pertaining to imports of tomato seeds; implementation of the National Bioengineered Food Disclosure Standard; matters pertaining to food standards; matters pertaining to COVID-19; FY21 appropriations; issues pertaining to the dairy market and the\nSupplemental Nutrition Assistance Program (SNAP)/Nutrition Assistance Program (NAP).","Matters pertaining to food standards; matters pertaining to COVID-19, specifically Farmers to Families Food Box program; FY21 appropriations; issues pertaining to the dairy market and the Supplemental Nutrition Assistance Program (SNAP)/Nutrition Assistance Program (NAP); matters pertaining to AmeriCorps eligibility.","Matters pertaining to food standards; matters pertaining to COVID-19, specifically Farmers to Families Food Box program; implementation of FY21 appropriations; issues pertaining to the dairy market and the Supplemental Nutrition Assistance Program (SNAP)/Nutrition Assistance Program (NAP).","Matters pertaining to food standards; matters pertaining to COVID-19, specifically Farmers to Families Food Box program; FY22 appropriations; issues pertaining to the dairy market and the Supplemental Nutrition Assistance Program (SNAP)/Nutrition Assistance Program (NAP); issues pertaining to food product exports and international food labeling requirements.","Matters pertaining to food standards; matters pertaining to COVID-19, specifically stimulus related commodity purchases; FY22 appropriations; issues pertaining to the dairy market and the Supplemental Nutrition Assistance Program (SNAP)/Nutrition Assistance Program (NAP); issues pertaining to food product exports and international food labeling requirements."],"years":[2018,2019,2020,2021,2022,2024,2025]}