{
  "id": 182333,
  "name": "LABORATORY CORPORATION OF AMERICA HOLDINGS",
  "slug": "laboratory-corporation-of-america-holdings",
  "state": "NC",
  "description": "Clinical laboratory",
  "totalSpending": 3000000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 270000
    },
    {
      "year": 2019,
      "income": 360000
    },
    {
      "year": 2020,
      "income": 390000
    },
    {
      "year": 2021,
      "income": 330000
    },
    {
      "year": 2022,
      "income": 440000
    },
    {
      "year": 2023,
      "income": 440000
    },
    {
      "year": 2024,
      "income": 330000
    },
    {
      "year": 2025,
      "income": 440000
    }
  ],
  "firms": [
    "KELLEY DRYE & WARREN LLP"
  ],
  "lobbyists": [
    "DANA WOOD",
    "SCOTT MCGEE",
    "MAGGIE CROSSWY"
  ],
  "issues": [
    "HCR",
    null,
    "TAX"
  ],
  "sampleDescriptions": [
    "Healthcare issues related to clinical laboratories; FDA oversight of laboratory developed tests including the discussion draft of Diagnostic Accuracy and Innovation Act (DAIA); Medicare reimbursement levels for laboratory services and reforms to Clinical Laboratory Fee Schedule; and federal policy relating to drug development.",
    "Healthcare issues related to clinical laboratories; FDA oversight of laboratory developed tests, including the discussion draft of the Diagnostic Accuracy and Innovation Act (DAIA), FDAs technical assistance on DAIA, and the discussion draft of the Verifying Accurate Leading-edge IVCT Development (VALID) Act; Medicare coverage and reimbursement levels for laboratory services and reforms to the Clinical Laboratory Fee Schedule; federal policy relating to drug development",
    "Healthcare issues related to clinical laboratories; FDA oversight of laboratory developed tests, including the discussion draft of the Verifying Accurate Leading-edge IVCT Development (VALID) Act; Medicare coverage and reimbursement levels for laboratory services and reforms to the Clinical Laboratory Fee Schedule; federal policy relating to drug development",
    "Healthcare issues related to clinical laboratories; FDA oversight of laboratory developed tests, including the discussion draft of the Verifying Accurate Leading-edge IVCT Development (VALID) Act; Medicare coverage and reimbursement levels for laboratory services and reforms to the Clinical Laboratory Fee Schedule including provisions contained in H.R. 3584, the Laboratory Access for Beneficiaries (LAB) Act ; federal policy relating to drug development; federal policy relating to anti-kickback requirements in Section 8122 of the Support for Patients and Communities Act, Pub. L. 115-271 (18 U.S.C. 220); federal policy relating to subject matter eligibility for patents of laboratory tests.",
    "Healthcare issues related to clinical laboratories;\n\nFDA oversight of laboratory-developed tests, including the discussion draft of the Verifying Accurate Leading-edge IVCT Development (VALID) Act;\n\nH.R. 3584/ S. 3049, the Laboratory Access for Beneficiaries (LAB) Act, provisions relating to modification of reporting of private-sector payments used to establish Medicare rates for clinical diagnostic laboratory tests and directing a third party study and report including recommendations on private-sector payment data collection requirements and Medicare rate methodologies.\n\nH.R. 1865, the Further Consolidated Appropriations Act, Section 105 of Division N, provisions incorporating the LAB Act;\n\nFederal policy relating to drug development; and\n\nFederal policy relating to anti-kickback requirements in Section 8122 of the Support for Patients and Communities Act, Pub. L. 115-271 (18 U.S.C. 220).",
    "Healthcare issues related to clinical laboratories;\n\nH.R. 6102/S. 3404, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests; \n\nFederal policy relating to FDA oversight of pharmacogenetic tests, including potential inclusion in the Fiscal Year 2021 Agriculture-FDA appropriations bill;\n\nH.R. 748, the Coronavirus Aid, Relief, and Economic Security (CARES) Act, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests, Medicare reimbursement for clinical laboratory tests, funding for child care for laboratory personnel, and emergency funding for COVID-19 related revenue losses and expenses not otherwise reimbursed;\n\nH.R. 3584/ S. 3049, the Laboratory Access for Beneficiaries (LAB) Act, provisions relating to modification of reporting of private-sector payments used to establish Medicare rates for clinical diagnostic laboratory tests and directing a third party study and report including recommendations on private-sector payment data collection requirements and Medicare rate methodologies.\n\nH.R. 1865, the Further Consolidated Appropriations Act, Section 105 of Division N, provisions incorporating the LAB Act;\n\nFederal policy relating to drug development; and\n\nFederal policy relating to anti-kickback requirements in Section 8122 of the Support for Patients and Communities Act, Pub. L. 115-271 (18 U.S.C. 220) including potential inclusion in the Fiscal Year 2021 Labor-HHS appropriations bill.",
    "Healthcare issues related to clinical laboratories;\n\nH.R. 6102/S. 3404, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests;\n\nH.R. 266, the Paycheck Protection Program and Healthcare Enhancement Act, Pub. L. 116-139, provisions relating to COVID-19 provider emergency funding, lab capacity funding, and funding of lab services to the uninsured;\n\nFederal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests;\n\nFederal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests, Medicare reimbursement for clinical laboratory tests, and emergency funding for COVID-19 related revenue losses and expenses not otherwise reimbursed;\n\nFederal policy relating to drug development, including potential legislation known as Cures 2.0;\n\nFederal policy relating to anti-kickback requirements in Section 8122 of the Support for Patients and Communities Act, Pub. L. 115-271 (18 U.S.C. 220), including potential legislation as part of the Fiscal Year 2021 Commerce-Justice-Science appropriations bill and the Fiscal Year 2021 Labor-HHS appropriations bill; and\n\nFederal policy relating to FDA oversight of pharmacogenetic tests, including potential legislation as part of the Fiscal Year 2021 Agriculture-FDA appropriations bill.",
    "Healthcare issues related to clinical laboratories;\n\nH.R. 6102/S. 3404, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests;\n\nFederal policy related to implementation of the Paycheck Protection Program and Healthcare Enhancement Act, Pub. L. 116-139, provisions relating to COVID-19 provider emergency funding, lab capacity funding, and funding of lab services to the uninsured;\n\nFederal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests;\n\nFederal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests, Medicare reimbursement for clinical laboratory tests, and emergency funding for COVID-19 related revenue losses and expenses not otherwise reimbursed;\n\nH.R. 7059, the Coronavirus Provider Protection Act and H.R. 7528, the Get America Back to Work Act, provisions relating to limitation of liability for COVID-19 related services;\n\nSection 307 of H.R. 8406, the Heroes Act, provisions relating to coverage of COVID-19 testing;\n\nFederal policy relating to funding COVID-19 surveillance and transmission studies using next generation sequencing, including potential legislation;\n\nFederal policy relating to anti-kickback requirements in Section 8122 of the Support for Patients and Communities Act, Pub. L. 115-271 (18 U.S.C. 220), including potential legislation as part of the Fiscal Year 2021 Commerce-Justice-Science appropriations bill and the Fiscal Year 2021 Labor-HHS appropriations bill; and\n\nFederal policy relating to FDA oversight of pharmacogenetic tests, including potential legislation as part of the Fiscal Year 2021 Agriculture-FDA appropriations bill.",
    "Healthcare issues related to clinical laboratories;\n\nH.R. 6102/S. 3404, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests;\n\nFederal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests;\n\nFederal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests;\n\nSection 307 of H.R. 8406, the Heroes Act, provisions relating to coverage of COVID-19 testing;\n\nH.R. 8496, the SPEEDY COVID-19 Test Act, provisions relating to varying Medicare reimbursement for COVID-19 tests based on result delivery time;\n\nFederal policy relating to funding COVID-19 surveillance and transmission studies using next generation sequencing, including potential legislation;\n\nFederal policy relating to drug development, including potential legislation known as Cures 2.0;\n\nFederal policy relating to anti-kickback requirements in Section 8122 of the Support for Patients and Communities Act, Pub. L. 115-271 (18 U.S.C. 220), including potential legislation as part of the Fiscal Year 2021 Commerce-Justice-Science appropriations bill and the Fiscal Year 2021 Labor-HHS appropriations bill; and\n\nFederal policy relating to FDA oversight of pharmacogenetic tests, including potential legislation as part of the Fiscal Year 2021 Agriculture-FDA appropriations bill; and\n\nTitle I of Division BB of the Consolidated Appropriations Act of 2021, Pub. L. 116-260, provisions relating to surprise billing.",
    "Legislation relating to FDA oversight of laboratory-developed test;\n \nFederal policy related to implementation of Section 307 of H.R. 8406, the Heroes Act, provisions relating to coverage of COVID-19 testing;\n \nFederal policy relating to drug development, including potential legislation known as Cures 2.0;\n \nFederal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests; and\n \nFederal policy relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93.",
    "H.R. 4128/S. 2209, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests;\n\nFederal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests;\n\nFederal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests;\n\nFederal policy relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93;\n\nFederal policy relating to pandemic preparedness, improvements in clinical research processes, and advancement of genetic and genomic testing, including a discussion draft of the Cures 2.0 Act;",
    "Healthcare issues related to clinical laboratories;\n \nH.R. 4128/S. 2209, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests;\n \nFederal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests;\n \nFederal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests;\n  \nFederal policy relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; and\n \nFederal policy relating to pandemic preparedness, improvements in clinical research processes, and advancement of genetic and genomic testing, including a discussion draft of the Cures 2.0 Act;",
    "Healthcare issues related to clinical laboratories; H.R. 4128/S. 2209, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests; Federal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests; Federal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests; S. 3799, the PREVENT Pandemics Act, and a draft of the Improving DATA in Public Health Act, provisions relating to demographic data reporting obligations for laboratories; Federal policy related to the National Correct Coding Initiative and manual instructions inconsistent with American Medical Association guidelines for Current Procedural Terminology (CPT) coding; H.R. 5030/S. 2706, the DIVERSE Trials Act, provisions relating to enhancing diversity in clinical trials and data collection and reporting by clinical laboratories; Federal policy relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; H.R. 6000, the Cures 2.0 Act, provisions relating to pandemic preparedness, improvements in clinical research processes, and advancement of genetic and genomic testing;",
    "Healthcare issues related to clinical laboratories; H.R. 8188/S. 4449, the Saving Access to Laboratory Services Act (SALSA), provisions relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; H.R. 4128/S. 2209, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, included as Subtitle C of Title VIII of S. 4348, the FDA Safety and Landmark Advancements Act (FDASLA), provisions relating to FDA oversight of laboratory-developed tests; H.R. 6000, the Cures 2.0 Act, provisions relating to pandemic preparedness, improvements in clinical research processes, and advancement of genetic and genomic testing;H.R. 2565/S. 2952, the FDA Modernization Act, provisions relating to biomedical research; Federal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests; Federal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests; Federal policy relating to the National Correct Coding Initiative and manual instructions inconsistent with American Medical Association guidelines for Current Procedural Terminology (CPT) coding; and Federal policy relating to availability of Current Procedural Terminology (CPT) codes.",
    "Healthcare issues related to clinical laboratories; H.R. 8188/S. 4449, the Saving Access to Laboratory Services Act (SALSA), provisions relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; H.R. 4128/S. 2209, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, included as Subtitle C of Title VIII of S. 4348, the FDA Safety and Landmark Advancements Act (FDASLA), provisions relating to FDA oversight of laboratory-developed tests; H.R. 4040, the Advancing Telehealth Beyond COVID-19 Act, H.R. 6202, the Telehealth Extension Act, and H.R. 7573/S. 3593, the Telehealth Extension and Evaluation Act, provisions relating to extension of Medicare coverage of telehealth services and limitations on payment for certain laboratory tests; H.R. 8152, the American Data Privacy and Protection Act (ADPPA), provisions relating to data privacy; S. 3799, the PREVENT Pandemics Act, provisions relating to demographic data reporting obligations for laboratories; Federal policy related to implementation of the Families First Coronavirus Response Act, Pub. L. 116-127, provisions relating to coverage of and funding for COVID-19 diagnostic tests; Federal policy related to implementation of the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Pub. L. 116-136, provisions relating to coverage and reimbursement of COVID-19 diagnostic tests and Medicare reimbursement for clinical laboratory tests; Federal policy relating to the National Correct Coding Initiative and manual instructions inconsistent with American Medical Association guidelines for Current Procedural Terminology (CPT) coding; and Federal policy relating to availability of Current Procedural Terminology (CPT) codes.",
    "Healthcare issues related to clinical laboratories; H.R. 2377/S. 1000, the Saving Access to Laboratory Services Act (SALSA), provisions relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; H.R. 2369, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, and the Fiscal Year 2025 Agriculture/FDA Appropriations bill, provisions relating to FDA oversight of laboratory-developed tests; Section 102 of H.R. 5378, the Lower Costs, More Transparency Act, and Section 3 of S. 3548, the Health Care Price Transparency Act 2.0, provisions relating to publication of rates for laboratory services; H.R. 7147/S. 3630, the Medicare Transaction Fraud Prevention Act, provisions relating to a Medicare pilot program using predictive risk algorithms to deny certain claims for clinical laboratory services; A draft of the Correct Coding Improvement Act, provisions related to laboratory procedure coding edits adopted by CMS under the National Correct Coding Initiative (NCCI), the adoption of Proprietary Laboratory Analysis (PLA) codes, and access to mandatory code sets for administrative transactions; Federal policy related to supply chain issues affecting pre-clinical biomedical research for drug development.",
    "Section 201 of H.R. 7024, the Tax Relief for American Families and Workers Act, provisions relating to immediate deductibility of research and development expenses under Internal Revenue Code Section 174.",
    "Healthcare issues related to clinical laboratories; H.R. 2377/S. 1000, the Saving Access to Laboratory Services Act (SALSA), Section 301 of H.R. 8261, the Preserving Telehealth, Hospital and Ambulance Access Act, and Section 201 of H.R. 7623, the Telehealth Modernization Act, provisions relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; H.R. 2369, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests; H.R. 8818, the American Privacy Rights Act, provisions relating to privacy and security of data; H.R. 8702/S. 4518, the Improving Seniors Timely Access to Care Act, provisions relating to prior authorization of services to Medicare Advantage beneficiaries; Section 106(b) of H.R. 8261, the Preserving Telehealth, Hospital and Ambulance Access Act, and Section 103(b) of H.R. 7623, the Telehealth Modernization Act, provisions relating to Medicare program integrity for clinical diagnostic laboratory test claims; A draft of the Correct Coding Improvement Act, provisions related to laboratory procedure coding edits adopted by CMS under the National Correct Coding Initiative (NCCI), the adoption of Proprietary Laboratory Analysis (PLA) codes, and access to mandatory code sets for administrative transactions; Federal policy related to supply chain issues affecting pre-clinical biomedical research for drug development;",
    "Healthcare issues related to clinical laboratories; H.R. 2377/S. 1000, the Saving Access to Laboratory Services Act (SALSA), and a draft bill for inflation updates to the Medicare Clinical Laboratory Fee Schedule, provisions relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; H.R. 2369, the Verifying Accurate Leading-edge IVCT Development (VALID) Act, provisions relating to FDA oversight of laboratory-developed tests, and other Federal policy relating to FDA oversight of laboratory-developed tests; H.R. 8702/S. 4518, the Improving Seniors Timely Access to Care Act, provisions relating to prior authorization of services to Medicare Advantage beneficiaries, and other Federal policy relating to prior authorization of services to Medicare Advantage beneficiaries; A draft of the Correct Coding Improvement Act, provisions related to laboratory procedure coding edits adopted by CMS under the National Correct Coding Initiative (NCCI), the adoption of Proprietary Laboratory Analysis (PLA) codes, and access to mandatory code sets for administrative transactions; Federal policy related to supply chain issues affecting pre-clinical biomedical research for drug development",
    "Healthcare issues related to clinical laboratories; Federal policy relating to reform of Medicare reimbursement for clinical laboratory services under Section 216 of the Protecting Access to Medicare Act, Pub. L. 113-93; Federal policy relating to oversight of laboratory-developed tests; Federal policy relating to Medicaid reimbursement for clinical laboratory services; Federal policy relating to prior authorization of services to Medicare Advantage beneficiaries A draft of the Correct Coding Improvement Act, provisions relating to laboratory procedure coding edits adopted by CMS under the National Correct Coding Initiative (NCCI), the adoption of Proprietary Laboratory Analysis (PLA) codes, and access to mandatory code sets for administrative transactions; and Federal policy related to supply chain issues affecting pre-clinical biomedical research for drug development;"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 63,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 375000,
  "peakYear": 2022,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 2
}