{
  "id": 129527,
  "name": "LAND O'LAKES INC",
  "slug": "land-o-lakes-inc",
  "state": "MN",
  "description": "Agriculture Cooperative",
  "totalSpending": 1720000,
  "filings": 23,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 160000
    },
    {
      "year": 2019,
      "income": 350000
    },
    {
      "year": 2020,
      "income": 360000
    },
    {
      "year": 2021,
      "income": 270000
    },
    {
      "year": 2023,
      "income": 220000
    },
    {
      "year": 2024,
      "income": 180000
    },
    {
      "year": 2025,
      "income": 180000
    }
  ],
  "firms": [
    "THE RUSSELL GROUP, INC."
  ],
  "lobbyists": [
    "RANDALL RUSSELL",
    "TYSON REDPATH",
    "ANDREW HARKER",
    "KARLA THIEMAN",
    "SAMANTHA BUCHALTER",
    "SAVANNAH BLOCK",
    "JESSICA SCHULKEN",
    "ALEX NOFFSINGER",
    "ASHLEE JOHNSON",
    "MORGAN OREM"
  ],
  "issues": [
    "AGR",
    null,
    "ANI"
  ],
  "sampleDescriptions": [
    "Support for farmer cooperatives; Work regarding H.R.2 - Agriculture Improvement Act of 2018, including conservation programs and dairy issues; Public Law No. 114-216, National Bioengineered Food Disclosure Standard.",
    "Work regarding H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; Public Law No. 114-216, National Bioengineered Food Disclosure Standard; work regarding international development programs.",
    "Work regarding H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to trade.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to trade; issues pertaining to sustainability; issues pertaining to the Market Facilitation Program.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to sustainability; issues pertaining to the Market Facilitation Program; issues pertaining to rural broadband connectivity; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to sustainability; issues pertaining to the Market Facilitation Program; issues pertaining to rural broadband connectivity; H.R.5430 - United States-Mexico-Canada Agreement Implementation Act; issues pertaining to COVID-19.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to sustainability; issues pertaining to the Market Facilitation Program; issues pertaining to rural broadband connectivity; issues pertaining to COVID-19; issues pertaining to crop protection.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to sustainability; issues pertaining to rural broadband connectivity; issues pertaining to COVID-19; issues pertaining to crop protection.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to sustainability; issues pertaining to rural broadband connectivity; issues pertaining to COVID-19; issues pertaining to crop protection; issues pertaining to international food aid.",
    "Implementation of H.R. 2/S. 3042, Agriculture Improvement Act of 2018, including conservation programs and dairy issues; issues pertaining to sustainability; issues pertaining to rural broadband connectivity; issues pertaining to COVID-19; issues pertaining to crop protection; issues pertaining to international food aid; issues pertaining to Child Nutrition Reauthorization.",
    "General agriculture issues, including the farm bill, trade, and animal feed.",
    "Issues related to feed additives",
    "General agriculture issues; issues related to trade; issues related to animal feed; issues related to H.R. 8467 Farm, Food, and National Security Act of 2024; issues related to tax; and issues related to H.R. 4721 Main Street Tax Certainty Act.",
    "General agriculture issues; issues related to trade; issues related to animal feed; issues related to H.R. 8467 Farm, Food, and National Security Act of 2024.",
    "General agriculture issues; issues related to trade; issues pertaining to climate and related agriculture practices; and issues related to the Farm Bill.",
    "General agriculture issues; issues related to trade; and issues related to the Farm Bill."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2023,
    2024,
    2025
  ],
  "growthRate": 13,
  "trajectory": "stable",
  "yearsActive": 7,
  "avgAnnualSpending": 245714,
  "peakYear": 2020,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 2
}