{"id":153677,"name":"LEBANESE AMERICAN UNIVERSITY","slug":"lebanese-american-university","state":"NY","description":"A U.S. accredited higher education institution headquartered in New York.","totalSpending":2040000,"filings":28,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":160000},{"year":2020,"income":200000},{"year":2021,"income":160000},{"year":2022,"income":220000},{"year":2023,"income":400000},{"year":2024,"income":400000},{"year":2025,"income":300000}],"firms":["GHAZAL & ASSOCIATES, LLC"],"lobbyists":["JAY GHAZAL"],"issues":["BUD",null],"sampleDescriptions":["FY2019 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, the Middle East Partnership Initiative, and Lebanon generally.","FY2020 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, the Middle East Partnership Initiative, and Lebanon generally.","FY2020 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","FY2021 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","FY2021 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospital Abroad program, and the Middle East Partnership Initiative.","Funding for higher education institutions contained in H.R. 748, the CARES Act; FY2021 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative; and general assistance following August 4 explosion at Beirut port.","Funding for higher education institutions contained in COVID-19 relief packages; FY2021 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","H.R.1319, American Rescue Plan Act of 2021; FY2022 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","Implimentation of H.R.1319, American Rescue Plan Act of 2021; FY2022 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","FY2022 and FY2023 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","FY2023 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","Fiscal Year 2024 State, Foreign Operations and Related Programs Appropriations bill implementation; and Fiscal Year 2025 State, Foreign Operations and Related Programs Appropriations bill, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","Fiscal Year 2025 and Fiscal Year 2026 State, Foreign Operations and Related Programs Appropriations bills, particularly sections pertaining to American Schools and Hospitals Abroad program, and the Middle East Partnership Initiative.","Fiscal Year 2025 and Fiscal Year 2026 State, Foreign Operations and Related Programs Appropriations bills."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}