{"id":208460,"name":"LIBERTY MEDIA CORPORATION","slug":"liberty-media-corporation","state":"CO","description":"Media services","totalSpending":1200000,"filings":15,"yearlySpending":[{"year":2021,"income":320000},{"year":2022,"income":320000},{"year":2024,"income":240000},{"year":2025,"income":320000}],"firms":["INVARIANT LLC"],"lobbyists":["VENKATASATYA KROVI","MARY STANTON","ERIC ROSEN","CAROLYN CODA","SAMUAL LOVE","HEATHER PODESTA","JOEL RICHARD","JONATHAN MONTANO"],"issues":["TAX","CPT","CSP","TEC","MIA","FIN","HOM","AVI","LBR"],"sampleDescriptions":["Competition policy, corporate tax, intellectual property, and consumer protection.","Educate policymakers about companys presence in Colorado and nationwide.","Monitor efforts to enact broadband infrastructure provisions.","Educate policymakers about company's presence in Colorado and nationwide.","Educate policymakers regarding pending regulatory changes to the U.S. Securities and Exchange Commission's (SEC) disclosure rules.","Monitor implementation of broadband-related provisions in H.R.3684, the Infrastructure Investment and Jobs Act.","Monitor implementation of broadband-related provisions in P.L. 117-58.","Monitor policymakers regarding pending regulatory changes to the U.S. Securities and Exchange Commission's (SEC) disclosure rules.","Educate lawmakers about the Las Vegas Grand Prix Special Event Assessment Rating.","Advocate for reforms in Federal Aviation Administration Reauthorization legislation to promote the safety of Formula 1 Grand Prix events.","Educate policymakers about company presence in Colorado and nationwide.","Educate policymakers about efforts to promote the safety of Formula 1 Grand Prix events.","Educate lawmakers on company policies regarding entry to Formula 1.","Educate lawmakers about the Las Vegas Grand Prix Special Event Assessment Rating; support the DHS Special Event Program and Support Act (H.R. 1508).","Monitor issues related to the Las Vegas Grand Prix Special Event Assessment Rating; monitor the DHS Special Event Program and Support Act (H.R. 1508)."],"years":[2021,2022,2024,2025]}