{
  "id": 100514,
  "name": "LIBERTY MUTUAL INSURANCE COMPANY",
  "slug": "liberty-mutual-insurance-company",
  "state": "MA",
  "description": null,
  "totalSpending": 3140000,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 470000
    },
    {
      "year": 2019,
      "income": 440000
    },
    {
      "year": 2020,
      "income": 660000
    },
    {
      "year": 2021,
      "income": 220000
    },
    {
      "year": 2022,
      "income": 550000
    },
    {
      "year": 2023,
      "income": 440000
    },
    {
      "year": 2024,
      "income": 180000
    },
    {
      "year": 2025,
      "income": 180000
    }
  ],
  "firms": [
    "AKIN GUMP STRAUSS HAUER & FELD"
  ],
  "lobbyists": [
    "SEAN D'ARCY",
    "JEFF MCMILLEN",
    "ARSHI SIDDIQUI",
    "SMITH DAVIS",
    "JOEL JANKOWSKY",
    "ED PAGANO",
    "GEOFF VERHOFF",
    "GREGORY GUICE",
    "JAMES TUCKER",
    "BRENDAN DUNN",
    "VALERIE WHITE",
    "CHRISTOPHER TREANOR",
    "LAUREN O'BRIEN",
    "ZACHARY RUDISILL",
    "GORDON BATES",
    "VIRGIL MILLER"
  ],
  "issues": [
    "TAX",
    "INS",
    "TRA",
    null
  ],
  "sampleDescriptions": [
    "Implementation of the Tax Cuts and Jobs Act of 2017.",
    "Matters relating to U.S.-China bilateral trade negotiations; implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters, international trade negotiations; H.R. 3762, International Insurance Standards Act of 2017; S. 2155, Economic Growth, Regulatory Relief and Consumer Protection Act.",
    "S. 1885, the American Vision for Safer Transportation Through Advancement of Revolutionary Technologies Act.",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters, international trade negotiations; H.R. 4357, International Insurance Standards Act; S. 2155, Economic Growth, Regulatory Relief and Consumer Protection Act.",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters, international trade negotiations.",
    "Follow-on work regarding S. 1885, the American Vision for Safer Transportation Through Advancement of Revolutionary Technologies Act; forthcoming debate on infrastructure proposals in the Congress.",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters, international trade negotiations; the Hong Kong Human Rights and Democracy Act of 2019 (S. 1838).",
    "Implementation of the Tax Cuts and Jobs Act of 2017; H.R. 6359.",
    "Follow-on work regarding S. 1885, the American Vision for Safer Transportation Through Advancement of Revolutionary Technologies Act; forthcoming debate on infrastructure proposals in the Congress; H.R. 6359, Promoting Infrastructure by Protecting Subcontractors and Taxpayers Act.",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters, international trade negotiations; the Hong Kong Human Rights and Democracy Act of 2019 (S. 1838); matters relating to COVID-19 response, business interruption.",
    "Follow-on work regarding S. 1885, the American Vision for Safer Transportation Through Advancement of Revolutionary Technologies Act; H.R. 2, Moving Forward Act; H.R. 6359, Promoting Infrastructure by Protecting Subcontractors and Taxpayers Act.",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters; international trade negotiations; the Hong Kong Human Rights and Democracy Act of 2019 (S. 1838); matters relating to COVID-19 response relating to insurance,including CARES Act (H.R. 3548) and Heroes Act (H.R. 6800).",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters; international trade negotiations; matters relating to COVID-19 response relating to insurance, including CARES Act (H.R. 3548) and Heroes Act (H.R. 6800).",
    "Implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; international regulatory matters; international trade negotiations; matters relating to COVID-19 response relating to insurance, including CARES Act (H.R. 3548), Heroes Act (H.R. 6800), and Coronavirus Response and Relief Act (H.R. 133); H.R. 7412, the Business Interruption Relief Act of 2020.",
    "Tax issues related to GILTI and BEAT.",
    "Follow-on work regarding S. 1885 - the American Vision for Safer Transportation Through Advancement of Revolutionary Technologies Act; H.R. 2 -Moving Forward Act; H.R. 6359 - Promoting Infrastructure by Protecting Subcontractors and Taxpayers Act; Issues related to infrastructure and resiliency.",
    "International regulatory matters; international trade negotiations; matters relating to COVID-19 response relating to insurance, including CARES Act (H.R. 3548), Heroes Act (H.R. 6800), and Coronavirus Response and Relief Act (H.R. 133); H.R. 7412, the Business Interruption Relief Act of 2020; matters related to housing.",
    "Follow-on work regarding S. 1885, the American Vision for Safer Transportation Through Advancement of Revolutionary Technologies Act; H.R. 2, Moving Forward Act; H.R. 6359, Promoting Infrastructure by Protecting Subcontractors and Taxpayers Act.; Issues related to infrastructure and resiliency.",
    "Tax issues related to GILTI and BEAT",
    "International regulatory matters; international trade negotiations; matters relating to COVID-19 response relating to insurance; H.R. 7412, the Business Interruption Relief Act of 2020; matters related to housing."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -62,
  "trajectory": "declining",
  "yearsActive": 8,
  "avgAnnualSpending": 392500,
  "peakYear": 2020,
  "lobbyistCount": 16,
  "firmCount": 1,
  "issueCount": 3,
  "industry": "finance"
}