{"id":104619,"name":"LLOYD'S OF LONDON","slug":"lloyd-s-of-london","state":null,"description":null,"totalSpending":2460000,"filings":18,"yearlySpending":[{"year":2018,"income":550000},{"year":2019,"income":680000},{"year":2020,"income":460000},{"year":2021,"income":330000},{"year":2022,"income":440000}],"firms":["ARNOLD & PORTER KAYE SCHOLER LLP"],"lobbyists":["L LANDGRAF","PAUL HOWARD","MARNE MAROTTA","AMBER HAY"],"issues":["INS"],"sampleDescriptions":["Issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; issues related to the National Flood Insurance Program (H.R. 1422/S. 563); issues related to the Terrorism Risk Insurance Program.","Issues related to the National Flood Insurance Program (H.R. 1666); issues related to the Terrorism Risk Insurance Program; issues related to the implementation and reform of the Dodd-Frank Act; and trade aspects of credit for reinsurance laws.","Issues related to the National Flood Insurance Program (H.R. 1666); issues related to the Terrorism Risk Insurance Act; issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; and insurance aspects of cannabis banking legislation (H.R. 1595/S. 1200).","Issues related to the National Flood Insurance Program (H.R. 1666); issues related to the Terrorism Risk Insurance Act (H.R. 4634, S. 2877); issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; and insurance aspects of cannabis banking legislation (H.R. 1595/S. 1200).","Issues related to the National Flood Insurance Program (H.R. 1666); issues related to the Terrorism Risk Insurance Act (H.R. 4634, S. 2877); issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; insurance aspects of cannabis banking legislation (H.R. 1595/S. 1200); issues related to the surety bond program; and issues related to the federal response to the COVID-19 virus.","Issues related to the National Flood Insurance Program (H.R. 1666); issues related to the Terrorism Risk Insurance Act (H.R. 4634, S. 2877); issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; insurance aspects of cannabis banking legislation (H.R. 1595/S. 1200); issues related to the surety bond program; and issues related to the federal response to the COVID-19 virus, H.R. 7011.","Issues related to the National Flood Insurance Program; issues related to the Terrorism Risk Insurance Act; issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; insurance aspects of cannabis banking legislation; issues related to the surety bond program; and issues related to the federal response to the COVID-19 virus.","Issues related to the National Flood Insurance Program; issues related to the Terrorism Risk Insurance Act; issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; insurance aspects of cannabis banking legislation (H.R. 1996/S.910); issues related to the surety bond program; and issues related to the federal response to the COVID-19 virus, H.R. 5823.","Issues related to the National Flood Insurance Program; issues related to the Terrorism Risk Insurance Act; issues related to the implementation and reform of the Dodd-Frank Act; trade aspects of credit for reinsurance laws; insurance aspects of cannabis banking legislation (H.R. 1996/S.910); issues related to the surety bond program; issues related to the federal response to the COVID-19 virus, H.R. 5823; and issues related to climate change and the insurance industry."],"years":[2018,2019,2020,2021,2022]}