{"id":147582,"name":"LOUISIANA COASTAL PROTECTION AND RESTORATION AUTHORITY","slug":"louisiana-coastal-protection-and-restoration-authority","state":"LA","description":"state agency responsible for protecting and restoring the coast of Louisiana","totalSpending":1175000,"filings":18,"yearlySpending":[{"year":2018,"income":155000},{"year":2019,"income":310000},{"year":2020,"income":330000},{"year":2021,"income":200000},{"year":2022,"income":180000}],"firms":["VAN NESS FELDMAN, LLP"],"lobbyists":["MARY LANDRIEU","RICHARD AGNEW","ROBERT SZABO","STUART HALL"],"issues":["NAT","GOV","DIS","ENV"],"sampleDescriptions":["Seeking laws and Executive Branch policies that expedite the permitting of state projects to protect and restore the Louisiana coast.","Seeking laws and Executive Branch policies that expedite the permitting of state projects to protect and restore the Louisiana Coast.","Seeking laws and Executive Branch policies that expedite the permitting of state projects to protect and restore the Louisiana Coast. Advocacy efforts for passage of H.R. 3814, Domestic Offshore Energy Reinvestment Act of 2019, and S. 2418, COASTAL Act.","- Water Resource Development Acts (House and Senate); \n- Legislation to provide for resource revenue sharing for states hosting federal energy producing activities, including potential changes to the Gulf of Mexico Energy Security Act; and\n- Advocacy efforts for passage of H.R. 3814, Domestic Offshore Energy Reinvestment Act of 2019, and S. 2418, COASTAL Act.","- Water Resource Development Acts (House and Senate)\n- Legislation to provide for resource revenue sharing for states hosting federal energy producing activities, including potential changes to the Gulf of Mexico Energy Security Act.","- Water Resource Development Acts (House and Senate);\n- Legislation to provide for resource revenue sharing for states hosting federal energy producing activities, including potential changes to the Gulf of Mexico Energy Security Act; and\n- Advocacy efforts for passage of H.R. 3814, Domestic Offshore Energy Reinvestment Act of 2019, and S. 2418, COASTAL Act.","- Water Resource Development Acts (House and Senate) - Legislation to provide for resource revenue sharing for states hosting federal energy producing activities, including potential changes to the Gulf of Mexico Energy Security Act.","- Water Resource Development Acts (House and Senate); - Legislation to provide for resource revenue sharing for states hosting federal energy producing activities, including potential changes to the Gulf of Mexico Energy Security Act; and - Advocacy efforts for passage of H.R. 3814, Domestic Offshore Energy Reinvestment Act of 2019, and S. 2418, COASTAL Act."],"years":[2018,2019,2020,2021,2022]}