{"id":195966,"name":"LOUISIANA ARMED FORCES ALLIANCE (PREVIOUSLY KNOWN FORT POLK PROGRESS COMMITTEE)","slug":"louisiana-armed-forces-alliance-previously-known-fort-polk-progress-committee","state":"LA","description":"Military Community Support Organization","totalSpending":1660000,"filings":33,"yearlySpending":[{"year":2018,"income":210000},{"year":2019,"income":200000},{"year":2020,"income":150000},{"year":2021,"income":300000},{"year":2022,"income":200000},{"year":2023,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":200000}],"firms":["THE ROOSEVELT GROUP"],"lobbyists":["CHRISTOPHER GOODE","JOHN SIMMONS","KATHLEEN FERGUSON","KEVIN FELIX","BOBBY CORNETT","JAKOB JOHNSEN","BENJAMIN SCHULTZ"],"issues":["DEF",null],"sampleDescriptions":["Issues related to Army Force Structure, Cyber Forces, FY19 National Defense Authorization Act, and FY19 Military construction.","Issues related to Army Force Structure, Cyber Forces, FY20 National Defense Authorization Act, and FY20 Military construction.","Issues related to Army Force Structure, Cyber Forces, FY20 National Defense Authorization Act, and FY20 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY21 National Defense Authorization Act, and FY20 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY21 National Defense Authorization Act, and FY21 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY22 National Defense Authorization Act, and FY22 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY23 National Defense Authorization Act, and FY23 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY24 National Defense Authorization Act, and FY24 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY25 National Defense Authorization Act, and FY25 Military Construction.","Issues related to Army Force Structure, Cyber Forces, FY26 National Defense Authorization Act, and FY26 Military Construction."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}