{"id":179418,"name":"LPL FINANCIAL LLC","slug":"lpl-financial-llc","state":"MA","description":"&#226;€‹Investment company","totalSpending":1160000,"filings":27,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":160000},{"year":2020,"income":160000},{"year":2021,"income":120000},{"year":2022,"income":160000},{"year":2024,"income":160000},{"year":2025,"income":240000}],"firms":["MINDSET ADVOCACY, LLC"],"lobbyists":["LANGSTON EMERSON","BRIDGET HAGAN","LAUREN BAKER","JESSICA FARRELL","CHARLIE SCHREIBER","ZACHARY OSTRO","RICK DEARBORN","KENDRA ISAACSON","BRANT IMPERATORE","WILLIAM MUELLER"],"issues":["RET","FIN","TAX","BUD"],"sampleDescriptions":["General interest in retirement issues. General interest in issues in Auto-IRA legislation and the SAFE Act, Secure Annuities for Employment Retirement Act.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in issues related to Department of Labor Fiduciary Status as it relates to the role of financial advisors. General interest in the SAVERS Act of 2015, and  the Affordable Retirement Protection Act, regarding a best-interest standard for investment advice.","General interest in issues surrounding tax reform. General interest in corporate tax reform, maintaining tax incentives for retirement plans, maintaining the independent contracting status for our financial advisors.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in issues related to Department of Labor Fiduciary Status as it relates to the role of financial advisors. General interest in the SAVERS Act of 2015, and the Affordable Retirement Protection Act, regarding a best-interest standard for investment advice.","General interest in retirement issues. General interest in issues in Auto-IRA legislation and the SAFE Act","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in issues related to Department of Labor Fiduciary Status as it relates to the role of financial advisors. General interest in the SAVERS Act of 2015, and the Affordable Retirement Protection Act, regarding a best-interest standard for investment advice. Diverse Investment Advisor Act.","General interest in issues surrounding tax reform. General interest in corporate tax reform, maintaining tax incentives for retirement plans, maintaining the independent contracting status for our financial advisors. Issues related to the Tax Cuts and Jobs Act, Section 199-A.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard.  General interest in a best-interest standard for investment advice. General interest in enhancing Diversity and Inclusion best practices within the financial services industry.","General interest in issues surrounding tax reform. General interest in maintaining tax incentives for retirement plans, maintaining the independent contracting status for our financial advisors. Issues related to the Tax Cuts and Jobs Act, Section 199-A.","General interest in retirement issues.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in a best-interest standard for investment advice. General interest in enhancing Diversity and Inclusion best practices within the financial services industry.","General interest in retirement issues. Issues related to independent contracting. Issues related to DOL fiduciary rule.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in a best-interest standard for investment advice. General interest in enhancing Diversity and Inclusion best practices within the financial services industry. Electronic delivery.","General interest in retirement issues. Issues related to independent contracting for financial advisors. Issues related to DOL fiduciary rule.","General interest in issues surrounding tax reform. General interest in maintaining tax incentives for retirement plans, maintaining the independent contracting status for our financial advisors. Issues related to current reconciliation, Section 199-A.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in a best-interest standard for investment advice. General interest in enhancing Diversity and Inclusion best practices within the financial services industry. H.R.2441 - Improving Disclosure for Investors Act of 2025.","General interest in issues surrounding tax reform. General interest in maintaining tax incentives for retirement plans, maintaining the independent contracting status for our financial advisors. Issues related to OB3. Section 199A.","General interest in issues surrounding tax reform. General interest in maintaining tax incentives for retirement plans, maintaining the independent contracting status for our financial advisors. Issues related to implementation of OB3. Section 199A.","General interests in cybersecurity proposals. General interest in proposed Federal Data Breach Notification Standard. General interest in a best-interest standard for investment advice. H.R.2441 - Improving Disclosure for Investors Act of 2025.","Issues related to Section 199A."],"years":[2018,2019,2020,2021,2022,2024,2025]}