{"id":196582,"name":"LUMEN TECHNOLOGIES SERVICE GROUP, LLC","slug":"lumen-technologies-service-group-llc","state":"DC","description":"A multinational communications company.","totalSpending":1180000,"filings":26,"yearlySpending":[{"year":2018,"income":190000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":160000},{"year":2024,"income":120000},{"year":2025,"income":160000}],"firms":["FORBES-TATE"],"lobbyists":["JERRY DRISCOLL","JEFFREY STRUNK","JEFFREY FORBES","FRANKLYN STEINBERG","JEFFREY SADOSKY","DANIEL TATE","WESLEY WELCH","DERRICK WHITE","ELIZABETH BENNETT","SAMANTHA MCLEAN"],"issues":["TAX","HCR","TEC","COM","DEF","BUD"],"sampleDescriptions":["Issues related to the implementation corporate tax reform.","Issues related to opioids task force.","Issues related to cybersecurity; Issues related to net neutrality; Issues related to FCC reform.","Issues related to broadband development.","Issues related to opioids legislation; Issues related to Office of National Drug Control Policy legislation; Issues related to Prescription Drug Monitoring Program legislation.","Issues related to supply chains, NDAA H.R.5515, S.2987.","Issues related to cybersecurity; Issues related to net neutrality; Issues related to FCC reform; Issues related to Rural Utilities Service Broadband Program.","Issues related to cybersecurity; Issues related to net neutrality; Issues related to FCC reform; Issues related to Rural Utilities Service Broadband Program; Issues related to privacy.","Issues related to supply chains, NDAA H.R.5515, S.2987; Issues related to supply chain and logistics.","Issues related to cybersecurity; Issues related to privacy; Issues related to net neutrality; Issues related to FCC reform;Issues related to Rural Utilities Service Broadband Program.","Issues related to the FY 2020 National Defense Authorization Act and supply chains; \nIssues related to supply chain & logistics.","Issues related to cybersecurity; Issues related to privacy; Issues related to net neutrality; Issues related to FCC reform; Issues related to Rural Utilities Service Broadband Program.","Issues related to S. 1790/H.R. 2500 - National Defense Authorization Act for Fiscal Year 2020; Issues related to supply chains and logistics.","Issues related to the implementation of corporate tax reform.","Issues related to broadband development and general rural broadband related issues.","Issues related to opioids legislation, Office of National Drug Control Policy legislation, and prescription drug monitoring program (PDMP) legislation.","Issues related to cybersecurity, privacy, net neutrality, FCC reform, and the Rural Utilities Service (RUS) broadband program.","Issues related to the implementation of corporate tax reform (Public Law 115-97).","Issues related to supply chains and logistics.","Issues related to H.R. 925 - The Heroes Act."],"years":[2018,2019,2020,2021,2022,2024,2025]}