{"id":164495,"name":"LUMEN TECHNOLOGIES, INC. (FORMERLY CENTURYLINK, INC.)","slug":"lumen-technologies-inc-formerly-centurylink-inc","state":"DC","description":"Tech, telecom and broadband provider","totalSpending":1150000,"filings":23,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":200000},{"year":2020,"income":150000},{"year":2021,"income":100000},{"year":2022,"income":200000},{"year":2024,"income":150000},{"year":2025,"income":200000}],"firms":["MERCURY STRATEGIES, LLC"],"lobbyists":["JAMES GREEN","ANDREW FIELDS","ANNE-MARIE KELLEY"],"issues":["TEC","GOV","TAX"],"sampleDescriptions":["Congressional oversight of Connect America Fund; application of Congressional Review Act to FCC's Restoring Internet Freedom Rule; use of predictive analytic technologies help prevent abuse of opioids; H.R.4747 -- Defending U.S. Government Communications Act; implementation of federal tax reform as applied to base erosion; and cybersecurity protection for federal government IT systems; transition of federal agencies to GSA's Enterprise Infrastructure Services contract for communications and IT services.","H.R.2 -- Agricultural Improvement Act (provisions related to Rural Utilities Service broadband programs); and\nH.R.4747 - Defending US Government Communications Act, as well as related provisions in H.R.1515, the John S McCain National Defense Authorization Act for FY 2019 (NDAA).\n\nGeneral lobbying on the following issues:\nCongressional Oversight of the Connect America Fund;\nCongressional Review Act, as applied to the FCCs Restoring Internet Freedom Rule; and\nUse of predictive analytics technology to discourage prescription opioid abuse.","General lobbying on the following issues:\nCybersecurity protection for federal government IT systems; and\nTransition of federal agencies to GSA's Enterprise Infrastructure Services (EIS)  contract for communications and IT services.","H.R.2 -- Agricultural Improvement Act (provisions related to Rural Utilities Service broadband programs);\nH.R.4747 - Defending US Government Communications Act, as well as related provisions in H.R.5515, the John S McCain National Defense Authorization Act for FY 2019 (NDAA); and\nS.3085 - Federal Acquisition Supply Chain Security Act.\n\nGeneral lobbying on the following issues:\nCongressional Oversight of the Connect America Fund;\nCongressional Review Act, as applied to the FCCs Restoring Internet Freedom Rule; \nPermitting and rights of way for broadband infrastructure on federal lands; and\nUse of predictive analytics technology to discourage prescription opioid abuse.","General lobbying on the following issues:\nCybersecurity protection for federal government IT systems; and\nTransition of federal agencies to GSA's Enterprise Infrastructure Services (EIS) contract.","General lobbying on the following issues:\nCybersecurity protection for federal government IT systems, including changes to the Trusted Internet Connection program; and\nTransition of federal agencies to GSA's Enterprise Infrastructure Services (EIS) contract.","H.R.1644 - Save the Internet Act;\nH.R.4747 - Defending US Government Communications Act, as well as related provisions in H.R.5515, the John S McCain National Defense Authorization Act for FY 2019 (NDAA);\nS.3085 - Federal Acquisition Supply Chain Security Act (issues related to DHS implementation); and\nS.3655 - TRACED Act (robocalling).\n\nGeneral lobbying on the following issues:\nCongressional oversight of broadband mapping and the FCCs Form 477 data collection process;\nCongressional Oversight of the Connect America Fund; and\nPermitting and rights of way for broadband infrastructure on federal lands.","H.R.1644 - Save the Internet Act;\nH.R.3375 - Stopping Bad Robocalls Act (and all other bills to counteract robocalling);\nS.1822 - Broadband Data Act (and related House and Senate bills on Broadband Mapping and the FCCs Form 477 data collection);and\nS.3655 - TRACED Act (robocalling).\n\nGeneral lobbying on the following issues:\nCongressional Oversight of the FCCs Connect America Fund;\n5G Leadership Act and telecom industry supply chain security; and\nbroadband network reliability oversight.","H.R.1644 - Save the Internet Act;\nH.R.3375 - Stopping Bad Robocalls Act (and all other bills to counteract robocalling);\nS.1822 - Broadband Data Act (and related House and Senate bills on Broadband Mapping and the FCCs Form 477 data collection); and\nS.3655 - TRACED Act (robocalling).\n\nGeneral lobbying on the following issues:\nCongressional Oversight of the FCCs Connect America Fund and Rural Digital Opportunity Fund;\n5G Leadership Act and telecom industry supply chain security; and\nbroadband network reliability oversight.","S.1032 - RURAL Act (on provisions related to high pole attachment rates).\n\nGeneral lobbying on Federal taxation of rural telephone exchange sales.","General lobbying on the following issues:  congressional oversight of the FCCs Rural Digital Opportunity Fund; the 5G Leadership Act and telecom industry supply chain security; and broadband network reliability oversight.\n\nH.R.1644 - Save the Internet Act;\nH.R.3375 - Stopping Bad Robocalls Act (and all other bills to counteract robocalling);\nS.1032 - RURAL Act (provisions regarding FCC oversight of regulations affecting pole attachment rates and terms);\nS.1822 - Broadband Data Act (and related House and Senate bills on Broadband Mapping); and\nS.3655 - TRACED Act (robocalling).","General lobbying on the following issues:\n\nCybersecurity protection for federal government IT systems, including changes to the Trusted Internet Connection program; \nFederal support for election security; and\nTransition of federal agencies to GSA's Enterprise Infrastructure Services (EIS) contract.","General lobbying on the Congressional oversight of the FCCs Rural Digital Opportunity Fund, FCC regulations affecting pole attachment rates and terms, telecommunications industry supply chain security and congressional oversight of the FCCs Rural Digital Opportunity Fund.\n\nLobbying on the following bills:\n\nH.R. 748 and S. 3548, the CARES Act (Distance learning and rural broadband provisions); \nH.R. 4194 and S. 2661, National Suicide Hotline Designation Act;\nH.R. 4998, Secure and Trusted Communications Networks Act (Pub.L. 116-124 (03/12/2020);\nH.R. 5926, the Resilient Networks Act.\nH.R. 6800, Heroes Act; and\nH.R. 7359/S. 4021, Accelerating Broadband Connectivity Act of 2020.","General lobbying on the following issues:\n\nTransition of federal agencies to the GSA Enterprise Infrastructure Services (EIS) contract; and Cybersecurity protections for federal IT systems.","Lobbying on the following bill:\n\nH.R. 5240, a bill to amend the Internal Revenue Code of 1986 to make the look-thru rule for related controlled foreign corporations permanent.\n\nGeneral lobbying on Federal taxation of rural telephone exchange sales.","General lobbying on Congressional oversight of the FCCs Rural Digital Opportunity Fund and telecommunications industry supply chain security.\n\nLobbying on the following bills:\n\nH.R. 748/S. 3548 -- CARES Act (Distance learning and rural broadband provisions); \nH.R. 4194 and S. 2661 -- National Suicide Hotline Designation Act;\nH.R. 4998 -- Secure Networks Act (Pub.L. 116-124);\nH.R.8000/S.4472 - Ensuring Network Security Act; and\nS. 4021 -- Accelerating Broadband Connectivity Act of 2020.","General lobbying on the following issues:\n\nTransition of federal agencies to the GSA Enterprise Infrastructure Services (EIS) contract;\nCybersecurity protections for federal IT systems; and \n5G testbed provisions of the National Defense Authorization Act.","General lobbying on Congressional oversight of the FCCs Rural Digital Opportunity Fund and telecommunications industry supply chain security; funding of the Broadband Data Act; Covid economic relief provisions on state broadband grants; distance education; and low income broadband support.\n\nLobbying on the following bills:\n\nH.R. 748/S. 3548 -- CARES Act (Distance learning and rural broadband provisions);\nH.R. 1289 - The PHONE Act; \nH.R. 4998 -- Secure Networks Act (Pub.L. 116-124); and \nH.R.8000/S.4472 - Ensuring Network Security Act.","General lobbying on the following issues:\n\nCybersecurity protections for federal IT systems; and \n5G testbed provisions of the National Defense Authorization Act.","General lobbying on the following issues: broadband infrastructure issues; distance learning, broadband investment provisions of the American Rescue Plan; Implementation of low-income broadband programs from Consolidated Appropriations Act of 2020.\n\nSpecific lobbying on the following bills:\n\nH.R.1783/S.745 - Accessible Affordable Internet for All Act;\nH.R.1848 - Leading Infrastructure for Tomorrows America (LIFT) Act; and\nS.922 - Eliminate the Digital Divide Act of 2020."],"years":[2018,2019,2020,2021,2022,2024,2025]}