{
  "id": 137697,
  "name": "MANAGEMENT AND TRAINING CORPORATION",
  "slug": "management-and-training-corporation",
  "state": "UT",
  "description": "Job Corps training company",
  "totalSpending": 2760000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 210000
    },
    {
      "year": 2019,
      "income": 410000
    },
    {
      "year": 2020,
      "income": 440000
    },
    {
      "year": 2021,
      "income": 440000
    },
    {
      "year": 2022,
      "income": 440000
    },
    {
      "year": 2023,
      "income": 410000
    },
    {
      "year": 2024,
      "income": 140000
    },
    {
      "year": 2025,
      "income": 270000
    }
  ],
  "firms": [
    "SQUIRE PATTON BOGGS"
  ],
  "lobbyists": [
    "GENEVIEVE HUBBARD (NEE' BRESNAHAN)",
    "MARGARET GILLEY",
    "JOHN KINGSTON",
    "PHILLIP BIANCHI",
    "BRANDON ROMAN",
    "NATASHA HAMMOND",
    "CAMILO DAZA MANGA",
    "MICHAEL HAWTHORNE",
    "DAVID LESSTRANG",
    "STACY SWANSON",
    "MICHAEL COX",
    "DOMINIC BRAITHWAITE"
  ],
  "issues": [
    "BUD",
    "GOV",
    "LAW",
    "LBR",
    null
  ],
  "sampleDescriptions": [
    "Funding and reform for federal Job Corps training programs.",
    "Advocating for accurate performance range measurements.  Advocacy for reporting accurate Job Corps outcomes.",
    "Advocating for accurate performance range measurements.  Reporting Job Corps. outcomes.",
    "Funding and reform for federal Job Corps training programs.  Advocated on behalf of private prison reform.",
    "Advocated on behalf of private prison reform.",
    "Advocating for accurate performance range measurements.  Reporting Job Corps outcomes.",
    "Funding and reform for federal Job Corps training programs. Advocated on behalf of private prison reform.",
    "Funding and reform for federal Job Corps training programs. Advocated on behalf of private prison reform.  Promoted bonus pay for frontline workers.",
    "Advocating for accurate performance range measurements.  Reporting Job Corps outcomes.  Advocated for flexibility in the Job Corps program during the COVID-19 pandemic",
    "Funding and reform for federal Job Corps training programs. Advocated on behalf of private prison reform.  Advocated for Job Corps flexibilities during COVID-19.",
    "Advocating for accurate Job Corps performance range measurements.  Reporting Job Corps outcomes.  Advocated for flexibility in the Job Corps program during the COVID-19 pandemic.",
    "Advocating for accurate Job Corps performance range measurements. Reporting Job Corps outcomes. Advocated for flexibility in the Job Corps program during the COVID-19 pandemic.",
    "Impact on labor resulting from limitations imposed by policy changes.",
    "Advocating for accurate Job Corps performance range measurements. Reporting Job Corps outcomes.",
    "Lobby on Job Corps related issues and funding. In addition, issues affecting privately operated detention centers. In both capacities we contact Congress and executive agencies when needed.",
    "Lobby on Job Corps related issues and funding; FY 25 appropriations. In addition, issues affecting privately operated detention centers. In both capacities we contact Congress and executive agencies when needed.",
    "Lobby on Job Corps related issues and funding; FY 26 appropriations. In addition, issues affecting privately operated detention centers. In both capacities we contact Congress and executive agencies when needed."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 29,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 345000,
  "peakYear": 2020,
  "lobbyistCount": 12,
  "firmCount": 1,
  "issueCount": 4,
  "industry": "technology"
}