{"id":169726,"name":"MASTERCARD WORLDWIDE","slug":"mastercard-worldwide","state":"DC","description":"Credit card services / processing","totalSpending":1411250,"filings":20,"yearlySpending":[{"year":2018,"income":137500},{"year":2019,"income":275000},{"year":2020,"income":68750},{"year":2021,"income":275000},{"year":2022,"income":275000},{"year":2024,"income":140000},{"year":2025,"income":240000}],"firms":["CGCN GROUP, LLC"],"lobbyists":["STEVE CLARK","SAM GEDULDIG","JAY CRANFORD","MIKE NIELSEN","DOUGLAS SCHWARTZ","JOHN STIPICEVIC","JULIANE SULLIVAN","MICHAEL FREEMAN","KATIE MITCHELL","AARON SZABO","ALEX RENJEL","SCOTT RIPLINGER","AMBER KIRCHHOEFER","TIM PATAKI"],"issues":["TAX","BAN","HOM","FIN","TRA"],"sampleDescriptions":["Monitor issues related to tax reform.","Monitor issues related to PL 111-203 Dodd-Frank Wall Street Reform and Consumer Protection Act, regarding implementation of the provisions in Title X-Bureau of Consumer Financial Protection.\nMonitor issues related to Russian sanctions legislation.\nIssues relating to interchange and card acceptance costs.\nMonitor issues relating to mobile payments.\nMonitor issues related to pre-paid electronic cards.\nMonitor issues related to the Federal Reserve's activities and reports involving oversight of the electronic payment systems.","Monitor issues related to Cyber Security.","Monitor issues related to PL 111-203 Dodd-Frank Wall Street Reform and Consumer Protection Act, regarding implementation of the provisions in Title X-Bureau of Consumer Financial Protection;\nMonitor issues related to Russian sanctions legislation;\nIssues relating to interchange and card acceptance costs;\nMonitor issues relating to mobile payments;\nMonitor issues related to pre-paid electronic cards;\nMonitor issues related to the Federal Reserve's activities and reports involving oversight of the electronic payment systems.","Monitor issues related to PL 111-203 Dodd-Frank Wall Street Reform and Consumer Protection Act, regarding implementation of the provisions in Title X-Bureau of Consumer Financial Protection;\nMonitor issues related to Russian sanctions legislation;\nIssues related to interchange and card acceptance costs;\nMonitor issues related to mobile payments;\nMonitor issues related to pre-paid electronic cards;\nMonitor issues related to the Federal Reserve's activities and reports involving oversight of the electronic payment systems;\nIssues related to faster payments.","Monitor issues related to PL 111-203 Dodd-Frank Wall Street Reform and Consumer Protection Act, regarding implementation of the provisions in Title X-Bureau of Consumer Financial Protection;\nMonitor issues related to Russian sanctions legislation;\nIssues related to interchange and card acceptance costs;\nMonitor issues related to mobile payments;\nMonitor issues related to pre-paid electronic cards;\nMonitor issues related to the Federal Reserve's activities and reports involving oversight of the electronic payment systems;\nIssues related to faster payments;\nMonitored issues pertaining to Cares Act stimulus legislation.","Monitor issues related to PL 111-203 Dodd-Frank Wall Street Reform and Consumer Protection Act, regarding implementation of the provisions in Title X-Bureau of Consumer Financial Protection;\nMonitor issues related to Russian sanctions legislation;\nIssues related to interchange and card acceptance costs;\nMonitor issues related to mobile payments;\nMonitor issues related to pre-paid electronic cards;\nMonitor issues related to the Federal Reserve's activities and reports involving oversight of the electronic payment systems;\nMonitored issues pertaining to Cares Act stimulus legislation.","Issues related to COVID-19 legislation.","Issues related to contactless payments.","Issues related to open banking\nIssues pertaining to tax \nIssues related to Antitrust\nIssues involving payment cards, interchange fees, card issuer practices, the regulation of consumer financial products, and payment transactions initiated with or through a mobile device\nIssues pertaining to payment cards usage and the payment networks role as it relates to the disbursement of public benefits or payroll benefits through the use of a prepaid card\nIssues involving payment cards, payment systems, virtual currencies, and electronic payment transactions \nIssues pertaining to payment card usage and the payments network roles as it relates to the use of prepaid cards\nIssues pertaining to payment card usage and the payment networks role as it relates to network data security initiatives, artificial intelligence, EMV, privacy, and cybersecurity\nIssues pertaining to payment card usage and the adverse potential impacts of global regulations on US institutions \nIssues related to International trade\nIssues related to financial inclusion participation program \nIssues related to trade sanctions\nIssues pertaining to e-commerce as it relates to digital identity services \nIssues related to counterfeit goods\nIssues related to COVID Relieflegislation \nIssues related to CDFI's and MDI's\nIssues related to police reform\nIssues related to delivery of portable benefit solutions for independent workers","Issues pertaining to interchange, debit interchange price controls, and routing mandates for credit cards. Issues related to payments tokenization and card security. Issues related to payments innovation. Issues related to antitrust - S.2992 & H.R. 3816 Issues related to U.S. sanctions on Russia and Belarus. Issues related to international trade - Indo-Pacific Economic Framework. Issues related to financial inclusion participation program. Issues related to CDFIs and MDIs. Issues related to police reform. Issues related to small business development. Issues related to privacy and data protection. Issues related to data governance policies. Issues related to data breach notification legislation. Issues related to cybersecurity and critical infrastructure resiliency. Issues related to cyber incident reporting legislation. Issues related to cybersecurity workforce development and closing the skills gap. Issues related to cybersecurity risk management and cyber hygiene.","Issues pertaining to interchange, debit interchange price controls, and routing mandates for credit cards. Issues related to payments tokenization and card security. Issues related to payments innovation. Issues related to antitrust - S.2992 & H.R. 3816 Issues related to U.S. sanctions on Russia and Belarus. Issues related to trade - Indo-Pacific Economic Framework. Issues related to privacy and data protection. Issues related to data governance policies. Issues related to the data breach notification legislation. Issues related to cybersecurity and critical infrastructure resiliency. Issues related to cyber incident reporting legislation. Issues related to cybersecurity workforce development and closing the skills gap. Issues related to cybersecurity risk management and cyber hygiene. Issues related to taxes and the Senate reconciliation legislation. Issues related to financial inclusion participation program. Issues related to CDFIs and MDIs. Issues related to small business development.","Issues related to interchange, debit interchange price controls, and routing mandates for credit cards. Issues related to merchant category codes (MCCs) and global payment standards. Issues related to payments tokenization and card security - S.936 and H.R. 5502. Issues related to payments innovation. Issues related to digital payments. Issues related to digital assets. Issues related to antitrust reform- S.2992 & H.R. 3816. Issues related to U.S. sanctions on Russia and Belarus. Issues related to trade - Indo-Pacific Economic Framework. Issues related to privacy and data protection. Issues related to cybersecurity. Issues related to financial inclusion. Issues related to CDFIs and MDIs. Issues related to small business development.","Issues related to interchange, debit interchange price controls, and routing mandates for credit cards - S.4674 and H.R. 3816. Issues related to payments tokenization and card security - S.936 and H.R. 5502. Issues related to digital identity - H.R. 4258. Issues related to antitrust reform- S.2992 & H.R. 3816. Issues related to cybersecurity incident reporting - H.R. 2617. Issues related to U.S. sanctions on Russia and Belarus. Issues related to trade - Indo-Pacific Economic Framework. Issues related to global payment standards, merchant category codes (MCCs), and special category merchants. Issues related to payments innovation. Issues related to digital payments. Issues related to digital assets. Issues related to data privacy. Issues related to financial inclusion. Issues related to CDFIs and MDIs.","Issues related to interchange and routing mandates for credit cards (S. 1838 and H.R. 3881, H.R.6487, S.3805, S.5272) Issues related to digital payments and payments innovation Issues related to financial inclusion and small business development Issues related to Artificial Intelligence and payment security Issues related to Open Banking (DFA 1033 Rulemaking, Pub. L. 111-203, Dodd Frank Act) Issues related to Digital Assets (HR 6572, HR 4763) Issues related to cybersecurity in payments, national security in payments (H.R. 8464, the Tokenization Report Act of 2024) Issues related to digital trade and market access Issues related to data privacy (HR 8152) Issues related to acceptance of electronic payments (S.4066, MCCs) Issues related to tax (TCJA)","Issues related to interchange, cost of acceptance, debit interchange price controls, and routing mandates for credit cards (S.1838 and H.R.3881, H.R.6487 and S.3805); Issues related to procurement reform (FIT Procurement Act, S.4066); Issues related to artificial intelligence and payment security; Issues related to digital trade; Issues related to tax.","Issues related to interchange, cost of acceptance, debit interchange price controls, and routing mandates for credit cards; Issues related to artificial intelligence and payment security; Issues related to digital trade and market access; Issues related to cybersecurity; Issues related to digital assets; Issues related to tax.","Issues related to interchange, cost of acceptance, debit interchange price controls, and routing mandates for credit cards; Issues related to payments; Issues related to artificial intelligence; Issues related to digital assets; Issues related to payment security and cybersecurity; Issues related to digital trade, payments, and market access.","Issues related to interchange, cost of acceptance, and routing mandates for credit cards; Issues related to payment security; Issues related to artificial intelligence; Issues related to open banking; Issues related to digital assets; Issues related to digital trade, payments, and market access; Issues related to digital trade, payment security, and market access."],"years":[2018,2019,2020,2021,2022,2024,2025]}