{"id":191990,"name":"MATCH-E-BE-NASH-SHE-WISH BAND OF POTTAWATOMI INDIANS (GUN LAKE TRIBE)","slug":"match-e-be-nash-she-wish-band-of-pottawatomi-indians-gun-lake-tribe","state":"MI","description":"Federally recognized Indian tribal government.","totalSpending":1330000,"filings":27,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":150000},{"year":2020,"income":180000},{"year":2021,"income":240000},{"year":2022,"income":180000},{"year":2024,"income":220000},{"year":2025,"income":240000}],"firms":["SPIRIT ROCK CONSULTING"],"lobbyists":["LARRY ROSENTHAL","AURENE MARTIN","JENNIFER HEIDE VAN DER","DAMIAN PADILLA"],"issues":["IND","GAM","LAW","TAX"],"sampleDescriptions":["Labor, taxation, health care, land into trust.","Gun Lake Trust Land Reaffirmation Act, Pub. L. 113-179","General Tribal Representation, monitor gaming issues, including off-reservation gaming.","General Tribal Representation, monitor gaming issues, including off-reservation gaming.\n\nAdvocate for tribal government funding in the H.R. 748, the CARES Act.","COVID funding for Tribes","Monitor Federal Indian law and policy developments.","Monitor federal gaming policy.","Secure funding for tribal law enforcement, monitor law enforcement issues.","General tribal representation. Support passage of H.R 5732, Grand River Bands of Ottawa Indians Restoration Act of 2023 and H.R. 4524& S. 2695, Parity for Tribal Law Enforcement Act.","General tribal representation, including monitoring legislation that affects tribal sovereignty.","Monitor and advocate for federal legislation related to Tribal law enforcement and public safety, including H.R. 4524 / S. 2695, the Parity for Tribal Law Enforcement Act.","Monitoring federal legislation and administrative actions that affect Tribal sovereignty, governance, and jurisdictional authority.","Monitor tax legislation, advocate for provisions supporting parity for Tribal governments.","Monitor gaming legislation and related regulatory developments. Monitor and advocate for tribal position regarding the illegal use of sports events contracts at the Commodity Futures Trading Commission. Monitor and advocate for tribal interests as the pertain to the confirmation of the chairman of the CFTC.","Monitoring federal legislation and administrative actions that affecting tribes.","Monitor gaming legislation and regulation. Advocate against the illegal use of sports events contracts at the Commodity Futures Trading Commission (CFTC).","Monitor and advocate for H.R. 4712 / S. 2452, the Parity for Tribal Law Enforcement Act."],"years":[2018,2019,2020,2021,2022,2024,2025]}