{"id":195983,"name":"MATRIX DESIGN GROUP ON BEHALF OF THE VIRGINIA SEC. OF VETERANS & DEFENSE AFFAIRS","slug":"matrix-design-group-on-behalf-of-the-virginia-sec-of-veterans-defense-affairs","state":"VA","description":"State government","totalSpending":1920000,"filings":32,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":300000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["THE ROOSEVELT GROUP"],"lobbyists":["JOHN SIMMONS","CHRISTOPHER GOODE","KATHLEEN FERGUSON","KEVIN FELIX","MATTHEW HERRMANN","JAMIE MILLER","BOBBY CORNETT"],"issues":["DEF","AER","BUD",null],"sampleDescriptions":["FY19 National Defense Authorization Act, FY19 Defense and Military Construction appropriations bills. DOD Training Range Enhancement, Military Education Initiative; Shipyard Optimization, Clearinghouse management improvements.","FY19 National Defense Authorization Act, FY19 Defense and Military Construction appropriations bills; issues related to aeronautics and unmanned and autonomous systems research.","FY19 National Defense Authorization Act, FY19 Defense and Military Construction appropriations bills.","FY20 National Defense Authorization Act, FY20 Defense and Military Construction appropriations bills.","FY20 National Defense Authorization Act, FY20 Defense and Military Construction appropriations bills; issues related to aeronautics and unmanned and autonomous systems research.","FY20 National Defense Authorization Act, FY20 Defense and Military Construction appropriations bills. DOD Training Range Enhancement, Military Education Initiative; Shipyard Optimization, Clearinghouse management improvements.","FY20 National Defense Authorization Act, FY20 Defense and Military Construction appropriations bills. Rivanna Station Military Construction, DOD Training Range Enhancement, Military Education Initiative; Shipyard Optimization, Clearinghouse management improvements.","FY20 National Defense Authorization Act, FY20 Defense and Military Construction appropriations bills, Rivanna Station Military Construction, DOD Training Range Enhancement, Military Education Initiative; Shipyard Optimization, Clearinghouse management improvements.","FY21 National Defense Authorization Act, FY21 Defense and Military Construction appropriations bills, Rivanna Station Military Construction, DOD Training Range Enhancement, Military Education Initiative; Shipyard Optimization, Clearinghouse management improvements.","FY21 National Defense Authorization Act, FY21 Defense and Military Construction appropriations bills; issues related to aeronautics and unmanned and autonomous systems research.","FY21 National Defense Authorization Act, FY21 Defense and Military Construction appropriations bills.","FY21 National Defense Authorization Act, FY21 Defense and Military Construction appropriations bills, DOD Training Range Enhancement, Military Education Initiative; F-22 Flight Training Mission; Shipyard Optimization, Clearinghouse management improvements.","FY22 National Defense Authorization Act, FY22 Defense and Military Construction appropriations bills, DOD Training Range Enhancement, Military Education Initiative; F-22 Flight Training Mission; Shipyard Optimization, NGIC SCIF addition.","FY23 National Defense Authorization Act, FY23 Defense, and Military Construction appropriations bills, DOD Training Range Enhancement, Military Education Initiative; F-22 Flight Training Mission; Shipyard Optimization, NGIC SCIF addition.","FY24 National Defense Authorization Act, FY24 Defense and Military Construction appropriations bills, DOD Training Range Enhancement, Military Education Initiative; F-22 Flight Training Mission; Shipyard Optimization, NGIC SCIF addition.","FY25 National Defense Authorization Act, FY25 Defense and Military Construction appropriations bills, DOD Training Range Enhancement, Military Education Initiative; F-22 Flight Training Mission; Shipyard Optimization, NGIC SCIF addition.","FY26 National Defense Authorization Act, FY26 Defense and Military Construction appropriations bills, DOD Training Range Enhancement, Military Education Initiative; F-22 Flight Training Mission; Shipyard Optimization, NGIC SCIF addition."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}