{
  "id": 184952,
  "name": "MCDONALD'S CORPORATION",
  "slug": "mcdonald-s-corporation",
  "state": "DC",
  "description": "Global foodservice retailer",
  "totalSpending": 2620000,
  "filings": 26,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 100000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 320000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 320000
    },
    {
      "year": 2025,
      "income": 320000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "MARY STANTON",
    "ANNE MACMILLAN",
    "NICOLE VENABLE",
    "EMILY PATROLIA",
    "ADAM TARR",
    "DANIELLE BECK",
    "KENNY ROBERTS",
    "KENNETH BARBIC",
    "WILLIAM SITTON",
    "JORDAN BONFITTO"
  ],
  "issues": [
    "AGR",
    "ENV",
    "FOO",
    "EDU",
    "LBR",
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "Issues related to nutrition, agriculture, and sustainability.",
    "Educate Members of Congress on McDonald's Corporation and their supply chain.",
    "Monitor issues related to mitigating greenhouse gasses and legislative issues related to packaging and plastic food containers.",
    "Educate Members of Congress on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion.",
    "Discuss issues related to mitigating greenhouse gasses through supply chain management and expanded renewable energy as well as legislative issues related to packaging and plastic food containers.",
    "Support efforts to stabilize the restaurant industry workforce through COVID-19.",
    "Discuss issues related to mitigating greenhouse gases through supply chain management and expanded renewable energy as well as legislative issues related to packaging and plastic food containers.",
    "Educate Members of Congress on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion; support efforts to stabilize the restaurant industry workforce during COVID-19.",
    "Educate Members of Congress on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion; issues related to workforce stabilization in the restaurant industry during COVID-19.",
    "Monitor issues of importance to U.S. agriculture and the food supply chain.",
    "Monitor issues of importance to the U.S. agriculture and food supply chain.",
    "Monitor legislative and regulatory proposals to create a carbon market for regenerative agriculture practices.",
    "Monitor legislative and regulatory proposals to create a carbon market for regenerative agriculture practices and wide-scale adoption of renewable energy.",
    "Educate Members of Congress on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion; issues related to workforce stabilization in the restaurant industry.",
    "Educate Members of Congress, staff, and the Administration on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion; issues related to workforce stabilization in the restaurant industry.",
    "Educate Members of Congress on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion; pay equity and issues related to workforce stabilization in the restaurant industry.",
    "Monitor issues of importance to the U.S. agriculture and food supply chain. Analyze the impact that funding contained in PL 117-169, the Inflation Reduction Act for climate-smart agriculture, conservation, and rural development, would have on business opportunities.",
    "Educate Members of Congress on McDonald's Corporation and their efforts on workforce development, including diversity and inclusion, pay equity, and issues related to workforce stabilization in the restaurant industry.",
    "Monitor the planning and implementation of the White House Conference on Hunger, Nutrition, and Health with regard to federal nutrition programs and standards.",
    "Monitor issues of importance to the U.S. agriculture and food supply chain, including the impact of PL 117-216 and rail labor negotiations on agriculture. Analyze the impact that funding contained in PL 117-169, the Inflation Reduction Act for climate-smart agriculture, conservation, and rural development, would have on business opportunities."
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 220,
  "trajectory": "exploding",
  "yearsActive": 7,
  "avgAnnualSpending": 277143,
  "peakYear": 2021,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 6
}