{"id":182242,"name":"MCWANE INC.","slug":"mcwane-inc","state":"AL","description":null,"totalSpending":1140000,"filings":21,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":210000},{"year":2020,"income":280000},{"year":2021,"income":170000},{"year":2022,"income":180000},{"year":2024,"income":60000}],"firms":["KELLEY DRYE & WARREN LLP"],"lobbyists":["DUSTIN PAINTER","DANA WOOD","MAGGIE CROSSWY","WILLIAM PALMER","GREG MASTEL","JENNIFER MCCADNEY"],"issues":["BUD","GOV","ROD","TRD","CAW","MAN","DEF","DIS","CHM"],"sampleDescriptions":["H.R.6147, S.3073 - Department of the Interior, Environment, and Related Agencies Appropriations Act, 2019, provisions related to materials requirements for federal aid infrastructure; H.R.5961 - Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2019, provisions related to materials requirements for federal aid infrastructure","Buy American Hire American Executive Order","HR 3387 Drinking Water Systems Improvement Act of 2017;Water resources and surface transportation infrastructure generally (H.R. 8); H.R. 5310 concerning materials specification procedures and innovative materials in federally-aided infrastructure;","HR 3387 Drinking Water Systems Improvement Act of 2017;Water resources and surface transportation infrastructure generally (H.R. 8); H.R. 5310 concerning materials specification procedures and innovative materials in federally-aided infrastructure; S.3021 - America's Water Infrastructure Act of 2018","Domestic procurement preference requirements including Keep Buying American Act, S.405; and draft legislation;  EO 13858 \"Strengthening Buy-American Preferences for Infrastructure Projects.\" \n\nU.S. Customs enforcement of country of origin marking requirements.","Department of Defense Unified Facilities Criteria (UFC) building and fire code as to requirements for portable fire extinguishers.","Federal infrastructure legislation (no bill number) as to federally aid infrastructure investments generally; draft legislation on materials requirements, materials competition and innovative materials used in federally-assisted infrastructure spending; Water Quality Protection and Job Creation Act of 2019\" HR 1497, as to increased authorized spending for clean water infrastructure.\n\nFY 2020 Interior Environment and Related Agencies Appropriations, FY 2020 Agriculture Appropriations related to \"American Iron and Steel\" provisions.","U.S. Customs enforcement of country of origin marking requirements; U.S. Commerce discretion to use adverse facts available in antidumping and subsidy investigations.","Federal Infrastructure legislation (America's Transportation Infrastructure Act of 2019) as to federal-aid infrastructure programs; \"innovative materials\" legislation, S. 403, HR 1159; Water Quality Protection and Job Creation Act of 2019 (H.R. 1497 ) in regard to program authorization and funding.","Domestic procurement preference policies applicable to taxpayer-finance infrastructure spending, including Build America, Buy America Act S. 2056; Made in America Act of 2019 S.1955; EO 13858 and EO on Maximizing Use of American-Made Goods, Products, and Materials.","FY 2020 National Defense Authorization Act in regard to Department of Defense Unified Facilities Criteria (UFC) building and fire code as to requirements for portable fire extinguishers; H.R. 2500, S. 1790.","FY 2020 Interior Environment and Related Agencies Appropriations Act and FY 2020 Agriculture Appropriations Act in regard to federal-aid infrastructure programs materials preference policies,  H.R. 3055, H.R. 3052; H.R. 3164; supplemental appropriations, H.R. 2157.","Federal Infrastructure legislation (S. 2302 America's Transportation Infrastructure Act of 2019) as to federal-aid infrastructure programs; \"innovative materials\" legislation, S. 403, HR 1159; Water Quality Protection and Job Creation Act of 2019 (H.R. 1497 ) in regard to program authorization and funding.","FY 2020 Further Consolidated Appropriations Act (H.R. 1865); FY 2020 Interior Environment and Related Agencies Appropriations Act and FY 2020 Agriculture Appropriations Act in regard to federal-aid infrastructure programs materials preference policies,  H.R. 3055, H.R. 3052; H.R. 3164; supplemental appropriations, H.R. 2157.","FY 2021 Interior Environment and Related Agencies Appropriations Act and FY 2021 Agriculture Appropriations Act in regard to programmatic requirements for federal-assistance water infrastructure programs. Possible infrastructure programs economic stimulus legislation.","Federal Infrastructure legislation (S. 2302 America's Transportation Infrastructure Act of 2019) as to federal-aid infrastructure programs; \"innovative materials\" legislation, S. 403, HR 1159; Water Quality Protection and Job Creation Act of 2019 (H.R. 1497 ) in regard to program authorization and funding; draft Water Resources Development Act generally, draft drinking water infrastructure programs reauthorization, possible infrastructure programs economic stimulus legislation. Possible infrastructure programs economic stimulus legislation.","FY 2021 Interior Environment and Related Agencies Appropriations Act and FY 2021 Agriculture Appropriations Act in regard to programmatic requirements for federal-assistance water infrastructure programs, HR 2, Invest in America Act/Moving Forward Act, public transportation and public works federal infrastructure authorizing legislation, generally.","Line House Surface Transportation Programs Reauthorization (No bill number); Senate Surface Transportation Reauthorizations (no bill numbers); S. 915 Drinking Water and Wastewater Infrastructure Act of 2021; House Water Quality Protection and Job Creation Act of 2021 (no bill number); infrastructure programs authorization generally and as to programmatic requirements.","FY 2022 Interior Environment Appropriations, FY 2022 Agriculture Appropriations and FY 2022 Transportation Housing Appropriations as to appropriations for federal assistance infrastructure programs.","Executive Order 14005 Ensuring the Future Is Made in All of America by All of America's Workers"],"years":[2018,2019,2020,2021,2022,2024]}