{"id":206616,"name":"MERLIN LABS","slug":"merlin-labs","state":"MA","description":"Designs & deploys hardware & software that allows existing aircraft to fly autonomously.","totalSpending":1440000,"filings":17,"yearlySpending":[{"year":2020,"income":150000},{"year":2021,"income":320000},{"year":2022,"income":320000},{"year":2024,"income":360000},{"year":2025,"income":290000}],"firms":["INVARIANT LLC"],"lobbyists":["ANNE PALISI","NOAH KOWALSKI","LINDLEY SHERER","MARK FRIEDMANN","MAIA ESTES","NICK MIKULA","PAUL ARCANGELI","MORGAN VINA","SARA HAGAN"],"issues":["DEF"],"sampleDescriptions":["Educate Members on and work toward inclusion of domestically manufactured, autonomous flight platforms in the National Defense Authorization Act and Department of Defense Appropriations.","Educate members on domestically manufactured, autonomous flight platforms for use by the Department of Defense.","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in the FY 22 National Defense Appropriations Act and Defense Appropriations bill.","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R. 4350/S. 2792, National Defense Authorization Act for Fiscal Year 2022 and H.R. 4432, Department of Defense Appropriations Act, 2022.","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R.4350/S.1605, National Defense Authorization Act for Fiscal Year 2022 and H.R.4432/S.3023, Department of Defense Appropriations Act, 2022.","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R.4350/S.1605, National Defense Authorization Act for Fiscal Year 2022 and H.R.4432/S.3023, Department of Defense Appropriations Act, 2022, and FY23 National Defense Authorization Act.","Educate members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R. 7900/Senate draft National Defense Authorization Act, 2023, and FY23 House and Senate defense appropriations bills.","Educate members and the Administration on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R. 7900/S.4543, and H.R. 8236 and FY23 Senate Department of Defense appropriations bill.","Educate members and the Administration on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R. 7776, the FY23 National Defense Authorization Act, and H.R. 8236/S.4663, FY23 Department of Defense appropriations bill.","Promote domestically manufactured, autonomous flight platforms for DOD and support funding in FY 2024 and FY 2025 Department of Defense appropriations, FY 2025 National Defense Authorization Act.","Educate members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R. 8774, FY 2025 Department of Defense Appropriations Act and Senate FY 2025 Department of Defense Appropriations Act.","Educate members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R.8774 / S.4921, the FY 2025 Department of Defense Appropriations Act.","Educate members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R.8774 / S.4921, FY 2025 Department of Defense Appropriations Act","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in the FY 2026 Department of Defense Appropriations Act.","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in the H.R.4016/S.2572, Department of Defense Appropriations Act, 2026.","Educate Members on domestically manufactured, autonomous flight platforms for use by the Department of Defense in H.R.4016/S.2572, the Department of Defense Appropriations Act, 2026."],"years":[2020,2021,2022,2024,2025]}