{"id":195365,"name":"META PLATFORMS INC (FORMERLY FACEBOOK INC & VARIOUS SUBSIDIARIES)","slug":"meta-platforms-inc-formerly-facebook-inc-various-subsidiaries","state":"CA","description":"Online Social Network","totalSpending":1270000,"filings":24,"yearlySpending":[{"year":2018,"income":140000},{"year":2019,"income":170000},{"year":2020,"income":120000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":180000}],"firms":["STEWART STRATEGIES AND SOLUTIONS, LLC"],"lobbyists":["JENNIFER STEWART","EBONY SIMPSON","KICHELLE WEBSTER","CHONYA DAVIS-JOHNSON"],"issues":["TEC","LAW","INT","CPI"],"sampleDescriptions":["Surveillance reform; Broadband infrastructure; diversity efforts; privacy, online safety and tax; online advertising and platform transparency efforts; election security; Sec 230 of the Communications Decency Act; Allow States and Victims to Fight Online Sex Trafficking Act of 2017 H.R. 1865.","Diversity efforts; privacy; online advertising and platform transparency","Privacy, online advertising and platform transparency, housing, cybersecurity, workforce","Privacy, online advertising and platform transparency, cybersecurity, workforce","Privacy, issues related to blockchain policy, antitrust, online advertising and platform transparency and cybersecurity.","Privacy, issues related to blockchain policy, antitrust, online advertising and platform transparency, cybersecurity","Privacy, antitrust, online advertising and platform transparency and cybersecurity.","Privacy, cryptocurrency, antitrust, online advertising and platform transparency and cybersecurity.","Privacy, cryptocurrency, antitrust, online advertising and platform transparency, cybersecurity","Privacy, antitrust, online advertising and platform transparency","Privacy, election security, online advertising and platform transparency","Privacy; online advertising and platform transparency; anti-trust; disinformation.","Privac; online advertising and platform transparency; anti-trust; disinformation.","Program carriage; privacy; broadband infrastructure adoption and deployment.","Program carriage; privacy; broadband infrastructure adoption and deployment. H.R. John Lewis Voting Rights Advancement Act.","Privacy; election security; online advertising and platform transparency; anti-trust; disinformation and H.R. 5376, Build Back Better Act.","Privacy; election security; online advertising and platform transparency; anti-trust; disinformation.","Privacy; Online advertising and platform transparency; Disinformation; Artificial Intelligence; Small business.","Privacy; Online advertising and platform transparency; Disinformation; Artificial Intelligence.","-Privacy -Online advertising and platform transparency -Cybersecurity -Artificial Intelligence"],"years":[2018,2019,2020,2021,2022,2024,2025]}