{"id":124785,"name":"MILLE LACS BAND OF OJIBWE INDIANS","slug":"mille-lacs-band-of-ojibwe-indians","state":"MN","description":null,"totalSpending":1900000,"filings":26,"yearlySpending":[{"year":2018,"income":270000},{"year":2019,"income":360000},{"year":2020,"income":340000},{"year":2021,"income":280000},{"year":2022,"income":280000},{"year":2024,"income":190000},{"year":2025,"income":180000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["GERRY SIKORSKI","PHILIP BAKER-SHENK","KAYLA GEBECK","MICHAEL GALANO","CAMRYN TOWLE","KENNETH PARSONS","CHASE GERMANN","JAMES MEGGESTO"],"issues":["BUD","IND","TAX","NAT","GAM"],"sampleDescriptions":["Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; appropriations for Indian Country; environmental infrastructure; Water Resources Development Act Reauthorization; Professional And Amateur Sports Protection Act - PASPA.","Issues related to Indian economic development/gaming, IGRA and Indian sovereignty and rights, Indian Self-Governance Act, reservations and Tribal Law Enforcement Act, Appropriations for Indian Country programs; Professional and Amateur Sports Protection Act - PAPSA; Tribal Law and Order Act (TLOA); law enforcement issues.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act;  Appropriations for Indian Country programs; Professional and Amateur Sports Protection Act - PASPA; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act;  Appropriations for Indian Country programs; Professional and Amateur Sports Protection Act - PASPA; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention; Reservation Law Enforcement Authority; Indian education, policy and funding.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Professional and Amateur Sports Protection Act - PASPA; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention; Reservation Law Enforcement Authority; Indian education, policy and funding.","S.750 & H.R. 1680, New Markets Tax Credit Extension Act of 2019.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Professional and Amateur Sports Protection Act - PASPA; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention; Reservation Law Enforcement Authority; Indian education, policy and funding; trust land.","S.750 & H.R. 1680, New Markets Tax Credit Extension Act of 2019; Tax Fairness for Tribal Youth.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Professional and Amateur Sports Protection Act - PASPA; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention; Reservation Law Enforcement Authority; Indian education, policy and funding; trust land; tribal labor sovereignty; Tax Fairness for Tribal Youth; 477 programs; Missing and Murdered Indian Women.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention; Reservation Law Enforcement Authority; Indian education, policy and funding; trust land; tribal labor sovereignty; Tax Fairness for Tribal Youth; 477 programs; Missing and Murdered Indian Women; coronavirus relief; CARES Act.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; appropriations for Indian Country; environmental infrastructure; Water Resources Development Act Reauthorization; Professional And Amateur Sports Protection Act - PASPA; coronavirus response; CARES Act.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Tribal Law and Order Act (TLOA); law enforcement issues; opioid treatment and addiction prevention; Reservation Law Enforcement Authority; Indian education, policy and funding; trust land; tribal labor sovereignty; Tax Fairness for Tribal Youth; 477 programs; Missing and Murdered Indian Women; coronavirus relief; CARES Act eligibility and implementation.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Indian education, policy and funding; Missing and Murdered Indian Women; coronavirus relief; CARES Act eligibility and implementation.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; appropriations for Indian Country; coronavirus response; CARES Act.","CARES Act and Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation; economic development/gaming; IGRA and Indian sovereignty and rights; appropriations.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Indian education, policy and funding; Missing and Murdered Indian Women; coronavirus relief; CARES Act eligibility and implementation; Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act implementation; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Indian education, policy and funding; Missing and Murdered Indian Women; coronavirus relief; CARES Act eligibility and implementation; Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation; tax issues.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act implementation; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Indian education, policy and funding; Missing and Murdered Indian Women; coronavirus relief; American Rescue Plan Act of 2021 enactment and implementation; tax issues; self-determination and self-governance policy; tribal status.","American Rescue Plan Act of 2021 enactment and implementation; economic development/gaming; IGRA and Indian sovereignty and rights; appropriations.","Issues related to Indian economic development/gaming; IGRA and Indian sovereignty and rights; Tribal Self-Governance Act implementation; reservations and Tribal Law Enforcement Act; Appropriations for Indian Country programs; Indian education, policy and funding; Missing and Murdered Indian Women; coronavirus relief; American Rescue Plan Act of 2021 enactment and implementation; tax issues; self-determination and self-governance policy; tribal status; Infrastructure, Investment and Jobs Act implementation."],"years":[2018,2019,2020,2021,2022,2024,2025]}