{"id":211618,"name":"MINN-DAK FARMERS COOPERATIVE","slug":"minn-dak-farmers-cooperative","state":"ND","description":"Sugarbeet processor.","totalSpending":1210000,"filings":14,"yearlySpending":[{"year":2021,"income":130000},{"year":2022,"income":360000},{"year":2024,"income":360000},{"year":2025,"income":360000}],"firms":["SCHERTZ STRATEGIES, LLC"],"lobbyists":["MATT SCHERTZ"],"issues":["AGR","BUD","TRD","IMM"],"sampleDescriptions":["Farm bill and sugar policy, Budget and Appropriations","Farm bill implementation and administration of U.S. sugar policy; FY 2022 Continuing Resolution (H.R. 5305) regarding agricultural disaster assistance; FY 2022 Budget Resolution (S. Con. Res. 14) and budget reconciliation regarding agriculture.","FY 2022 Continuing Resolution (H.R. 5305) regarding agricultural disaster assistance; FY 2022 Budget Resolution (S. Con. Res. 14) and budget reconciliation regarding agriculture.","H.R. 2471, FY2022 Consolidated Appropriations Act regarding agriculture.","Farm bill implementation and administration of U.S. sugar policy.","HR 8239, FY 2023 Agriculture Appropriations Bill, regarding agriculture and US sugar policy.","Administration of US sugar policy.","Issues related to the H-2A Temporary Agriculture Worker Program. HR 1603, Farm Workforce Modernization Act of 2021.","HR 8239, FY 2023 Agriculture Appropriations Bill, regarding agriculture and US sugar policy. HR 8294, Consolidated Appropriations Act, regarding agriculture.","HR 8239, FY 2023 Agriculture Appropriations Bill, regarding agriculture and US sugar policy. HR 2617, Consolidated Appropriations Act, 2023, regarding agriculture.","Issues related to the H-2A Temporary Agriculture Worker Program.","HR 4368, S2131, FY 2024 Agriculture Appropriations Bill, regarding agriculture and U.S. sugar policy. HR 4366, FY 2024 Consolidated Appropriations Act, regarding agriculture and U.S. sugar policy. FY 2025 Budget process regarding agriculture.","Issues and bills regarding the development of the 2024 Farm Bill. Farm Bill implementation and administration of U.S. sugar policy.","H.R.9027, S.4690 FY 2025 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act. FY 2025 Budget process regarding agriculture.","H.R.8467 Farm, Food, and National Security Act of 2024. Issues and bills regarding the development of the 2024 Farm Bill. Farm Bill implementation and administration of U.S. sugar policy.","H.R.9027, S.4690 FY 2025 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act. FY 2025 Budget process regarding agriculture. HR 10545, American Relief Act, regarding agriculture.","FY 2026 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations. HR 10545, American Relief Act, regarding agriculture. FY 2025 Budget process regarding agriculture. H. Con. Res. 14 and S. Con. Res. 7, FY 2025 Budget Resolution.","H.R.8467 Farm, Food, and National Security Act of 2024. Issues and bills regarding the development of the 2025 Farm Bill. Farm Bill implementation and administration of U.S. sugar policy.","H.R.4121, S. 2256, FY 2026 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations. HR 10545, American Relief Act, regarding agriculture. FY 2025 Budget process regarding agriculture. H. Con. Res. 14, FY 2025 Concurrent Budget Resolution. H.R.1, One Big Beautiful Bill Act, regarding Agriculture and the 2025 Farm Bill.","Issues and bills regarding the development of the 2025 Farm Bill. Farm Bill implementation and administration of U.S. sugar policy."],"years":[2021,2022,2024,2025]}