{"id":183802,"name":"MISSISSIPPI STATE UNIVERSITY","slug":"mississippi-state-university","state":"MS","description":null,"totalSpending":1150000,"filings":23,"yearlySpending":[{"year":2018,"income":100000},{"year":2019,"income":200000},{"year":2020,"income":150000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":150000},{"year":2025,"income":150000}],"firms":["FEDERAL SOLUTIONS, LLC"],"lobbyists":["MARTY FULLER"],"issues":["HOM","TRA","VET","ENG","MED","EDU","AER","SCI","DEF","ROD","LAW","NAT","AGR"],"sampleDescriptions":["Homeland Security Appropriation Bill: Provisions relating to research and development.","Transportation/HUD Appropriation Bill: Provisions relating to research and development.","Military/Veterans Appropriation Bill: Provisions relating to research and education.","Energy Appropriation Bill: Provisions relating to research and development.","Labor/HHS/Education Appropriation Bill: Provisions relating to disease research.","Education Appropriation Bill: Provisions relating to Department of Education and research.","Commerce/Justice/Science Appropriation Bill: Provisions relating to research and development.","Commerce/Justice/Science Appropriation Bill: Provisions relating to research and development in NOAA.","Defense Appropriation Bill: Provisions relating to research and development.","Transportation/HUD Appropriation Bill: Provisions relating to infrastructure and improvement.","Commerce/Justice/Science Appropriation Bill: Provisions relating to research and development in DoJ.","Provisions relating to natural resources research and development.","Agriculture Appropriation Bill: Provisions relating to agricultural research.","Military/Veterans Appropriations: Provisions relating to research and education.","Agriculture Appropriations: Provisions relating to agricultural research.","Energy Appropriations: Provisions relating to research and development.","Education Appropriations: Provisions relating to Department of Education and research.","Homeland Security Appropriations: Provisions relating to research and development.","Labor/HHS/Education Appropriations: Provisions relating to disease research.","Commerce/Justice/Science Appropriations: Provisions relating to research and development in NOAA."],"years":[2018,2019,2020,2021,2022,2024,2025]}