{
  "id": 192297,
  "name": "MORTGAGE RESEARCH CENTER, LLC",
  "slug": "mortgage-research-center-llc",
  "state": "MO",
  "description": "Mortgage lending, VA issues.",
  "totalSpending": 1590000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 173000
    },
    {
      "year": 2019,
      "income": 153000
    },
    {
      "year": 2020,
      "income": 204000
    },
    {
      "year": 2021,
      "income": 120000
    },
    {
      "year": 2022,
      "income": 220000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "MR. ROBERT ZIMMER"
  ],
  "lobbyists": [
    "ROBERT ZIMMER"
  ],
  "issues": [
    "FIN",
    "HOU",
    null
  ],
  "sampleDescriptions": [
    "VA mortgage issues including QM rules related to VA lending.\nVA home appraisal policy.\nVA refi churning concerns in industry.\nVA mortgage issues in S. 2155.",
    "VA mortgage issues including QM rules related to VA lending.\nVA refi churning concerns in industry.\nVA's track record of being best in default rates for 10+ years.",
    "VA mortgage issues including QM rules related to VA lending.\nVA refi churning concerns in industry.\nVA's track record of being best in default rates for 10+ years.\nVA guarantee fees being hiked to fund non-housing programs.",
    "VA mortgage guarantee fees used as PAYFORs in HR 299, Blue Water Navy Act; loan limits in same bill.\n\nNonbank counterparty risk policy in general.",
    "VA mortgage guarantee fees used as PAYFORs in HR 3504.\n\nNonbank counterparty risk policy in general.",
    "VA mortgage guarantee fees used as PAYFORs in HR 3504, other legislation.\n\nNonbank counterparty risk policy in general.",
    "VA mortgage guarantee fees used as PAYFORs in HR 3504, other pending legislation.\n\nNonbank counterparty risk policy in general.",
    "VA mortgage guarantee fees used as PAYFORs in HR 3504, other pending legislation.\n\nNonbank counterparty risk policy in general.\n\nGinnie Mae policies related to COVID.",
    "Marketplace obstacles for veterans seeking to use their earned benefit; keeping costs low and related to risk.",
    "The challenges of using VA mortgage guarantee fees for non-housing purposing (non-bill specific).\n\nVA mortgage obstacles for veterans.  \n\nAppraisal policy in a fast-moving mortgage market.",
    "Marketplace obstacles for veterans seeking to use their earned benefit; keeping costs low and related to actual risk.",
    "The challenges of using VA mortgage guarantee fees for non-housing purposes (non-bill specific). VA mortgage obstacles for veterans. Appraisal policy in a fast-moving mortgage market.",
    "The challenges of using VA mortgage guarantee fees for non-housing purposes (non-bill specific). VA mortgage obstacles for veterans.",
    "Ensuring VA mortgage fees better match actuarial costs; appraisal matters; credit scoring policy. The use of real estate brokers for VA mortgages post Sitzer judicial decision.",
    "Ensuring VA mortgage fees better match actuarial costs; appraisal matters; loss mitigation waterfalls. The use of real estate brokers for VA mortgages post Sitzer judicial decision. High mortgage fees that increase price of homeownership.",
    "Ensuring VA mortgage fees better match actuarial costs; appraisal matters; loss mitigation waterfalls. The use of real estate brokers for VA mortgages post Sitzer judicial decision. High mortgage fees that increase price of homeownership. Trigger Leads, including S. 3502.",
    "Ensuring VA mortgage fees better match actuarial costs; appraisal matters; loss mitigation waterfalls. High mortgage fees that increase price of homeownership. Trigger Leads, including S. 3502.",
    "VASP and partial indemnification policy issues; VA guaranty fees not being used for non-housing purposes.",
    "HR 1815, VASP and partial indemnification policy issues; VA guaranty fees not being used for non-housing purposes. Need for mortgage credit score modernization.",
    "HR 1815, VASP and partial indemnification policy issues; VA guaranty fees not being used for non-housing purposes. Need for mortgage credit score modernization. Use of mortgage g fees to fund non-housing programs."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 39,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 198750,
  "peakYear": 2023,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 2,
  "industry": "finance"
}