{
  "id": 129539,
  "name": "MUSKET CORPORATION",
  "slug": "musket-corporation",
  "state": "OK",
  "description": "Commodity supply, trading and logistics company.",
  "totalSpending": 1510000,
  "filings": 27,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 240000
    },
    {
      "year": 2019,
      "income": 160000
    },
    {
      "year": 2020,
      "income": 210000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "THE RUSSELL GROUP, INC."
  ],
  "lobbyists": [
    "TYSON REDPATH",
    "KARLA THIEMAN",
    "ASHLEE JOHNSON"
  ],
  "issues": [
    "ENG",
    null
  ],
  "sampleDescriptions": [
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; reauthorization of biodiesel and alternative fuels tax credit.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; reauthorization of biodiesel and alternative fuels tax credit; H.R.2089 - Biodiesel Tax Credit Extension Act of 2019.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; H.R.2089 - Biodiesel Tax Credit Extension Act of 2019; issues pertaining to COVID-19 and petroleum markets.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; issues pertaining to COVID-19 and petroleum markets; issues related to alternative fuels tax credit.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; issues related to alternative fuels tax credit; H.R.133 - Consolidated Appropriations Act, 2021.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; issues related to tax policy.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; issues related to tax policy; H.R.3684 - Infrastructure Investment and Jobs Act.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; H.R.3684 - Infrastructure Investment and Jobs Act.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; H.R.3684 - Infrastructure Investment and Jobs Act; biodiesel blenders tax credit.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; issues pertaining to implementation of the Inflation Reduction Act.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; and issues pertaining to implementation of the Inflation Reduction Act.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels; and issues pertaining to H.R. 1-One Big Beautiful Bill Act.",
    "Issues related to the integrity and implementation of the Renewable Fuel Standard (RFS) program as it applies to biodiesel and cellulosic fuels."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -37,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 188750,
  "peakYear": 2018,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 1
}