{
  "id": 120018,
  "name": "NATAT (NATIONAL ASSN OF TOWNS AND TOWNSHIPS",
  "slug": "natat-national-assn-of-towns-and-townships",
  "state": "DC",
  "description": null,
  "totalSpending": 1570000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 110000
    },
    {
      "year": 2019,
      "income": 160000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 250000
    },
    {
      "year": 2024,
      "income": 250000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "THE FERGUSON GROUP"
  ],
  "lobbyists": [
    "JENNIFER IMO",
    "AINDRIU COLGAN",
    "DAVID HOOVER",
    "STEPHANIE MISSERT",
    "ZACHARY ISRAEL",
    "REBECCA BLISS",
    "MARK LIMBAUGH",
    "WILLIAM GWINN",
    "LORI PICKFORD",
    "CHRISTOPHER KEARNEY",
    "JEREMIAH VAN AUKEN",
    "CHRISTOPHER GRIFFIN"
  ],
  "issues": [
    "BUD",
    "TEC",
    "TAX",
    "TRA",
    "HOU",
    "SMB",
    "GOV",
    null,
    "AGR",
    "LBR"
  ],
  "sampleDescriptions": [
    "FY 19 Budget and Appropriation; identify priority programs.",
    "Support legislation to promote/accelerate broadband deployment. Oppose legislation that would preempt a bill that would preempt local decision-making authority in broadband deployment.",
    "Bills to provide tax benefits to volunteer first responders; Support H.R. 5003, a bill to reinstate advanced refunding bonds; Volunteer Responder Incentive Protection Act (H.R. 1550/S.1238); and the LOSAP CAP (H.R. 1720/S.1239).",
    "Monitor and report on broadband deployment bills and other federal action, including S. 3157, the STREAMLINE Small Cell Deployment Act.",
    "Communicate FY 2019 budget and appropriations priorities.",
    "Support H.R. 5003, a bill to reinstate advance refunding bonds; support the Volunteer Responder Incentive Protection Act (H.R 1550/S. 1238), a bill to provide tax incentives to volunteer first responders.",
    "Support H.R. 5003, a bill to reinstate advance refunding bonds; H.R.1241/S.1210 - Volunteer Responder Incentive Protection Act.",
    "Support HR 530, legislation to nullify the FCCs Small Cell Order related to 5G deployment; HR 2643, the Broadband MAPS Act that directs the FCC to establish a challenge process to verify fixed and mobile broadband service coverage data; S. 842, Improving Broadband Mapping Act to improve the mapping of wireless broadband coverage including collecting data from State, local, or Tribal entities; and HR 1328/S. 1046, the ACCESS Broadband Act that establishes the Office of Internet Connectivity and Growth, and for other purposes.",
    "Communicate FY 2020 budget and appropriations priorities.",
    "Communicate NATAT's priorities in FAST ACT re-authorization",
    "Support H.R. 2772, a bill to reinstate advance refunding bonds; H.R.1241/S.1210 - Volunteer Responder Incentive Protection Act; support legislative efforts to eliminate the cap on states and local deductions or SALT.",
    "Support H.R. 2772, a bill to reinstate advance refunding bonds; H.R.1241/S.1210 - Volunteer Responder Incentive Protection Act; support legislative efforts to eliminate the cap on states and local deductions or SALT; support elimination of the Cadillac Tax.",
    "Communicate NATAT's priorities in FAST Act re-authorization.",
    "Communicate FY 2020 budget and appropriations priorities; communicate program priorities for COVID-19 related funding.",
    "Support HR 530, legislation to nullify the FCCs Small Cell Order related to 5G deployment; HR 2643, the Broadband MAPS Act that directs the FCC to establish a challenge process to verify fixed and mobile broadband service coverage data; S. 842, Improving Broadband Mapping Act to improve the mapping of wireless broadband coverage including collecting data from State, local, or Tribal entities; the ACCESS Broadband Act that establishes the Office of Internet Connectivity and Growth, and for other purposes.",
    "Communicate program priorities for COVID-19 related funding.",
    "Work on NATaT priorities in the Invest in America Act (HR 322)/Moving Forward Act (HR 2).",
    "Support H.R. 8097/S. 2982, the Volunteer First Responder Housing Act, that would expand eligibility for certain housing programs as a recruitment and retention tool for volunteer first responders.",
    "Support H.R. 7996, the Rural Equal Aid Act, which would provide relief to rural small businesses, local governments, and other entities during the pandemic by subsidizing payments made under certain USDA Rural Development loan programs, similar to relief already granted to Small Business Administration loans.",
    "Support H.R. 8097/S. 2982, the Volunteer First Responder Housing Act, that would expand eligibility for certain housing programs as a recruitment and retention tool for volunteer first responders. (Consolidated Appropriations Act, 2021 (P.L. 116-260))."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 82,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 196250,
  "peakYear": 2023,
  "lobbyistCount": 12,
  "firmCount": 1,
  "issueCount": 9
}