{
  "id": 186654,
  "name": "NATIONAL ELECTRICAL MANUFACTURERS ASSOCIATION",
  "slug": "national-electrical-manufacturers-association",
  "state": "VA",
  "description": null,
  "totalSpending": 1840000,
  "filings": 23,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 320000
    },
    {
      "year": 2019,
      "income": 320000
    },
    {
      "year": 2020,
      "income": 320000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    }
  ],
  "firms": [
    "KOUNTOUPES DENHAM CARR & REID, LLC"
  ],
  "lobbyists": [
    "LORI DENHAM",
    "JULIE CARR",
    "ROSE SULLIVAN (LISTED IN ERROR)",
    "DAVID PELUSO",
    "MARY REID",
    "MJ KENNY",
    "ADAM HECHAVARRIA",
    "DENISE MOUSOURIS",
    "MARY BEAL",
    "LESLIE ZELENKO"
  ],
  "issues": [
    "VET",
    "TAX",
    "HCR",
    "TRD",
    "HOM",
    "NAT",
    "BUD",
    "DEF",
    "CPT",
    null
  ],
  "sampleDescriptions": [
    "Issues related to VA acquisition of medical imaging technology including supply chain and Potential Effects of Kingdomware decision on High Tech Medical Imaging Equipment (HTME) purchases.",
    "Issues related to the repeal of the medical device excise tax including S.108, the Medical Device Access and Innovation Protection Act and H. R. 184, the Protect Medical Innovation Act of 2017, and H. R.4617. H. R. 195, Making further continuing appropriations for the fiscal year ending September 30, 2018, and for other purposes.  H. R. 1892, the Bipartisan Budget Act of 2018.  H. R. 1625, the Consolidated Appropriations Act of 2018.",
    "Issues related to service of medical devices.  Issues related to the regulation of contrast agents and medical imaging indications.  Issues related to cybersecurity related to medical devices. Issues related to H. R. 2118, the Medical Device Servicing Safety and Accountability Act.  Issues related to H. R. 2009, the Fostering Innovation in Medical Imaging Act of 2017. H. R. 195, Making further continuing appropriations for the fiscal year ending September 30, 2018, and for other purposes.  H. R. 1892, the Bipartisan Budget Act of 2018.  H. R. 1625, the Consolidated Appropriations Act of 2018.",
    "Issues related to global trade and the competitiveness including the China 301 action.",
    "Issues related to the repeal of the medical device excise tax including S.108, the Medical Device Access and Innovation Protection Act and H. R. 184, the Protect Medical Innovation Act of 2017, and H. R.4617.",
    "Issues related to service of medical devices.  Issues related to the regulation of contrast agents and medical imaging indications.  Issues related to cybersecurity related to medical devices. Issues related to H. R. 2118, the Medical Device Servicing Safety and Accountability Act.  Issues related to H. R. 2009, the Fostering Innovation in Medical Imaging Act of 2017.",
    "Issues related to cybersecurity in medical devices.",
    "Issues related to the affordability and availability of Helium for use by the medical imaging manufacturing community.",
    "Issues related to third party servicing of medical imaging devices.  Issues related to the regulation of contrast agents and medical imaging indications.  Issues related to cybersecurity related to medical devices.",
    "Issues related to global trade and the competitiveness.",
    "Issues related to the repeal of the medical device excise tax, including S.692 and H. R. 2207, the Protect Medical Innovation Act of 2019.",
    "General education about medical imaging technology and issues related to VA use of device alternatives to opioids, FY2020 Military Construction VA Appropriations Legislation.",
    "Issues related to VA use of device alternatives to opioids and FY 2020 Military Construction VA Appropriations Bill.",
    "Issues related to third party servicing of medical imaging devices.  Issues related to the regulation of contrast agents and medical imaging indications.  Issues related to cybersecurity related to medical devices.  Issues related to focused ultrasound.",
    "Issues related to the repeal of the medical device excise tax, including S.692 and H. R. 2207, the Protect Medical Innovation Act of 2019, and H. R. 1865, the Further Consolidated Appropriations Act of 2020.",
    "H. R. 5238 and S. 5238, Legislation to revise coverage of primary and preventive health services for women under the TRICARE program to include the use of digital breast tomosynthesis in breast cancer screening.",
    "Issues related to third party servicing of medical imaging devices.  Issues related to the regulation of contrast agents and medical imaging indications.  Issues related to cybersecurity related to medical devices.  Issues related to focused ultrasound. H. R. 5238 and S. 5238, Legislation to revise coverage of primary and preventive health services for women under the TRICARE program to include the use of digital breast tomosynthesis in breast cancer screening.",
    "Issues related to global trade and the competitiveness. Issues relating to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including device supply chain provisions.",
    "Issues related to third party servicing of medical imaging devices.  Issues related to the regulation of contrast agents and medical imaging indications.  Issues related to cybersecurity related to medical devices.  Issues related to focused ultrasound. H. R. 5238 and S. 5238, Legislation to revise coverage of primary and preventive health services for women under the TRICARE program to include the use of digital breast tomosynthesis in breast cancer screening. Issues related to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including medical device supply chain provisions.  Issues related to AI in healthcare.",
    "Issues related to global trade and the competitiveness. Issues relating to H.R. 748, Coronavirus Aid, Relief, and Economic Security Act (CARES Act), including supply chain provisions."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 6,
  "avgAnnualSpending": 306667,
  "peakYear": 2018,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 9,
  "industry": "energy"
}