{
  "id": 201639,
  "name": "NATIONAL CANNABIS ROUNDTABLE",
  "slug": "national-cannabis-roundtable",
  "state": "DC",
  "description": "Trade Association",
  "totalSpending": 1716500,
  "filings": 27,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 245000
    },
    {
      "year": 2020,
      "income": 374000
    },
    {
      "year": 2021,
      "income": 246000
    },
    {
      "year": 2022,
      "income": 327500
    },
    {
      "year": 2023,
      "income": 327500
    },
    {
      "year": 2024,
      "income": 196500
    }
  ],
  "firms": [
    "THE LIAISON GROUP, LLC"
  ],
  "lobbyists": [
    "RACHAEL GALOOB",
    "COURTNEY STAMM",
    "DAVID MANGONE",
    "ERIN MOFFET"
  ],
  "issues": [
    "BAN",
    "FIN",
    "BUD",
    "GOV",
    "LAW",
    "CSP",
    null
  ],
  "sampleDescriptions": [
    "HR 1595 SAFE Banking Act \n\nWe support the Secure and Fair Enforcement (SAFE) Banking Act, which\nwould ensure that lawful and regulated cannabis businesses have access to banking\nand capital markets, while ensuring that safe and sound financial standards and\nprocedures remain in place for the financial institutions interested in offering services to\nthis marketplace. We urge Congress to provide states with the means to bank, track\nand tax this inevitable and significant economy.",
    "HR 1595: Safe Banking Act\n\nThis bill ensures that lawful and regulated cannabis businesses have access to banking and capital markets, while ensuring that safe and sound financial standards and procedures remain intact for the financial institutions interested in offering services to the cannabis marketplace.",
    "Maintenance of spending restrictions which protect legal, state-based medical cannabis programs; expansion of those protections to include legal, state-based adult use programs.",
    "HR 1595/S. 1200 SAFE Banking Act \n\nWe support the Secure and Fair Enforcement (SAFE) Banking Act, which\nwould ensure that lawful and regulated cannabis businesses have access to banking\nand capital markets, while ensuring that safe and sound financial standards and\nprocedures remain in place for the financial institutions interested in offering services to\nthis marketplace. We urge Congress to provide states with the means to bank, track\nand tax this inevitable and significant economy.",
    "HR 1595/S. 1200: Safe Banking Act\n\nThis bill ensures that lawful and regulated cannabis businesses have access to banking and capital markets, while ensuring that safe and sound financial standards and procedures remain intact for the financial institutions interested in offering services to the cannabis marketplace.",
    "Maintenance of spending restrictions which protect legal, state-based medical cannabis programs; expansion of those protections to include legal, state-based adult use programs and increased access to medical cannabis for veterans.",
    "H.R. 1595/S. 1200 - the Secure and Fair Enforcement (SAFE) Banking Act \n\nThe cannabis industry represents the fastest growing sector of the U.S. economy and can play a critical role in generating more jobs for more Americans if it has access to the same banking services enjoyed by non-cannabis businesses. \n\nAmong other considerations, the lack of access to banking services for cannabis companies is leading to more violent crimes of opportunity, as well as to the transmission of contaminated cash during the COVID-19 crisis. As shelter-in-place orders went into effect, most cannabis businesses were deemed essential, but were not able to implement the same electronic, socially distanced payment methods as their non-cannabis peers because they do not have traditional financial services. Access to banking would also enable the government to bank, track and tax cannabis sales which would, in turn, provide law enforcement officials with tools to prevent money laundering.",
    "Legal cannabis has been the fastest growing industry in the U.S. for the past four years, employing 243,700 Americans, making the legal cannabis industry one of Americas greatest job creators. With access to financial services (through the SAFE Banking Act or H.R. 1595/S.1200) and capital markets, legal cannabis would add $20 billion in tax revenue, create 788,000 new jobs, and $81 billion in loan opportunity in U.S. Banks.",
    "Maintenance of spending restrictions which protect legal, state-based medical cannabis programs; expansion of those protections to include legal, state-based adult use programs; increased access to medical cannabis for veterans; and access to banking services for cannabis companies.",
    "The Marijuana Opportunity Reinvestment and Expungement (MORE) Act (H.R. 3884) would remove cannabis from the schedule of controlled substances. The bill also includes provisions to redress the disproportionate harm of the failed War on Drugs on communities of color. The National Cannabis Roundtable seeks to promote social justice, equity and diversity within the cannabis industry as part of commonsense federal regulation.",
    "The National Cannabis Roundtable supports the Secure and Fair Enforcement (SAFE) Banking Act (HR 1996). Cannabis businesses do not enjoy access to the same banking services enjoyed by every other legally operating business in the United States. The SAFE Banking Act would create a safe harbor for banks to service cannabis industry clients thus enabling cannabis businesses access to checking accounts, lines of credit and other standard business banking services.",
    "As the federal government considers how to reconcile state legal cannabis programs with cannabis' federal illegality, the National Cannabis Roundtable supports the creation of a regulatory paradigm that decriminalizes cannabis, remediates the harm of the failed War on Drugs, ensures the highest standards of patient and consumer safety, protects the integrity of state programs and provides equitable financial treatment for cannabis businesses.",
    "As the federal government considers how to reconcile state legal cannabis programs with cannabis' federal illegality, the National Cannabis Roundtable supports legislation and regulatory paradigms that decriminalize cannabis, remediate the harm of the failed War on Drugs, ensure the highest standards of consumer safety, respect existing cannabis supply chains and provide equitable financial treatment for cannabis businesses. HR 1996, HR 3884 and HR 3105 are the three primary pieces of legislation which NCR has supported to achieve these goals. NCR also submitted comments to the discussion draft of the Cannabis Administration and Opportunity Act (CAOA) introduced by Senators Schumer, Booker and Wyden during the third quarter. NCR supports the Senators' comprehensive approach to reform and looks forward to working with legislators on another version of the bill when it is formally introduced.",
    "NCR supports the expansion of protections for the cannabis industry through the appropriations process, namely the expansion of medical protections to include adult use, increased veterans access, as well as the inclusion of SAFE Banking language in an appropriations amendment.",
    "As the federal government considers how to reconcile state legal cannabis programs with cannabis' federal illegality, the National Cannabis Roundtable supports legislation and regulatory paradigms that decriminalize cannabis, remediate the harm of the failed War on Drugs, ensure the highest standards of consumer safety, respect existing cannabis supply chains and provide equitable financial treatment for cannabis businesses. HR 1996, HR 3884 and HR 3105 are the three primary pieces of legislation which NCR has supported to achieve these goals. \n\nNCR also submitted comments to the discussion draft of the Cannabis Administration and Opportunity Act (CAOA) introduced by Senators Schumer, Booker and Wyden during the previous quarter. NCR supports the Senators' comprehensive approach to reform and looks forward to working with legislators on another version of the bill when it is formally introduced. \n\nNCR also noted the introduction of HR 5977 by Congresswoman Mace and the Hope Act by Reps. Ocasio-Cortez and Joyce during the fourth quarter of 2021. NCR looks forward to working with these congressional offices to advance areas of critical reform.",
    "The National Cannabis Roundtable supports the Secure and Fair Enforcement (SAFE) Banking Act (HR 1996). Cannabis businesses do not enjoy access to the same banking services enjoyed by every other legally operating business in the United States. The SAFE Banking Act would create a safe harbor for banks to service cannabis industry clients thus enabling cannabis businesses access to checking accounts, lines of credit and other standard business banking services. NCR's support of SAFE Banking included its provision in the National Defense Authorization Act (NDAA) and America COMPETES bill.",
    "As the federal government considers how to reconcile state legal cannabis programs with cannabis' federal illegality, the National Cannabis Roundtable supports legislation and regulatory paradigms that decriminalize cannabis, remediate the harm of the failed War on Drugs, ensure the highest standards of consumer safety, respect existing cannabis supply chains and provide equitable financial treatment for cannabis businesses. HR 1996, HR 3884 and HR 3105 are the three primary pieces of legislation which NCR has supported to achieve these goals. To note, NCR submitted comments to the discussion draft of the Cannabis Administration and Opportunity Act (CAOA) introduced by Senators Schumer, Booker and Wyden last year. NCR supports the Senators' comprehensive approach to reform and looks forward to working with legislators on another version of the bill when it is formally introduced. Additionally, NCR noted the introduction of HR 5977 by Congresswoman Mace and the Hope Act by Reps. Ocasio-Cortez and Joyce during the fourth quarter of 2021 and looks forward to working with these congressional offices to advance areas of critical reform this year. Finally, NCR supports the Cannabidiol and Marihuana Research Expansion Act (S.253) and the Medical Marijuana Research Act (HR 5657).",
    "NCR supports the expansion of protections for the cannabis industry through the appropriations process, namely the expansion of medical protections to include adult use, increased veterans access, as well as the inclusion of SAFE Banking language in an appropriations amendment. NCR also supports the removal of the Harris Rider which prevents the District of Columbia from legalizing commercial cannabis sales.",
    "The National Cannabis Rountable supports the Secure and Fair Enforcement (SAFE) Banking Act (HR 1996). Cannabis businesses do not enjoy access to the same banking services enjoyed by every other legally operating business in the United States. The SAFE Banking Act would create a safe harbor for banks to service cannabis industry clients thus enabling cannabis businesses access to checking accounts, lines of credit and other standard business banking services. NCR's support of SAFE Banking included its provision in the National Defense Authorization Act (NDAA) and America COMPETES bill. NCR also was active on the CLIMB Act (H.R. 8200), a bill that provides safe harbors for financial institutions, government programs, and capital markets.",
    "As the federal government considers how to reconcile state legal cannabis programs with cannabis' federal illegality, the National Cannabis Roundtable supports legislation and regulatory paradigms that decriminalize cannabis, remediate the harm of the failed War on Drugs, ensure the highest standards of consumer safety, respect existing cannabis supply chains and provide equitable financial treatment for cannabis businesses. HR 1996, HR 3884 and HR 3105 are the three primary pieces of legislation which NCR has supported to achieve these goals. To note, NCR submitted comments to the discussion draft of the Cannabis Administration and Opportunity Act (CAOA) introduced by Senators Schumer, Booker and Wyden last year. NCR supports the Senators' comprehensive approach to reform and looks forward to working with legislators on another version of the bill when it is formally introduced. Additionally, NCR noted the introduction of HR 5977 by Congresswoman Mace and the Hope Act by Reps. Ocasio-Cortez and Joyce during the fourth quarter of 2021 and looks forward to working with these congressional offices to advance areas of critical reform this year. NCR also supported the PREPARE Act (H.R. 7513) Finally, NCR supports the Cannabidiol and Marihuana Research Expansion Act (S.253) and the Medical Marijuana Research Act (HR 5657)."
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024
  ],
  "growthRate": -20,
  "trajectory": "stable",
  "yearsActive": 6,
  "avgAnnualSpending": 286083,
  "peakYear": 2020,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 6
}