{"id":191146,"name":"NATIONAL COUNCIL ON TEACHER RETIREMENT 9370 STUDIO COURT ELK GROVE CA 95758","slug":"national-council-on-teacher-retirement-9370-studio-court-elk-grove-ca-95758","state":"CA","description":"non-profit tax exempt 501(c)(6) association representing teacher public retirement systems","totalSpending":1425000,"filings":27,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":330000},{"year":2022,"income":220000},{"year":2024,"income":220000},{"year":2025,"income":55000}],"firms":["MR. PETER SNELL"],"lobbyists":["PETER SNELL"],"issues":["BNK","GOV","EDU","BAN","FIN","TAX","RET"],"sampleDescriptions":["governmental bankruptcy","implementation of pension provisions in H.R. 5278, the Puerto Rico Oversight, Management and Economic Stability Act of 2016 (PL 114-187)","general issues pertaining to teacher retirement","Ongoing implementation of Dodd-Frank; H.R. 10, the Financial Choice Act.","Implementation of Dodd-Frank; access to the proxy; corporate governance issues; executive compensation; public pension plan accounting and disclosure; investor (trustee) education; SEC state settlements re: bond disclosures; state of municipal securities markets; municipal adviser registration; H.R. 10, the Financial Choice Act;  H.R. 4015, The Corporate Governance Reform and Transparency Act of 2017, relating to proxy advisory services; Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investmnt earnings of state and local governments retirement systems.","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; tax deferral of pension contributions and earnings (tax reform legislation); Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Secure Annuities for Employee (SAFE) Retirement Act; Office of State and Local Finance public pension plan interests; infrastructure financing; ACA excise tax; Public Employee Pension Transparency Act (PEPTA).","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; governmental plan accounting and disclosure; disclosure of state death records; \ntax deferrals related to pension contributions and earnings (tax reform legislation); Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Secure Annuities for Employee (SAFE) Retirement Act; Office of State and Local Finance public pension plan interests; the Public Employee Pension Transparency Act (PEPTA).","general issues pertaining to teacher retirement; Federal grants covering teacher benefits","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; tax deferral of pension contributions and earnings (tax reform legislation); Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Secure Annuities for Employee (SAFE) Retirement Act; Office of State and Local Finance public pension plan interests; infrastructure financing; ACA excise tax; Public Employee Pension Transparency Act (PEPTA); Joint Select  Committee on Solvency of Multiemployer Plans deliberations","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; governmental plan accounting and disclosure; disclosure of state death records; \ntax deferrals related to pension contributions and earnings (tax reform legislation); Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Secure Annuities for Employee (SAFE) Retirement Act; Office of State and Local Finance public pension plan interests; the Public Employee Pension Transparency Act (PEPTA); Joint Select  Committee on Solvency of Multiemployer Plans deliberations","implementation of pension provisions in H.R. 5278, the Puerto Rico Oversight, Management and Economic Stability Act of 2016 (PL 114-187); infrastructure financing","Ongoing implementation of Dodd-Frank; H.R. 10, the Financial Choice Act; infrastructure financing.","Implementation of Dodd-Frank; access to the proxy; corporate governance issues; executive compensation; public pension plan accounting and disclosure; investor (trustee) education; SEC state settlements re: bond disclosures; state of municipal securities markets; municipal adviser registration; H.R. 10, the Financial Choice Act;  H.R. 4015, The Corporate Governance Reform and Transparency Act of 2017, relating to proxy advisory services; Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local governments retirement systems; infrastructure financing.","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; tax deferral of pension contributions and earnings (tax reform legislation); Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Secure Annuities for Employee (SAFE) Retirement Act; Office of State and Local Finance public pension plan interests; infrastructure financing; ACA excise tax; Public Employee Pension Transparency Act (PEPTA); Joint Select  Committee on Solvency of Multiemployer Plans deliberations; infrastructure financing; H.R 6757, Family Savings Act","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; governmental plan accounting and disclosure; disclosure of state death records; \ntax deferrals related to pension contributions and earnings (tax reform legislation); Section 5001 of H.R. 1, tax reform legislation as passed by the House of Representatives, applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Secure Annuities for Employee (SAFE) Retirement Act; Office of State and Local Finance public pension plan interests; the Public Employee Pension Transparency Act (PEPTA); Joint Select  Committee on Solvency of Multiemployer Plans deliberations; H.R 6757, Family Savings Act","ongoing implementation of Dodd-Frank; access to the proxy; corporate governance issues; executive compensation; public pension plan accounting and disclosure; investor (trustee) education; SEC state settlements re: bond disclosures; state of municipal securities markets; municipal adviser registration; proxy advisory services; applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local governments retirement systems; infrastructure financing.","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; tax deferral of pension contributions and earnings; application of the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Office of State and Local Finance public pension plan interests; infrastructure financing; Public Employee Pension Transparency Act (PEPTA); solvency of Multiemployer Plans deliberations; infrastructure financing; SECURE Act (H.R. 1994) and changes in the IRC to enhance retirement security","IRS Governmental plans compliance; IRS Normal Retirement Age regulations; IRS revenue ruling 2006-43; IRS ANPRM on definition of a governmental plan; funding of governmental plans; general pension plan reform; governmental plan accounting and disclosure; disclosure of state death records;\ntax deferrals related to pension contributions and earnings;applying the Unrelated Business Income Tax (UBIT) to the investment earnings of state and local government retirement systems; Office of State and Local Finance public pension plan interests; the Public Employee Pension Transparency Act (PEPTA); solvency of Multiemployer Plans deliberations; reform of the windfall elimination provision (WEP); SECURE Act (H.R. 1994) dealing with overall retirement security","implementation of pension provisions of the Puerto Rico Oversight, Management and Economic Stability Act of 2016; infrastructure financing; general Federal regulation and taxation of state and local governmental retirement systems","Ongoing implementation of Dodd-Frank; infrastructure financing; proxy adviser regulations."],"years":[2018,2019,2020,2021,2022,2024,2025]}