{"id":159913,"name":"NATIONAL CREDIT ALLIANCE","slug":"national-credit-alliance","state":"OH","description":"Consumer credit and payments","totalSpending":1160000,"filings":10,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":480000},{"year":2020,"income":440000}],"firms":["TIMOTHY R. RUPLI & ASSOCIATES, INC."],"lobbyists":["TIMOTHY RUPLI","LINDA RUPLI"],"issues":["FIN"],"sampleDescriptions":["Issues relating to Dodd-Frank Wall Street Reform and Consumer Protection Act implementation, the Consumer Financial Protection Bureau, community financial services providers, increasing access to affordable payment and small dollar short term credit options for working families. Regulatory relief, Operation Choke Point, Financial Services and General Government Appropriations bills.","Issues relating to Dodd-Frank Wall Street Reform and Consumer Protection Act implementation, the Consumer Financial Protection Bureau, community financial services providers, increasing access to affordable payment and credit options for working families.  Regulatory relief including Operation Choke Point.  Financial Services and General Government Appropriations bills.","Issues relating to Dodd-Frank Wall Street Reform and Consumer Protection Act implementation, the Consumer Financial Protection Bureau, community financial services providers, increasing access to affordable payment and credit options for working families. Regulatory relief including Operation Choke Point.  Financial Services and General Government Appropriations bills.","Issues relating to Dodd-Frank Wall Street Reform and Consumer Protection Act implementation, the Consumer Financial Protection Bureau, community financial services providers, increasing access to affordable payment and credit options for working families. Regulatory relief including Operation Choke Point.  Financial Services and General Government Appropriations bills. Financial services provisions of CARES Act.","Issues relating to Dodd-Frank Wall Street Reform and Consumer Protection Act implementation, the Consumer Financial Protection Bureau, community financial services providers, increasing access to affordable payment and credit options for working families. Regulatory relief including Operation Choke Point.  Financial Services and General Government Appropriations bills. Financial services provisions of CARES Act.  National Defense Authorization Act."],"years":[2018,2019,2020]}