{"id":202096,"name":"NATIONAL ASSOCIATION OF COMMUNITY HEALTH CENTERS","slug":"national-association-of-community-health-centers","state":"VA","description":"Providing care to local community residents in rural and urban locations.","totalSpending":1200000,"filings":24,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":100000},{"year":2020,"income":200000},{"year":2021,"income":100000},{"year":2022,"income":200000},{"year":2024,"income":250000},{"year":2025,"income":150000}],"firms":["SPLITOAK STRATEGIES LLC"],"lobbyists":["AMY JENSEN","SARAH EGGE","KRISTEN SHATYNSKI","ARIELLE WORONOFF"],"issues":["HCR","MMM"],"sampleDescriptions":["Extend funding for Community Health Centers, HR 3770","Extend funding for Community Health Centers- HR 3770, HR 6-funding for Community Health Centers opioid use prevention and treatment services, Implementation of state value-based payment models","HR 2328 and S 192 and HR 1983, S 1895 To reauthorize and extend funding for Community Health Centers and the National Health Service Corps.","To ensure alternate payment methods are available in Medicaid reimbursement policy.","To ensure alternate payment methods are available in Medicaid reimbursement policy. Reimbursement for Telehealth services","HR 2328 and S 192 and HR 1983, S 1895 To reauthorize and extend funding for Community Health Centers and the National Health Service Corps. HR 748 CARES Act, HR 6074 Coronavirus Preparedness and Response Act, HR 6201 Families First Coronavirus Response Act. Reimbursement for telehealth services.","To ensure alternate payment methods are available in Medicaid reimbursement policy. Reimbursement for telehealth services. Federally Qualified Health Center prospective payment system (PPS).","HR 2328 and S 192 and HR 1983, S 1895 To reauthorize and extend funding for Community Health Centers and the National Health Service Corps. COVID 19 funding to provide testing and build capacity for treatment, access to provider protective equipment, access to provider relief fund resources in CARES Act, Coronavirus Preparedness and Response Act, Families First Coronavirus Response Act, HR 6800 the HEROES Act. Reimbursement for telehealth services.","HR 2328 and S 192 and HR 1983, S 1895 To reauthorize and extend funding for Community Health Centers, Teaching Health Centers and the National Health Service Corps. COVID 19 funding to provide testing and build capacity for treatment, access to provider protective equipment, CARES Act implementation, Coronavirus Preparedness and Response Act, Families First Coronavirus Response Act, HR 6800 the HEROES Act. HEALS Act, Reimbursement for telehealth services. Administrative action to provide access to affordable health care treatments and services.","HR 2328 and S 192 and HR 1983, S 1895 To reauthorize and extend funding for Community Health Centers, Teaching Health Centers and the National Health Service Corps. COVID 19 funding to provide testing and build capacity for treatment, access to provider protective equipment, CARES Act implementation, Coronavirus Preparedness and Response Act, Families First Coronavirus Response Act, HR 6800 the HEROES Act. HEALS Act, Reimbursement for telehealth services. Administrative action to provide access to affordable health care treatments and services, HR 133 the Consolidated Appropriations Act","To ensure alternate payment methods are available in Medicaid reimbursement policy. Maintaining strong role for Community Health Centers in Medicaid including appropriate reimbursement. Reimbursement for telehealth services. Federally Qualified Health Center prospective payment system (PPS).","The Lift America Act, HR 1848; Extend and expand access to Community Health Center services via telehealth in Medicare and Medicaid; Vaccine administration and reimbursement in Medicare and Medicaid","The Lift America Act, HR 1848; vaccine administration and reimbursement, expanding and continuing telehealth for health center services; The DOC Act, HR 3671 and S 1958; infrastructure investment.","Extend and expand access to Community Health Center services via telehealth in Medicare and Medicaid, including The CONNECT for Health Act (H.R. 2903/S. 1512), Protecting Access to Post-COVID-19 Telehealth Act (H.R. 366) and the HEALTH Act (H.R. 4437)","The Lift America Act, HR 1848; vaccine administration and reimbursement; expanding and continuing telehealth for health center services, including The CONNECT for Health Act (H.R. 2903/S. 1512), Protecting Access to Post-COVID-19 Telehealth Act (H.R. 366) and the HEALTH Act (H.R. 4437); The DOC Act, HR 3671 and S 1958; H.R. 5376, Build Back Better Act - workforce, infrastructure investments, and expansion of dental and hearing benefits in Medicare","Expanding and continuing telehealth for health center services post-pandemic (PHE), including The CONNECT for Health Act (H.R. 2903/S. 1512), Protecting Access to Post-COVID-19 Telehealth Act (H.R. 366), the HEALTH Act (H.R. 4437) and H.R.2471 - Consolidated Appropriations Act, 2022; H.R. 5376, Build Back Better Act - workforce, infrastructure investments, and expansion of dental and hearing benefits in Medicare; Healthy Future Task Force; expanding patient access to behavioral health services, including capacity to provide services and integration of behavioral health and primary care services, and H.R. 7232, 9-8-8 and Parity Assistance Act of 2022","Extend and expand access to Community Health Center services via telehealth in Medicare and Medicaid, including The CONNECT for Health Act (H.R. 2903/S. 1512), Protecting Access to Post-COVID-19 Telehealth Act (H.R. 366), the HEALTH Act (H.R. 4437), and H.R.2471 - Consolidated Appropriations Act, 2022; Expand access to behavioral health care services for patients in underserved communities enrolled in federal programs, including improving integration of behavioral health and primary care","H.R. 5376, Build Back Better Act - workforce, infrastructure investments; Healthy Future Task Force; expanding patient access to behavioral health services, including capacity to provide services and integration of behavioral health and primary care services; Extending funding for Community Health Centers; HR 5141/S 958 the Mobile Health Care Act","Expand access to behavioral health care services for patients in underserved communities enrolled in federal programs, including improving integration of behavioral health and primary care; extending funding for Community Health Centers and preserving payment methodologies","HR 7666, Restoring Hope for Mental Health and Well Being Act of 2022; Expanding patient access to behavioral health services, including capacity to provide services and integration of behavioral health and primary care services; Extending funding for Community Health Centers; HR 5141/S 958 the Mobile Health Care Act"],"years":[2018,2019,2020,2021,2022,2024,2025]}