{
  "id": 202471,
  "name": "NATIONAL CHILDREN'S ALLIANCE",
  "slug": "national-children-s-alliance",
  "state": "DC",
  "description": "National association and accrediting body for Childrens Advocacy Centers (CACs).",
  "totalSpending": 1468000,
  "filings": 32,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 80000
    },
    {
      "year": 2019,
      "income": 120000
    },
    {
      "year": 2020,
      "income": 210000
    },
    {
      "year": 2021,
      "income": 90000
    },
    {
      "year": 2022,
      "income": 120000
    },
    {
      "year": 2023,
      "income": 248000
    },
    {
      "year": 2024,
      "income": 430000
    },
    {
      "year": 2025,
      "income": 170000
    }
  ],
  "firms": [
    "HB STRATEGIES"
  ],
  "lobbyists": [
    "GREGG HARTLEY",
    "WILLIAM FOX",
    "CHRISTIAN MORGAN",
    "KYLE GILSTER",
    "SINGLETON MCALLISTER",
    "JOHN ARIALE",
    "STACY MCBRIDE",
    "JOSEF NOVOTNY"
  ],
  "issues": [
    "BUD",
    "LAW",
    "FAM",
    null
  ],
  "sampleDescriptions": [
    "Victims of Child Abuse Act Reauthorization Act of 2018 HR 5955 and S. 2961\nAppropriations for FY 19 Commerce, Justice, Science, and Related Agencies",
    "National association and accrediting body for Children's Advocacy Centers (CACs).",
    "Victims of Child Abuse Act Reauthorization Act of 2018 HR 5955 and S. 2961 Appropriations for FY 19 Commerce, Justice, Science, and Related Agencies",
    "Victims of Child Abuse Act Reauthorization Act; Appropriations for FY 20 Commerce, Justice, Science, and Related Agencies",
    "Victims of Crime Act, Victims of Child Abuse Act; Appropriations for FY 22 Commerce, Justice, Science, and Related Agencies",
    "Victims of Crime Act, Victims of Child Abuse Act; Appropriations for FY 23 Commerce, Justice, Science and Related Agencies.",
    "Victims of Crime Act, Victims of Child Abuse Act; Appropriations for FY 24 Commerce, Justice, Science and Related Agencies.",
    "Victims of Crime Act, Victims of Child Abuse Act; Appropriations for FY25 Commerce, Justice, Science and Related Agencies."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 113,
  "trajectory": "exploding",
  "yearsActive": 8,
  "avgAnnualSpending": 183500,
  "peakYear": 2024,
  "lobbyistCount": 8,
  "firmCount": 1,
  "issueCount": 3
}