{"id":145616,"name":"NATIONAL ASSOCIATION OF CONVENIENCE STORES","slug":"national-association-of-convenience-stores","state":null,"description":null,"totalSpending":2030000,"filings":13,"yearlySpending":[{"year":2018,"income":640000},{"year":2019,"income":480000},{"year":2020,"income":640000},{"year":2021,"income":270000}],"firms":["STEPTOE LLP"],"lobbyists":["R COLUMBUS","DOUGLAS KANTOR","LESLIE BELCHER","ELIZABETH BURKS","DARRYL NIRENBERG","JASON ABEL","EVA RIGAMONTI","KATE JENSEN","LISA WALTZMAN","JAMES BARNETTE","JESSICA FREND","CHRISTOPHER CARON","THOMAS BLILEY","MICHAELA CAMPBELL","ASHLEY STEWART","LEEANN GOHEEN","ALLISON NYHOLM"],"issues":["GAM","TEC","FOO","ENV","BAN","TAX","ROD","ENG","TOB"],"sampleDescriptions":["Issues related to online gaming.","Issues related to data security.","Issues relating to Food Safety and Menu Labeling. Issues relating to the reauthorization of the supplemental nutrition assistance program.","Issues relating to interior appropriations legislation, climate change, renewable fuels. Issues of interest to motor fuels marketers including renewable fuels and underground storage tanks.","Issues related to banking and financial services reform legislation","Issues relating to federal taxation of motor fuels, including tax credits, and convenience store properties.","Reauthorization of highway trust fund, including commercialization of interstate rest areas.","Issues relating to motor fuels marketing.","Issues relating to sales of tobacco products.","Issues related to sales of tobacco products.","Issues related to motor fuels marketing.","Issues related to interior appropriations legislation, climate change, renewable fuels. Issues of interest to motor fuels marketers including renewable fuels and underground storage tanks.","Issues related to banking and financial services reform legislation.","Issues related to federal taxation of motor fuels, including tax credits, and convenience store properties.","Issues related to Food Safety and Menu Labeling. Issues relating to the reauthorization of the supplemental nutrition assistance program.","Issues related to sales of tobacco products and e-cigarettes.","Issues related to data security and privacy.","Issues related to motor fuels marketing.  Issues related to electronic vehicles","Issues related to motor fuels marketing. Issues related to electronic vehicles (HR 1512, HR 1221)"],"years":[2018,2019,2020,2021]}