{"id":51602,"name":"NATIONAL ASSOCIATION OF BROADCASTERS","slug":"national-association-of-broadcasters","state":"DC","description":"Nonprofit trade association for radio and television broadcasters.","totalSpending":3430000,"filings":9,"yearlySpending":[{"year":2022,"income":1530000},{"year":2024,"income":1900000}],"firms":["GORDON SMITH"],"lobbyists":["GORDON SMITH"],"issues":["COM","CPT"],"sampleDescriptions":["Issues relating to the ATSC 3.0 next-generation television standard; H.R. 1735, Journalism Competition and Preservation Act of 2021, All provisions; S. 673, Journalism Competition and Preservation Act of 2021, All provisions; H.Con.Res 33, Local Radio Freedom Act, All provisions. H.R. 4130, American Music Fairness Act, All provisions; S.Con.Res 9, Local Radio Freedom Act, All provisions; Issues relating to paying a performance royalty on over-the-air radio broadcasts; Issues relating to the licensing of music for over-the-air broadcasts.","Issues relating to the ATSC 3.0 next-generation television standard H.R. 1735, Journalism Competition and Preservation Act of 2021, All provisions S. 673, Journalism Competition and Preservation Act of 2021, All provisions","Issues relating to paying a performance royalty on over-the-air radio broadcasts Issues relating to the licensing of music for over-the-air broadcasts H.Con.Res 33, Local Radio Freedom Act, All provisions H.R. 4130, American Music Fairness Act, All provisions S.Con.Res 9, Local Radio Freedom Act, All provisions","Issues relating to the ATSC 3.0 next-generation television standard H.R. 1735, Journalism Competition and Preservation Act of 2021, All provisions S. 673, Journalism Competition and Preservation Act of 2021, All provisions S. 2434, Local Journalism Sustainability Act, All provisions S. 2457, Protect Reporters from Exploitative State Spying Act, All provisions","Issues relating to paying a performance royalty on over-the-air radio broadcasts Issues relating to the licensing of music for over-the-air broadcasts H.Con.Res 33, Local Radio Freedom Act, All provisions H.R. 4130, American Music Fairness Act, All provisions S.Con.Res 9, Local Radio Freedom Act, All provisions S.4932 American Music Fairness Act, All provisions","Issues relating to the ATSC 3.0 next-generation television standard H.R. 2617, Consolidated Appropriations Act, 2023, Provisions relating to FCC Appropriations, the Journalism Competition and Preservation Act and the Local Journalism Sustainability Act. S. 673, Journalism Competition and Preservation Act of 2021, All provisions S. 2434, Local Journalism Sustainability Act, All provisions S. 2457, Protect Reporters from Exploitative State Spying Act, All provisions","Issues relating to the ATSC 3.0 next-generation television standard Issues relating to carriage of television broadcast signals Issues relating to tax credits to support investment and hiring in local newsrooms H.R. 1735, Journalism Competition and Preservation Act of 2021, All provisions H.R. 3413, AM Radio for Every Vehicle Act of 2023 S. 673, Journalism Competition and Preservation Act of 2021, All provisions S. 1669, AM Radio for Every Vehicle Act of 2023","Issues relating to the ATSC 3.0 next-generation television standard Issues relating to carriage of television broadcast signals Issues relating to tax credits to support investment and hiring in local newsrooms H.R. 3413, AM Radio for Every Vehicle Act of 2023 S. 1094, Journalism Competition and Preservation Act of 2023, All provisions S. 1669, AM Radio for Every Vehicle Act of 2023","Issues relating to paying a performance royalty on over-the-air radio broadcasts Issues relating to the licensing of music for over-the-air broadcasts H.Con.Res 13, Local Radio Freedom Act, All provisions H.R.791, American Music Fairness Act, All provisions S.Con.Res 5, Local Radio Freedom Act, All provisions S.253 American Music Fairness Act, All provisions","Issues relating to paying a performance royalty on over-the-air radio broadcasts Issues relating to the licensing of music for over-the-air broadcasts H.Con.Res 13, Local Radio Freedom Act, All provisions H.R. 791, American Music Fairness Act, All provisions S.Con.Res 5, Local Radio Freedom Act, All provisions S.253 American Music Fairness Act, All provisions","Issues relating to the ATSC 3.0 next-generation television standard Issues relating to carriage of television broadcast signals Issues relating to tax credits to support investment and hiring in local newsrooms H.R. 3413, AM Radio for Every Vehicle Act of 2023, All provisions H.R. 8449, AM Radio for Every Vehicle Act of 2024, All provisions S. 1094, Journalism Competition and Preservation Act of 2023, All provisions S. 1669, AM Radio for Every Vehicle Act of 2023, All provisions"],"years":[2022,2024]}