{"id":200469,"name":"NCTA - THE INTERNET AND TELEVISION ASSOCIATION","slug":"ncta-the-internet-and-television-association","state":"DC","description":"Trade association for the cable industry","totalSpending":1420000,"filings":29,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":150000},{"year":2020,"income":150000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2023,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":200000}],"firms":["RIVENDELL GROUP LLP"],"lobbyists":["NICK KOLOVOS","MATTHEW BERZOK"],"issues":["COM","TEC",null],"sampleDescriptions":["FCC oversight; Broadband deployment and rural broadband issues; Issues relating to Spectrum management and unlicensed spectrum;  the FCC Open Internet Proceeding, Title II and Network Neutrality.","FCC oversight; Broadband deployment and rural broadband issues; Issues relating to Spectrum management and unlicensed spectrum;  the FCC Open Internet Proceeding, Title II and Network Neutrality; infrastructure funding.","Issues relating to online privacy legislation, net neutrality and the FCCs' open internet order, broadband deployment, truth in billing and transparency legislation, and spectrum.","Issues relating to online privacy legislation, net neutrality and the FCC's open internet order, broadband deployment, truth in billing and transparency legislation, and spectrum.","Issues relating to online privacy legislation, net neutrality, broadband infrastructure and deployment, and spectrum.  Broadband provisions in COVID-related response legislation; H.R. 2 Invest in America Act; the HEROES Act.","Issues relating to online privacy legislation, net neutrality; broadband infrastructure and deployment; spectrum; broadband provisions in COVID-related response legislation; H.R. 2 Invest in America Act; the HEROES Act,","Issues relating to online privacy legislation, net neutrality; broadband infrastructure and deployment; spectrum; broadband provisions in COVID-related response legislation; H.R. 2 Invest in America Act; the HEROES Act; the CARES Act.","Issues relating to online privacy legislation, net neutrality, broadband infrastructure and deployment, and spectrum.  Broadband provisions in COVID-related response legislation; the HEROES Act.\n\n-HR 7160 - Expanding Opportunities for Broadband Deployment Act - all provisions related to cable.\n-HR 7205 - Nationwide Dig Once Act of 2020 - all provisions related to cable.\n-HR 7355 - Federal Broadband Deployment Tracking Act- all provisions related to cable.\n-HR 7494 - Broadband Adoption and Opportunity Act - all provisions related to cable.\n-HR 7520 - National Broadband Plan for the Future Act of 2020 - all provisions related to cable.\n-HR 7695 - COVID-19 Emergency Telehealth Impact Reporting Act of 2020- all provisions related to cable.\n-HR 8427 - To provide for certain reports on enrollment in the Lifeline program","Issues relating to online privacy legislation, net neutrality, broadband infrastructure and deployment, and spectrum.  Broadband provisions in COVID-related response legislation; the HEROES Act.\n\n-HR 7160 - Expanding Opportunities for Broadband Deployment Act - all provisions related to cable.\n-HR 7205 - Nationwide Dig Once Act of 2020 - all provisions related to cable.\n-HR 7355 - Federal Broadband Deployment Tracking Act- all provisions related to cable.\n-HR 7494 - Broadband Adoption and Opportunity Act - all provisions related to cable.\n-HR 7520 - National Broadband Plan for the Future Act of 2020 - all provisions related to cable.\n-HR 7695 - COVID-19 Emergency Telehealth Impact Reporting Act of 2020- all provisions related to cable.\n-","Issues relating to online privacy legislation, net neutrality; broadband infrastructure and deployment; spectrum; broadband provisions in COVID-related response legislation; the HEROES Act; the CARES Act.","Issues relating to online privacy and data security, net neutrality, broadband infrastructure and deployment, and spectrum.","Issues relating to online privacy legislation, net neutralty, broadband infrastructure and deployment, spectrum.","Issues relating to online privacy and data security, broadband infrastructure and deployment, and spectrum.","Issues relating to online privacy legislation, broadband infrastructure and deployment, spectrum.","Issues relating to online privacy legislation, broadband infrastructure and deployment, spectrum.  Broadband issues arising within reconciliation legislation.","Issues relating to online privacy legislation, broadband infrastructure and deployment, spectrum. Broadband issues arising within reconciliation legislation.","Issues relating to broadband deployment, infrastructure funding, rural broadband, and broadband mapping. Issues relating to spectrum auctions, unlicensed spectrum. Issues relating to online privacy and data security legislation. CALM Act","Issues relating to broadband deployment, infrastructure funding, rural broadband, broadband mapping, and the Affordable Connectivity Program. Issues relating to spectrum auctions, unlicensed spectrum. Issues relating to online privacy and data security legislation. Net neutrality","Issues relating to and impacting the cable industry generally, including broadband deployment, the Affordable Connectivity Program, internet regulation, privacy and data security.","Issues relating to and impacting the cable industry generally, including broadband deployment, the Affordable Connectivity Program, internet regulation, privacy and data security, including children and teens online privacy."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}