{"id":199351,"name":"NEW YORK LIFE","slug":"new-york-life","state":"NY","description":"New York Life Insurance Co. provides retirement, investment and life insurance services.","totalSpending":1710000,"filings":30,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":100000},{"year":2020,"income":100000},{"year":2021,"income":200000},{"year":2022,"income":240000},{"year":2023,"income":300000},{"year":2024,"income":300000},{"year":2025,"income":270000}],"firms":["HARBINGER STRATEGIES, LLC"],"lobbyists":["KYLE NEVINS","JOHN O'NEILL","MANNY ROSSMAN","STEVE STOMBRES","JONATHAN SLEMROD","PARKER POLING","JOHN LEGANSKI"],"issues":["RET","INS","BAN","CPI","TRA",null,"TAX","FIN"],"sampleDescriptions":["Lifetime Income Disclosure Act (LIDA)","International insurance standards related to banking regulatory reform","International insurance standards related to banking regulatory reform.","Lifetime Income Disclosure Act (LIDA).","HR 6743, The Consumer Information Notification Requirement Act.","Lifetime Income Disclosure Act (LIDA); S. 2526, HR 5282, The Retirement Enhancement and Savings Act, provisions related to annuities and retirement plans.","Privacy and data security legislation.","Lifetime Income Disclosure Act (LIDA); The Retirement Enhancement and Savings Act (RESA); H.R. 1007; H.R. 1994; and S. 972; Setting Every Community Up for Retirement Enhancement (SECURE) Act.","International insurance standards related to banking regulatory reform; Issues related to Department of Labor fiduciary regulation and prohibited transaction exemptions.","Issues related to Department of Labor fiduciary regulation and prohibited transaction exemptions.","Infrastructure policies related to bonding.","Issues related to section 7702 of the Internal Revenue Code.","Issues related to infrastructure.","Issues related to infrastructure and direct payment bonds, including S. 1308, the American Infrastructure Bonds Act.","SECURE Act 2.0.","Congressional response to the Department of Labors (DOL) fiduciary rule.","Issues related to taxation of life insurance industry and products.","Issues affecting the life insurance industry."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}