{
  "id": 206727,
  "name": "NEW CALIFORNIA REPUBLIC CO.",
  "slug": "new-california-republic-co",
  "state": "CA",
  "description": "Proprietorship of the Western Interconnection",
  "totalSpending": 5507688,
  "filings": 2,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 5507688
    }
  ],
  "firms": [
    "WILSON & ROME LLP"
  ],
  "lobbyists": [
    "JOSHUA WILSON",
    "ISABELLA ROME",
    "ANDREW DU PONT"
  ],
  "issues": [
    "LAW",
    "FIN",
    "GOV",
    "CPI",
    "INT",
    "CON",
    "TEC",
    "CHM",
    "ENG",
    "CAW",
    "ENV"
  ],
  "sampleDescriptions": [
    "Business Law, Statutory Law, Securities Law",
    "(I) the Federal Energy Regulatory Commission, jurisdiction of Western\nInterconnection;\n(II) Lithium Hydroxide + Xenon Ion Engines and subsequent children patents for\n\"Method & Means of Converting Atomic Energy Into Utilizable Kinetic\nEnergy,\" US Patent # 3,670,494 (Noble Gas Engine US Patents);\n(III) Propane and Bi-fuel Propane Engines, as a vector of engineering for noble gas\nengines (neon, krypton, and xenon) and a carbon-negative agent, such as Lithium\nHydroxide;\n(IV) Use of Magnesium, Bromine, and Lithium as an oxidizer source carbon\nnegative agent, in specific reference to Noble Gas Engines, with noble gases as the\nfuel source;",
    "116TH CONGRESS\n2D SESSION\n\nS. J. RES. 69\n\nProviding for the reappointment of a Political Action Committee to the Federal Energy Regulatory\nCommission jurisdiction of the Western Interconnection.\n\nIN THE SENATE OF THE UNITED STATES\n\nSEPTEMBER 18, 2020\n\nNew California Republic Co. (by and through, Wilson & Rome, L.L.P., and Ms. ROME) introduced the\nfollowing joint resolution; which has been introduced to the Colorado Senate and U.S. Congress.\n\nJOINT RESOLUTION\n\nTo amend Article VII of the U.S. Constitution to incorporate constitutional right to statutory\nlaw and to specify the distinction in U.S. Code, Title 18 Crimes for civil litigation by legal\nphrase intent to defraud, to fidelity of duty, in regards to damage reconciliation, and\n(malum in se, vs malum prohibitum). To formally entitle the use of the legislative district\nchamber, the application of pre and post-conviction amnesty by statute through use of business\nlaw and civil liability reconciliation through the legislative branch either formally or informally.\n NOTE: Sept. 10, 2020 - [S.J. RES 65]\nBe it enacted by the Senate and House of Representatives of the United States of America in\nCongress assembled, the New California Republic Co. declare the Proprietorship (The Republic\nof California,) of the Western Interconnection through reappointment of the Federal Energy\nRegulatory Commission jurisdiction, as a Political Action Committee (the PAC).  NOTE:\nSept. 10, 2020 - The Republic of California. Section 2(b) - [S.J. RES. 69]\nSECTION 1. SHORT TITLE.\n\n- 2 -\n\nThis Joint Resolution may be cited as the THE REPUBLIC OF CALIFORNIA,\nproprietorship rights and Political Action Committee of the New California Republic Co. and the\nFederal Energy Regulatory Commission (FERC), Western Interconnection. [S.J. RES. 69].\nSEC. 2. THE REPUBLIC OF CALIFORNIA.\n(a) In General.--Amendment (VII) of the U.S. Constitution and U.S. Code, Title 18 (18 U.S.C.\n[ 470 -  514]) is amended--\n(1) in Title 18 (18 USC [ 470 -  514]), by striking ``intent to defraud'' and\ninserting ``fidelity of duty''; based on damage reconciliation,;\n(2) in 18 U.S. Code ( 470 -  514), by striking ``(class B felony)'' and inserting\n``malum in se, class A misdemeanor or malum prohibitum, civil infraction''; and\n(3) in 18 U.S. Code ( 470 -  514), by striking ``(fined or imprisoned)'' and inserting\n``fined on malum prohibitum, or imprisoned on malum in se, ''; and\n(4) by amending Amendment (VII) of the U.S. Constitution, or inserting the following\nnew Amendment (VII) - [Economic Arbitration]:\n``(Amendment VIII - [Economic Arbitration]) In litigation of non-violent financial crime,\nwhere the conditions are met for malum prohibitum, the right of amnesty by statute shall be\npreserved, and no bill introduced by an arbitrator, shall be otherwise reexamined in any court of\nthe United States, than according to the rules of the economic arbitration and statutory law in the\nexecutive and legislative branch.\n(b) LIMIT ON JURISDICTION FOR PROPRIETORSHIP.--\n(1) IN GENERAL.-- If suit at common law is invoked on a proprietorship that is not\ndescribed in subsection (2)(B)(ii), the equity of post-suit reconciliation shall be equally\ndivided between the lobbyist firm and the subsequent limited partnership, or the plaintiff.\n(2) PROPRIETORSHIPS COVERED.--A proprietorship described in this paragraph is\nthe state or right of owning a business or holding property--\n(A) as a lobbyist of the Republic of California, or of the United States Congress; or\n(B) in the executive branch that is--\n(i) not a position at level I of the Executive Schedule under section 5312 of\nTitle 5, United States Code; or that is\n(ii) a proprietorship of--\n(I) the Federal Energy Regulatory Commission, jurisdiction of Western\nInterconnection;\n\n(d)  NOTE: U.S. Code, Title 18 amendment Effective Date.--\n(1) In general.--Subject to Amendment (VII), the entitlements granted by amendment\n(VII) were originally intended to allow leverage in guerilla warfare to the U.S. over Great\nBritain. In our modern times, due to the strength and organization of our Federal Government\nand its optimistic utility of the legislative branch, our firm is requesting either a subsequent\namendment for Economic Arbitration, be introduced formally granting the power of statutory\nand business law either separately from both Amendment VI and Amendment VII, or that these\nprivileges be incorporated into Amendment VII itself for all economic or non-violent offenses.\n\n[[Title 18, U.S. Code  470 -  514]]\n(2) Application to convictions prior to enactment. -- States may--\n(A) continue prosecution for crimes as individuals as specified in Amendment VII of\n\nthe U.S. Constitution, Bill of Rights as in effect\nprior to the date of enactment of this section; or\n- 3 -\n\n(II) Lithium Hydroxide + Xenon Ion Engines and subsequent children patents for\n\"Method & Means of Converting Atomic Energy Into Utilizable Kinetic\nEnergy,\" US Patent # 3,670,494 (Noble Gas Engine US Patents);\n(III) Propane and Bi-fuel Propane Engines, as a vector of engineering for noble gas\nengines (neon, krypton, and xenon) and a carbon-negative agent, such as Lithium\nHydroxide;\n(IV) Use of Magnesium, Bromine, and Lithium as an oxidizer source carbon\nnegative agent, in specific reference to Noble Gas Engines, with noble gases as the\nfuel source;\n(V) Proprietor of satellites and other UAVs to monitor and alter the chemical\ncomposition of the atmosphere using Lithium Hydroxide + Xenon ion Engines in\nthe jurisdiction of the Western Interconnection;\n(VI) Proprietorship and use of nicotinamide riboside, superoxide dismutase, and\nN\nG\n-Hydroxy-L-arginine acetate salt for free radical induced oxidative stress;\n(VII) Proprietorship and use of 7-Nitroindazole, (S)-amino-6-boronohexanoic acid\n\n(ABH), and N-monomethylarginine (MMA) as a pharmaceutical treatment for COVID-\n19 and subsequent strains of Coronavirus;\n\n(VII) Proprietorship and use of Lanosterol, N-alpha-acetylcarnosine (NAC)\neyedrops for age related (\"cataract\") blindness, and Acetamidoxolutamide (Andarine,\nS-4)for premature genetic (\"cataract\") blindness;\n(c) DIVISION OF JURISDICTION ON OTHER PARTNERSHIPS. --These proprietorships\ndo not necessarily entitle the New California Republic Co. to the Western Interconnection energy\ngrid, but merely a proprietor to the rights of the Western interconnection through proxy vote or\ntender offer, and the intellectual property disclosed in Section 2(b)(2)(B)(ii) [S.J. RES. 69].\n\n- 4 -\n\n(B) formally acknowledge business law private arbitration post-conviction as an\nalternative sentencing method in each single case individually through private law at\njurisdictional discretion. An example being Democratic lobbying by the people for immigration:\n(1) Legislative filing of unapproved statutory law could be applied based\non every individual case by statute judication, but not by\nprecedent. An informal example of incorporating this into common law\nwould be to orally represent the people in Congress to the relevant head of\ndivisions who execute prosecution of the statutes being amended.\n(2) Statutory law and stipulations in which the legislative branch be granted\nentitlement to arbitration must be specific to clauses, and may not target\nthe entire contract until the statute were approved to be legislation.\nMeaning that specific clauses of immigration convictions could be\ndisputed, but not the entire law itself nullified, only the subsequent\nconditions such as the procedure of deportation and not the entire law.\n(a) The legal phrase reconciliation fidelity of duty, should be established as an\namendment to the U.S. Code, Title 18 legal phrase intent to defraud,\nto grant the constitutional right of corporate litigation and statutory law to\nbe charged as a liability and thereby reconciliated both pre and post\nconviction for all non-violent financial crime.\n(b) One example of similar legislation is how the Reagan Administration handled\ncorporate taxes. Ronald Reagan felt that high taxes on the wealthy only influenced abuse\nof tax credit policies, and that lower rates would increase transparency and faith, in the\nfederal tax system. This joint resolution would be applicable heavily in the Securities and\nExchange Commission, which governs Federal Securities Laws, and would influence\ncorporate executives who find themselves in situations of fraud to pursue transparent\nreconciliation and reallocation for all damages to the victims as opposed to the feeling of\na lack of transparency to try and honestly do whats best for everyone, but Malum\nprohibitum.\n(c) formally acknowledge statutory and Economic Arbitration either separately or as an\nalternative qualification for civil litigation in suits at common law. Statutory Law should\nbe defined as a form of criminal procedure only in reference to specific clauses of the\ncontract, not the entire contract itself, as stipulation to liquidate criminal procedures as\nlegislative arbitration or corporate liabilities in non-violent financial crimes specified in\nU.S. Code, Title 18.\n(C) The terms Malum in se, and Malum prohibitum, should be used as a distinctive\nmeasurement in establishing reconciliation fidelity of duty, in all matters of Economic\nArbitration, as defined by either and independent legal theory of legal discipline to\ncriminal and civil law, or a supplemental liquidation method in determination of criminal\nprocedure in a country where the government is effective and stable, opposed to a\nrevolutionary era intended to leverage a proxy government. An example of this\napplication would be the recent fraud case for the border wall:\n(1) Initially, our current use of the Amendment (VII) of the U.S.\nConstitution would put small situations of intent to defraud, in\ntoo broad of a category, causing initial complications to be dealt with by\n\n- 5 -\n\na lack of transparency, for small violations that would\nresult in the executive party often publicly walking the fine line, of\nfinancial fraud for political elections. Application of this statute would\nentitle the legislative branch to become apart of an iterative process\nthrough its Political Action Committees as a qualitative resolution to\nsmaller violations with congressional arbitration through public statute\n(2) Our current use of the Amendment (VII) of the U.S.\nConstitution was intended to give leverage to colonialists over the\nBritish Parliament through civil courts, however we have since created\na very sound Federal Government and should grant the executive branch\n(along with their electorates, the people) the entitlement of Economic\nArbitration, which would grant statutory law and the legislative branch\nthe ability to codify both public resolutions through PACs, along with\nprivate arbitration with the Legislative Branch. Currently, the people\nare not granted the constitutional right to Legislative Authority due to\nthe U.S. Constitution being created when Parliament significantly\nweakened the Legislative Branch and Magistrates were used to leverage\nthe British Parliament in times of a Revolutionary War. These authorities\nno longer apply to revolution, and weaken both the powers of the people\nas well as the executive branch to come to transparent resolutions.\nEssentially, the conditions that spawned Amendment (VII) of the U.S.\nConstitution were created to strengthen judication when legislation was\nweak, and this joint resolution would strengthen legislation as the\nFederal Government is stable an eager to listen to its citizens.\n(3) In general.--Subject to Federal Energy Commission the entitlements granted by\namendment (VII) were originally intended to allow leverage in guerilla warfare to the U.S. over\nGreat Britain. In our modern times, due to the strength and organization of our Federal\nGovernment and its optimistic utility of the legislative branch, our firm is requesting either a\nsubsequent amendment for Economic Arbitration, be introduced formally granting the power\nof statutory and business law either separately from both Amendment VI and Amendment VII,\n\nor that these privileges be incorporated into Amendment VII itself for all economic or non-\nviolent offenses.\n\nSubmitted September 9, 2020.",
    "116TH CONGRESS\n2D SESSION\n\n\nS. J. RES. 69\n\n\nProviding for the reappointment of a Political Action Committee to the Federal Energy Regulatory Commission jurisdiction of the Western Interconnection.\n\nIN THE SENATE OF THE UNITED STATES\nSEPTEMBER 18, 2020\nNew California Republic Co.(by and through, Wilson & Rome, L.L.P., and Ms.ROME) introduced the following joint resolution; which has been introduced to the Colorado Senate and U.S. Congress.\n\nJOINT RESOLUTION\n\n\n   To amend Article VII of the U.S. Constitution to incorporate constitutional right to statutory law and to specify the distinction in U.S. Code, Title 18 Crimes for civil litigation by legal phrase intent to defraud, to fidelity of duty, in regards to damage reconciliation, and (malum in se, vs malum prohibitum). To formally entitle the use of the legislative district chamber, the application of pre and post-conviction amnesty by statute through use of business law and civil liability reconciliation through the legislative branch either formally or informally.  \n\n    Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, the New California Republic Co. declare the Proprietorship (The Republic of California,) of the Western Interconnection through reappointment of the Federal Energy Regulatory Commission. \n\nSECTION 1. SHORT TITLE.\n\n    This Joint Resolution may be cited as the THE REPUBLIC OF CALIFORNIA, proprietorship rights and Political Action Committee of the New California Republic Co. and the Federal Energy Regulatory Commission (FERC), Western Interconnection.  [S.J. RES. 69].\nSEC. 2. THE REPUBLIC OF CALIFORNIA.\n\n    (a) In General.--Amendment (VII) of the U.S. Constitution and U.S. Code, Title 18 (18 U.S.C. [?470 -  514]) is amended--\n            (1) in Title 18 (18 USC [?470 -  514]), by striking ``intent to defraud'' and \n        inserting ``fidelity of duty''; based on damage reconciliation,;\n            (2) in 18 U.S. Code (?470 -  514), by striking ``(class B felony)'' and inserting ``malum in se, class A misdemeanor or malum prohibitum, civil infraction''; and\n            (3) in 18 U.S. Code (?470 -  514), by striking ``(fined or imprisoned)'' and inserting ``fined on malum prohibitum, or imprisoned on malum in se, ''; and\n            (4) by amending Amendment (VII) of the U.S. Constitution, or inserting the following   \n         new Amendment (VII) - [Economic Arbitration]:\n\n    ``(Amendment VIII - [Economic Arbitration]) In litigation of non-violent financial crime, where the conditions are met for malum prohibitum, the right of amnesty by statute shall be preserved, and no bill introduced by an arbitrator, shall be otherwise reexamined in any court of the United States, than according to the rules of the economic arbitration and statutory law in the executive and legislative branch.\n\n    (b) LIMIT ON JURISDICTION FOR PROPRIETORSHIP.--\n  (1) IN GENERAL.-- If suit at common law is invoked on a proprietorship that is not described in subsection (2)(B)(ii), the equity of post-suit reconciliation shall be equally divided between the lobbyist firm and the subsequent limited partnership, or the plaintiff.\n  (2) PROPRIETORSHIPS COVERED.--A proprietorship described in this paragraph is the state or right of owning a business or holding property--\n(A) as a lobbyist of the Republic of California, or of the United States Congress; or\n      (B) in the executive branch that is--\n      (i) not a position at level I of the Executive Schedule under section 5312 of Title 5, United States Code; or that is\n      (ii) a proprietorship of--\n(I) the Federal Energy Regulatory Commission, jurisdiction of Western Interconnection;\n(II) Lithium Hydroxide + Xenon Ion Engines and subsequent children patents for \"Method & Means of Converting Atomic Energy Into Utilizable Kinetic Energy,\" US Patent # 3,670,494 (Noble Gas Engine US Patents);\n(III) Propane and Bi-fuel Propane Engines, as a vector of engineering for noble gas engines (neon, krypton, and xenon) and a carbon-negative agent, such as Lithium Hydroxide;\n(IV) Use of Magnesium, Bromine, and Lithium as an oxidizer source carbon negative agent, in specific reference to Noble Gas Engines, with noble gases as the fuel source;\n(V) Proprietor of satellites and other UAVs to monitor and alter the chemical composition of the atmosphere using Lithium Hydroxide + Xenon ion Engines in the jurisdiction of the Western Interconnection;\n      (VI) Proprietorship and use of nicotinamide riboside, superoxide dismutase, and \n      NG-Hydroxy-L-arginine acetate salt for free radical induced oxidative stress;\n        (VII) Proprietorship and use of 7-Nitroindazole, (S)-amino-6-boronohexanoic acid                 (ABH), and N-monomethylarginine (MMA) as a pharmaceutical treatment for COVID-19 and subsequent strains of Coronavirus;\n    (c) DIVISION OF JURISDICTION ON OTHER PARTNERSHIPS. --These proprietorships do not necessarily entitle the New California Republic Co. to the Western Interconnection energy grid, but merely a proprietor to the rights of the Western interconnection through proxy vote or tender offer, and the intellectual property disclosed in Section 2(b)(2)(B)(ii) [S.J. RES. 69].\n(d)  Effective Date.--\n            (1) In general.--Subject to Amendment (VII), the entitlements granted by amendment (VII) were originally intended to allow leverage in guerilla warfare to the U.S. over Great Britain. In our modern times, due to the strength and organization of our Federal Government and its optimistic utility of the legislative branch, our firm is requesting either a subsequent amendment for Economic Arbitration, be introduced formally granting the power of statutory and business law either separately from both Amendment VI and Amendment VII, or that these privileges be incorporated into Amendment VII itself for all economic or non-violent offenses.\n\n            (2) Application to convictions prior to enactment. -- States may--\n                    (A) continue prosecution for crimes as individuals as specified in Amendment VII of the U.S. Constitution, Bill of Rights as in effect \nprior to the date of enactment of this section; or\n\n[[Title 18, U.S. Code ?470 -  514]]\n\n                    (B) formally acknowledge business law private arbitration post-conviction as an alternative sentencing method in each single case individually through private law at jurisdictional discretion. An example being Democratic lobbying by the people for immigration:\n(1) Legislative filing of unapproved statutory law could be applied based \n      on every individual case by statute judication, but not by \n      precedent. An informal example of incorporating this into common law\n      would be to orally represent the people in Congress to the relevant head of\n      divisions who execute prosecution of the statutes being amended.\n(2) Statutory law and stipulations in which the legislative branch be granted  \n      entitlement to arbitration must be specific to clauses, and may not target\n      the entire contract until the statute were approved to be legislation.\n      Meaning that specific clauses of immigration convictions could be \n      disputed, but not the entire law itself nullified, only the subsequent \n      conditions such as the procedure of deportation and not the entire law.\n(a) The legal phrase reconciliation fidelity of duty, should be established as an \namendment to the U.S. Code, Title 18 legal phrase intent to defraud, \nto grant the constitutional right of corporate litigation and statutory law to \nbe charged as a liability and thereby reconciliated both pre and post \nconviction for all non-violent financial crime.\n(b) One example of similar legislation is how the Reagan Administration handled \ncorporate taxes. Ronald Reagan felt that high taxeof the Federal Energy Regulatory Commission jurisdiction, as a Political Action Committee (the PAC).  on the wealthy only influenced abuse of tax credit policies, and that lower rates would increase transparency and faith, in the federal tax system. This joint resolution would be applicable heavily in the Securities and Exchange Commission, which governs Federal Securities Laws, and would influence corporate executives who find themselves in situations of fraud to pursue transparent reconciliation and reallocation for all damages to the victims as opposed to the feeling of a lack of transparency to try and honestly do whats best for everyone, but Malum prohibitum.\n(c) formally acknowledge statutory and Economic Arbitration either separately or as an alternative qualification for civil litigation in suits at common law. Statutory Law should be defined as a form of criminal procedure only in reference to specific clauses of the contract, not the entire contract itself, as stipulation to liquidate criminal procedures as legislative arbitration or corporate liabilities in non-violent financial crimes specified in U.S. Code, Title 18.\n\n(C) The terms Malum in se, and Malum prohibitum, should be used as a distinctive measurement in establishing reconciliation fidelity of duty, in all matters of Economic Arbitration, as defined by either and independent legal theory of legal discipline to criminal and civil law, or a supplemental liquidation method in determination of criminal procedure in a country where the government is effective and stable, opposed to a revolutionary era intended to leverage a proxy government. An example of this application would be the recent fraud case for the border wall:\n(1)   Initially, our current use of the Amendment (VII) of the U.S.\n        Constitution would put small situations of intent to defraud, in \n        too broad of a category, causing initial complications to be dealt with by\n        a lack of transparency, for small violations that would \n        result in the executive party often publicly walking the fine line, of \n        financial fraud for political elections. Application of this statute would \n        entitle the legislative branch to become apart of an iterative process \n        through its Political Action Committees as a qualitative resolution to\n        smaller violations with congressional arbitration through public statute\n(2)   Our current use of the Amendment (VII) of the U.S.\n        Constitution was intended to give leverage to colonialists over the\n        British Parliament through civil courts, however we have since created\n        a very sound Federal Government and should grant the executive branch\n        (along with their electorates, the people) the entitlement of Economic \n        Arbitration, which would grant statutory law and the legislative branch\n        the ability to codify both public resolutions through PACs, along with  \n        private arbitration with the Legislative Branch. Currently, the people \n        are not granted the constitutional right to Legislative Authority due to\n        the U.S. Constitution being created when Parliament significantly \n        weakened the Legislative Branch and Magistrates were used to leverage \n        the British Parliament in times of a Revolutionary War. These authorities \n        no longer apply to revolution, and weaken both the powers of the people\n        as well as the executive branch to come to transparent resolutions.         \n        Essentially, the conditions that spawned Amendment (VII) of the U.S. \n        Constitution were created to strengthen judication when legislation was         \n        weak, and this joint resolution would strengthen legislation as the \n        Federal Government is stable an eager to listen to its citizens.\n\n            (3) In general.--Subject to Federal Energy Commission the entitlements granted by amendment (VII) were originally intended to allow leverage in guerilla warfare to the U.S. over Great Britain. In our modern times, due to the strength and organization of our Federal Government and its optimistic utility of the legislative branch, our firm is requesting either a subsequent amendment for Economic Arbitration, be introduced formally granting the power of statutory and business law either separately from both Amendment VI and Amendment VII, or that these privileges be incorporated into Amendment VII itself for all economic or non-violent offenses.",
    "SEC. 2. THE REPUBLIC OF CALIFORNIA.\n\n    (a) In General.--Amendment (VII) of the U.S. Constitution and U.S. Code, Title 18 (18 U.S.C. [&#226;€&#175;470 -  514]) is amended--\n\n            (1) in Title 18 (18 USC [&#226;€&#175;470 -  514]), by striking ``intent to defraud'' and\n\n        inserting ``fidelity of duty''; based on damage reconciliation,;\n\n            (2) in 18 U.S. Code (&#226;€&#175;470 -  514), by striking ``(class B felony)'' and inserting ``malum in se, class A misdemeanor or malum prohibitum, civil infraction''; and\n\n            (3) in 18 U.S. Code (&#226;€&#175;470 -  514), by striking ``(fined or imprisoned)'' and inserting ``fined on malum prohibitum, or imprisoned on malum in se, ''; and\n\n            (4) by amending Amendment (VII) of the U.S. Constitution, or inserting the following  \n\n         new Amendment (VII) - [Economic Arbitration]:\n\n    ``(Amendment VIII - [Economic Arbitration]) In litigation of non-violent financial crime, where the conditions are met for malum prohibitum, the right of amnesty by statute shall be preserved, and no bill introduced by an arbitrator, shall be otherwise reexamined in any court of the United States, than according to the rules of the economic arbitration and statutory law in the executive and legislative branch.\n\n(b) Limit On Jurisdiction For Proprietorship.--\n\n(1) IN GENERAL.-- If suit at common law is invoked on a proprietorship that is not described in subsection (2)(B)(ii), the equity of post-suit reconciliation shall be equally divided between the lobbyist firm and the subsequent limited partnership, or the plaintiff.",
    "(2) PROPRIETORSHIPS COVERED.--A proprietorship described in this paragraph is the state or right of owning a business or holding property--\n\n(A) as a lobbyist of the Republic of California, or of the United States Congress; or\n\n(B) in the executive branch that is--\n\n(i) not a position at level I of the Executive Schedule under section 5312 of Title 5, United States Code; or that is\n\n(ii) a proprietorship of-\n\n \n\n(I)              the Federal Energy Regulatory Commission, jurisdiction of Western Interconnection;\n\n \n\n(II)            Lithium Hydroxide + Xenon Ion Engines and subsequent children patents for \"Method & Means of Converting Atomic Energy Into Utilizable Kinetic Energy,\" US Patent # 3,670,494 (Noble Gas Engine US Patents);\n\n \n\n(III)          Propane and Bi-fuel Propane Engines, as a vector of engineering for noble gas engines (neon, krypton, and xenon) and a carbon-negative agent, such as Lithium Hydroxide;\n\n \n\n(IV)         Use of Magnesium, Bromine, and Lithium as an oxidizer source carbon negative agent, in specific reference to Noble Gas Engines, with noble gases as the fuel source;\n\n \n\n(V)            Proprietor of satellites and other UAVs to monitor and alter the chemical composition of the atmosphere using Lithium Hydroxide + Xenon ion Engines in the jurisdiction of the Western Interconnection;",
    "(2) PROPRIETORSHIPS COVERED.--A proprietorship described in this paragraph is the state or right of owning a business or holding property--\n\n(A) as a lobbyist of the Republic of California, or of the United States Congress; or\n\n(B) in the executive branch that is--\n\n(i) not a position at level I of the Executive Schedule under section 5312 of Title 5, United States Code; or that is\n\n(ii) a proprietorship of-\n\n \n\n(I)              the Federal Energy Regulatory Commission, jurisdiction of Western Interconnection;\n\n \n\n(II)            Lithium Hydroxide + Xenon Ion Engines and subsequent children patents for \"Method & Means of Converting Atomic Energy Into Utilizable Kinetic Energy,\" US Patent # 3,670,494 (Noble Gas Engine US Patents);\n\n \n\n(III)          Propane and Bi-fuel Propane Engines, as a vector of engineering for noble gas engines (neon, krypton, and xenon) and a carbon-negative agent, such as Lithium Hydroxide;\n\n \n\n(IV)         Use of Magnesium, Bromine, and Lithium as an oxidizer source carbon negative agent, in specific reference to Noble Gas Engines, with noble gases as the fuel source;\n\n \n\n(V)            Proprietor of satellites and other UAVs to monitor and alter the chemical composition of the atmosphere using Lithium Hydroxide + Xenon ion Engines in the jurisdiction of the Western Interconnection;\n\n(VI)            Prototyping and research of Lithium Hydroxide engine fuel in remote control and model rockets to judge the efficacy of Lithium based propulsion for use with Xenon Ion Engines;\n\n(VII)            Prototyping and research of various Selective Androgen Receptor Modulators for use in conjunction with oxidative stress and immunosuppressive therapies targeting specifically the later stages of progressive cancers and autoimmune disorders;",
    "(2) PROPRIETORSHIPS COVERED.--A proprietorship described in this paragraph is the state or right of owning a business or holding property--\n\n(A) as a lobbyist of the Republic of California, or of the United States Congress; or\n\n(B) in the executive branch that is--\n\n(i) not a position at level I of the Executive Schedule under section 5312 of Title 5, United States Code; or that is\n\n(ii) a proprietorship of-\n\n \n\n(I)              the Federal Energy Regulatory Commission, jurisdiction of Western Interconnection;\n\n \n\n(II)            Lithium Hydroxide + Xenon Ion Engines and subsequent children patents for \"Method & Means of Converting Atomic Energy Into Utilizable Kinetic Energy,\" US Patent # 3,670,494 (Noble Gas Engine US Patents);\n\n \n\n(III)          Propane and Bi-fuel Propane Engines, as a vector of engineering for noble gas engines (neon, krypton, and xenon) and a carbon-negative agent, such as Lithium Hydroxide;\n\n \n\n(IV)         Use of Magnesium, Bromine, Cerium, and Lithium as an oxidizer source carbon negative agent, in specific reference to Noble Gas Engines, with noble gases as the fuel source;\n\n \n\n(V)            Proprietor of satellites and other UAVs to monitor and alter the chemical composition of the atmosphere using Lithium Hydroxide + Xenon ion Engines in the jurisdiction of the Western Interconnection;\n\n(VI)            Prototyping and research of Lithium Hydroxide engine fuel in remote control and model rockets to judge the efficacy of Lithium based propulsion for use with Xenon Ion Engines;\n\n(VII)            Prototyping and research of various Selective Androgen Receptor Modulators for use in conjunction with oxidative stress and immunosuppressive therapies targeting specifically the later stages of progressive cancers and autoimmune disorders;"
  ],
  "years": [
    2020
  ],
  "yearsActive": 1,
  "avgAnnualSpending": 5507688,
  "peakYear": 2020,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 11
}