{"id":197037,"name":"NONPROFIT KIDNEY CARE ALLIANCE","slug":"nonprofit-kidney-care-alliance","state":"DC","description":"Nonprofit organization representing nonprofit dialysis facilities","totalSpending":2510000,"filings":29,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":320000},{"year":2020,"income":360000},{"year":2021,"income":360000},{"year":2022,"income":250000},{"year":2023,"income":360000},{"year":2024,"income":180000},{"year":2025,"income":360000}],"firms":["HOOPER, LUNDY & BOOKMAN, P.C."],"lobbyists":["KELLY DELMORE","MONICA MASSARO","MARTIN CORRY","CLAIRE ERNST"],"issues":["MMM","BUD","HCR",null],"sampleDescriptions":["End-stage renal disease (ESRD) rebasing, Medicare reimbursement, and payment reform.  Center for Medicare and Medicaid Innovation (CMMI)Comprehensive ESRD Care Initiative. Improved policies for chronic kidney disease (CKD). Improved policies for transplantation. Implementation of the Medicare Access and CHIP Reauthorization Act (MACRA). Medicare Third Party Payment. Living Donor Protection Act (H.R. 1270). The Dialysis PATIENTS Demonstration Act (H.R. 4143/S. 2065). MA risk adjustment for CKD.","End-stage renal disease (ESRD) rebasing, Medicare reimbursement, and payment reform.  Center for Medicare and Medicaid Innovation (CMMI)Comprehensive ESRD Care Initiative (CEC). Improved policies for chronic kidney disease (CKD). Improved policies for transplantation. Implementation of the Medicare Access and CHIP Reauthorization Act (MACRA). Medicare Third Party Payment. Living Donor Protection Act (H.R. 1270). The Dialysis PATIENTS Demonstration Act (H.R. 4143/S. 2065). MA risk adjustment for CKD. Changes to the Comprehensive ESRD Care Model.","Kidney X Funding Request.","Living Donor Protection Act (HR 1224/S. 511).","Centers for Medicare and Medicaid Innovation(CMMI)Comprehensive ESRD care model and future payment models; Improving policies on chronic kidney disease and transplantation.","Kidney X Funding Request; Centers for Medicare and Medicaid Innovation(CMMI)Comprehensive ESRD care model and future payment models; Improving policies on chronic kidney disease and transplantation.","Kidney X Funding Request; Centers for Medicare and Medicaid Innovation(CMMI)Comprehensive ESRD care model and future payment models; Improving policies on chronic kidney disease and transplantation; Legislation impacting organ procurement organizations; 2020 hospice proposed rule; Provisions related to alternative payment models; Improving end of life, hospice, and palliative care option for those with ESRD.","Centers for Medicare and Medicaid Innovation(CMMI)Comprehensive ESRD care model and future payment models; Improving policies on chronic kidney disease and transplantation; Legislation impacting organ procurement organizations; 2020 hospice proposed rule; Provisions related to alternative payment models; Improving end of life, hospice, and palliative care option for those with ESRD; ESRD Treatment Choices Model Implementation; Kidney Care Models through CMMI.","Centers for Medicare and Medicaid Innovation (CMMI) models including, Comprehensive ESRD care, ESRD Treatment Choices, and voluntary Kidney Care models, Improving policies on chronic kidney disease and transplantation, Improving end of life, hospice, and palliative care options for individuals with ESRD, Policies impacting Organ Procurement Organizations, COVID-19 policies and relief.","Centers for Medicare and Medicaid Innovation (CMMI) models including, Comprehensive ESRD care, ESRD Treatment Choices, and voluntary Kidney Care models, Improving policies on chronic kidney disease and transplantation, Improving end of life, hospice, and palliative care options for individuals with ESRD, Policies impacting Organ Procurement Organizations, COVID-19 policies and relief, Comprehensive Immunosuppressive Drug Coverage for Kidney Transplant Patients Act (H.R. 5534/S.3353), Policies related to the implementation of ESRD coverage in Medicare Advantage.","Centers for Medicare and Medicaid Innovation (CMMI) models including, Comprehensive ESRD care, ESRD Treatment Choices, and voluntary Kidney Care models, Improving policies on chronic kidney disease and transplantation, Improving end of life, hospice, and palliative care options for individuals with ESRD, Policies impacting Organ Procurement Organizations, COVID-19 policies and relief, Comprehensive Immunosuppressive Drug Coverage for Kidney Transplant Patients Act (H.R. 5534/S.3353), Policies related to the implementation of ESRD coverage in Medicare Advantage, COVID-19 vaccine distribution.","Issues relating to Centers for Medicare and Medicaid Innovation (CMMI) models, including Comprehensive ESRD Care, ESRD Treatment Choices and voluntary Kidney Care models; COVID-19 Policies and Relief; and Policies Impacting Organ Procurement Organizations.","Living Donor Protection Act (H.R. 1255/S. 377) and COVID-19 Vaccine Access for Kidney Patients.","KidneyX Funding","Issues relating to Centers for Medicare and Medicaid Innovation (CMMI) models, including Comprehensive ESRD Care, ESRD Treatment Choices and voluntary Kidney Care models; COVID policies and relief, policies impacting organ procurement, Medicare coverage of concurrent hospice and dialysis, and Medicare payment.","Living Donor Protection Act (H.R. 1255/S. 377) and COVID-19 Vaccine Access for Kidney Patients and Healthcare Workers.","Issues relating to Centers for Medicare and Medicaid Innovation (CMMI) models, including Comprehensive ESRD Care, ESRD Treatment Choices and voluntary Kidney Care models; COVID policies and relief, policies impacting organ procurement, Medicare coverage of concurrent hospice and dialysis, and Medicare payment; Issues related to staffing and workforce.","Living Donor Protection Act (H.R. 1255/S. 377).","Issues relating to Centers for Medicare and Medicaid Innovation (CMMI) models, including Comprehensive ESRD Care, ESRD Treatment Choices and voluntary Kidney Care models; COVID policies and relief, policies impacting organ procurement, Medicare coverage of concurrent hospice and dialysis, and Medicare payment; Issues related to staffing and workforce; Telehealth coverage policies; Dental coverage; Implementation of the Consolidated Appropriations Act policies related to immunosuppressant drug coverage.","Living Donor Protection Act (H.R. 1255/S. 377); Issues related to health care working staffing shortages; Dental coverage."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}