{"id":151165,"name":"NORFOLK SOUTHERN CORPORATION","slug":"norfolk-southern-corporation","state":"VA","description":null,"totalSpending":1630000,"filings":31,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["WILLIAMS AND JENSEN, PLLC"],"lobbyists":["SUSAN HIRSCHMANN","MATTHEW HOEKSTRA","FRANK VLOSSAK","DENIS DWYER","JOHN MCMACKIN","CHRISTOPHER WILCOX","JOEL OSWALD","DANIEL ZIEGLER"],"issues":["RRR","TRA","BUD","LBR",null],"sampleDescriptions":["Rail regulation and re-regulation issues.  Positive train control (PTC) implementation.","Oppose efforts to increase truck weight limits.","Appropriations issues impacting rail industry.","Rail regulation and re-regulation issues.  Positive train control (PTC) implementation.  H.R. 1748, S. 1979.","Rail regulation and re-regulation issues.  Positive train control (PTC) implementation.  H.R. 1748, S. 1979.  Cost benefit analysis for new rulemakings.","Oppose efforts to increase truck weight limits.  Railroad grade crossings.","Oppose efforts to increase truck weight limits.  Railroad grade crossings.  H.R. 2, Surface transportation reauthorization provisions impacting the rail industry.","Rail and labor policies proposed as part of Congressional infrastructure investment proposals.","Rail and labor policies proposed as part of Congressional infrastructure investment proposals. Oppose efforts to increase truck weight limits.  Railroad grade crossings.  H.R. 3684.","Rail and labor policies proposed as part of Congressional infrastructure investment proposals.    Rail related provisions of Administrations Executive Order on Promoting Competition in the American Economy.","Rail and labor policies proposed as part of Congressional infrastructure investment proposals. Rail related provisions of Administrations Executive Order on Promoting Competition in the American Economy.","Rail and labor policies proposed as part of Congressional infrastructure investment proposals. Oppose efforts to increase truck weight limits. Railroad grade crossings. H.R. 3684.","Rail and labor policies proposed as part of Congressional infrastructure investment proposals. Rail related provisions of Administrations Executive Order on Promoting Competition in the American Economy. H.J.Res.100 (P.L. 117-216).","Rail and labor policies proposed as part of Congressional infrastructure investment proposals. Oppose efforts to increase truck weight limits. Railroad grade crossings. H.R. 3684. H.J.Res.100 (P.L. 117-216).","H.J.Res.100 (P.L. 117-216).","General education about policies impacting the rail industry; outreach to House and Senate related to rail operations and incident response.","General education about policies impacting the rail industry; outreach to House and Senate related to rail operations and incident reponse.","General education about policies impacting the rail industry; outreach to House and Senate related to rail operations. Proposed merger between Norfolk Southern and Union Pacific."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}