{"id":129674,"name":"NORTHEASTERN UNIVERSITY","slug":"northeastern-university","state":"MA","description":null,"totalSpending":1200000,"filings":24,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":150000},{"year":2020,"income":150000},{"year":2021,"income":200000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":150000}],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"lobbyists":["LAUREN BROCCOLI","APRIL BURKE","MICHAEL LEDFORD","MIRIAM QUINTAL","KARI MCCARRON","PAULA TRIMBLE","NICK SAAB","ERIN CADWALADER","CHRISTINA LARIDAEN","SHARON ESHELMAN","WILLIAM KATT"],"issues":["SCI","DEF","BUD","EDU","HOM","TAX","HCR"],"sampleDescriptions":["Issues pertaining to infrastructure research, workforce development, and research infrastructure.\nCoastal Sustainability Research Bill, All Provisions.","National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding.","H.R. 3358, S. 1771 FY 2018, Labor/HHS/Education Appropriations, Issues pertaining to NIH funding and full support for facilities and administrative (F&A) costs, Department of Education, and student aid.\nH.R. 3267, S. 1662, FY 2018 Commerce/Justice/Science Appropriations, Issues pertaining to NOAA and NSF.\nH.R. 3219, FY 2018 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nH.R. 3355, FY 2018 Homeland Security Appropriations, Issues pertaining to disaster assessment and resilience and University Centers of Excellence.\nH.R. 3354, FY 2018 Interior, Environment and Related Agencies Appropriations, Issues pertaining to funding for NEH and NEA.\nP.L. 115-141, Consolidated Appropriations Act, 2018, Issues pertaining to funding of federal research, development, and education.\nFY 2019 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Department of Education and student aid.\nFY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NOAA and NSF.\nFY 2019 Defense Appropriations, Issues pertaining research and development at the Department of Defense including the Army Research Laboratory Open Campus initiative.\nFY 2019 Homeland Security Appropriations, Issues pertaining to disaster assessment and resilience and University Centers of Excellence.\nFY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to funding for NEH and NEA.","Higher Education Act Reauthorization, Issues pertaining to federal student aid, work study, and grant programs.\nH.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to federal student aid and grant programs.","Issues pertaining to disaster assessment and resilience capability development.","Public Law No. 115-232, National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to AI, research and development activities of the Department of Defense, including basic and applied research funding, and implementation of task order contracting for universities.","Public Law No: 115-245, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Department of Education, and student aid.\nPublic Law No: 115-245, FY 2019 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nS. 3109, FY 2019 Homeland Security Appropriations, Issues pertaining to disaster assessment and resilience and University Centers of Excellence.\nH.R. 5952, S. 3072, FY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF.","H.R. 6227, S. 3143, National Quantum Initiative Act, Issues pertaining to support for fundamental quantum information science research.\nH.R. 6288, Coastal Sustainability Research Bill Creating Opportunity and Sustainability Through Science (COASTS) Act, All provisions.","Higher Education Act Reauthorization, Issues pertaining to federal student aid, work study, and grant programs.","Higher Education Act Reauthorization, Issues pertaining to federal student aid and grant programs.\nH.R. 3035, S.830, Classrooms to Career Act, All provisions.","Coastal Sustainability Research Bill Creating Opportunity and Sustainability Through Science (COASTS) Act, All provisions. \nIssues pertaining to AI research, workforce, and social implications.","Issues pertaining to lifelong learning accounts.","H.R. 2500, S. 1790, National Defense Authorization Act for Fiscal Year 2020, Issues pertaining to research and development, including cybersecurity, unmanned systems, materials research, additive manufacturing, and research protections.","H.R. 2740, Labor, Health and Human Services, Education, Defense, State, Foreign Operations, and Energy and Water Development Appropriations Act, 2020, Division A, Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, Issues pertaining to NIH, Department of Education, student aid, and CDC Alzheimer's disease and related dementias public health centers of excellence.\nH.R. 2740, Labor, Health and Human Services, Education, Defense, State, Foreign Operations, and Energy and Water Development Appropriations Act, 2020, Division C, Department of Defense Appropriations Act, Issues pertaining to research and development at the Department of Defense, including cybersecurity, unmanned systems, additive manufacturing and materials science, and the Army Research Laboratory Open Campus initiative.\nFY 2020 Homeland Security Appropriations, Issues pertaining to University Centers of Excellence.","H.R. 2740, S. 2474, Department of Defense Appropriations Act, 2020, Issues pertaining to research and development at the Department of Defense, including cybersecurity, unmanned systems, and additive manufacturing and materials science.\nH.R. 3931, S. 2582, Department of Homeland Security Appropriations Act, 2020, Issues pertaining to University Centers of Excellence.\nH.R. 2740, S. 2583, Department of State, Foreign Operations, and Related Programs Appropriations Act, 2020, Issues pertaining to disaster assessment and resilience.","H.R. 3919, Creating Opportunity And Sustainability Through Science (COASTS) Act, All Provisions.","Higher Education Act Reauthorization, Issues pertaining to federal student aid and grant programs.\nH.R. 4674, College Affordability Act, Issues pertaining to federal student aid and grant programs.\nH.R. 3035, S.830, Classrooms to Career Act, All provisions.\nIssues pertaining to higher education and the future of work.","Public Law No. 116-92, National Defense Authorization Act for Fiscal Year 2020, Issues pertaining to research and development, including cybersecurity, unmanned systems, materials research, additive manufacturing, and research protections.\nIssues pertaining to national security workforce development.","H.R. 2740, S. 2474, Department of Defense Appropriations Act, 2020, Issues pertaining to research and development at the Department of Defense, including cybersecurity, unmanned systems, additive manufacturing and materials science, and the Army Research Laboratory Open Campus initiative.\nH.R. 2740, S. 2583, Department of State, Foreign Operations, and Related Programs Appropriations Act, 2020, Issues pertaining to disaster assessment and resilience.","Issues pertaining to AI research, workforce, and social implications.\nH.R. 3609, S. 2660, Wind Energy Research and Development Act of 2019, Issues pertaining to offshore wind research and development.\nH.R. 3919, Creating Opportunity And Sustainability Through Science (COASTS) Act, All Provisions.\nH.R. 5102, Coastal Resilience Research and Education Act, All provisions.\nIssues pertaining to research infrastructure and workforce development.\nIssues related to science, security, and domestic competitiveness."],"years":[2018,2019,2020,2021,2022,2024,2025]}