{"id":194542,"name":"NOVARTIS","slug":"novartis","state":"DC","description":"Pharmaceutical manufacturer.","totalSpending":1470000,"filings":24,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":180000},{"year":2020,"income":260000},{"year":2021,"income":190000},{"year":2022,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":240000}],"firms":["TIBER CREEK HEALTH STRATEGIES, INC."],"lobbyists":["JAMES HALL"],"issues":["HCR","MMM","TAX"],"sampleDescriptions":["HR 1625, Vehicle for Consolidated Appropriations Act of 2018. Issues related to Medicare Part D.","Issues related to pharmaceutical pricing.","S.540, Mobile Workforce State Income Tax Simplification Act of 2017.","Issues related to Medicare Part D.","Issues related to Medicare Part D. Issues related to pharmaceutical pricing.","Issued related to Medicare Part D. Issues related to pharmaceutical pricing.","Issues related to the Prescription Drug Pricing Reduction Act","Issues related to Part B and Part D pricing","Issues related to the Prescription Drug Pricing Reduction Act, HR 1865 - Consolidated Appropriations Act (PL 116-94)","Issues related to the Prescription Drug Pricing Reduction Act; HR 6201 Families First Coronavirus Response Act (PL 116-27) - drug pricing issues; CARES Act - S. 3548 (PL 116-136) - drug pricing issues.","CARES Act - S. 3548 (PL 116-136) - drug pricing issues. H.R. 6800 the Health and Economic Recovery Omnibus Emergency Solutions Act","Issues related to drug pricing; Issues relating to the 340b program; S. 3353 Comprehensive Immunosuppressive drug coverage for Kidney Transplant Patients Act of 2020","H.R. 133 / PL 116-260 - FY2021 Omnibus and COVID Relief and Response Act","Issues related to Part B and Part D pricing; S. 3353 Comprehensive Immunosuppressive Drug Coverage for Kidney Transplant Patients Act of 2020","H.R. 133/PL 116-260 - FY2021 Omnibus and COVID Relief and Response Act.","Issues related to Part B and Part D pricing; S. 3353 - Comprehensive Immunosuppressive Drug Coverage for Kidney Transplant Patients Act of 2020.","Issues related to Part B and D drug pricing.","H.R. 5376 - Build Back Better Act, Subtitle J (Part B and D drug pricing).","H.R., 5376 as renamed - Inflation Reduction Act - Subtitle B, Parts B and D Drug Pricing.","Issues related to implementation of drug pricing and reimbursement for prescription drugs in Inflation Reduction Act of 2022 (PL 117-169)."],"years":[2018,2019,2020,2021,2022,2024,2025]}