{"id":137779,"name":"OFFICE OF THE GOVERNOR, STATE OF COLORADO","slug":"office-of-the-governor-state-of-colorado","state":"CO","description":"State Government","totalSpending":1340000,"filings":26,"yearlySpending":[{"year":2019,"income":80000},{"year":2020,"income":120000},{"year":2021,"income":160000},{"year":2022,"income":120000},{"year":2023,"income":250000},{"year":2024,"income":300000},{"year":2025,"income":310000}],"firms":["SQUIRE PATTON BOGGS"],"lobbyists":["PAMELA WELSH","MICHAEL DINO","VICTORIA CRAM","MARA SHELDON","MALLORY RICHARDSON","GENEVIEVE HUBBARD (NEE' BRESNAHAN)","DAVID LESSTRANG"],"issues":["URB","GOV","VET","HCR","ENV","NAT","BAN","TRA","EDU","IND","COM","DEF","ANI","LBR","BUD","AGR","HOM","INS","FOR","IMM","TAX","TRD",null,"ENG","FUE","DIS"],"sampleDescriptions":["General federal issues relevant to state government on water, health, criminal justice reform, education, public lands, immigration, tax, and trade","Monitor general issues related to infrastructure, public lands, healthcare, cannabis, early childhood education, and immigration","Support for National Medal of Honor Museum","Nondiscrimination in health and education programs; drug importation; disproportionate share payment reduction; Children's Health Insurance Program","Per- and polyfluoroalkyl substances (PFAS) amendments in the National Defense Authorization Act (NDAA/H.R. 5515).","Recovering America's Wildlife Act (H.R. 3742); wild horses/burros","Monitor impact of SAFE Banking Act (H.R. 1595).","Pipeline safety","Monitor general issues related to infrastructure, public lands, healthcare, cannabis, early childhood education, and immigration, FEMA hazard mitigation, National Defense Authorization Act for National Guard issues and PFAS, energy efficiency, USMCA, First Family Transition Act, Brand USA","Recovering America's Wildlife Act (H.R. 3742); wild horses/burros; Colorado Outdoor Recreation and Economy (CORE) Act (H.R. 823)","Reauthorization of Higher Education legislation","H.R. 2486 - FUTURE Act, Native American tuition waiver issues","Nondiscrimination in health and education programs; drug importation; disproportionate share payment reduction; Children's Health Insurance Program; drug pricing; SNAP; S. 2227 - MORE Act of 2019","Recovering America's Wildlife Act (H.R. 3742); wild horses/burros; Colorado Outdoor Recreation and Economy (CORE) Act (H.R. 823); Protect Americas Wildlife and Fish In Need of Conservation Act of 2019","Rural Digital Opportunity Fund","Support for Space Command location in Colorado","Providing Responsible Emergency Plans for Animals at Risk of Emerging Disasters Act; ProTECT Act of 2019","Support for Protecting Older Workers Against Discrimination Act","Appropriations for the Bureau of Reclamation; COVID-19 relief supplemental bills","COVID-19 relief supplemental bills for increased funding for medical equipment, medical insurance programs, the Paycheck Protection Program, SNAP; providing greater funds for transportation infrastructure including roads and bridges;providing funds for CDBG; providing funds for the LWCF; providing funds for the Homeland Security Grant Program and the EMPG; increased funding for the National Guard and Air Force in Colorado; increased funding for K-12 schools and the Pell Grant program"],"years":[2019,2020,2021,2022,2023,2024,2025]}