{"id":178567,"name":"OMEROS CORPORATION","slug":"omeros-corporation","state":"WA","description":"Biopharmaceutical company.","totalSpending":1890000,"filings":25,"yearlySpending":[{"year":2018,"income":300000},{"year":2019,"income":240000},{"year":2020,"income":160000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":320000},{"year":2024,"income":320000},{"year":2025,"income":70000}],"firms":["THE NICKLES GROUP, LLC"],"lobbyists":["STACEY HUGHES","MARY SAVARY TAYLOR","DON NICKLES","BRETT BAKER"],"issues":["MMM","BUD","HCR","GOV",null],"sampleDescriptions":["H.R. 1892, Bipartisan Budget Act of 2018 and H.R. 1625, Consolidated Appropriations Act of 2018 and issues related to Medicare payment policy in hospital outpatient and ambulatory surgical center settings. H.R. 4683, a bill to amend title XVIII of the SSA to revise the NTAP period under Medicare inpatient prospective payment system and the pass-through period under the Medicare outpatient PPS.","H.R. 1892, Bipartisan Budget Act of 2018 and H.R. 1625, Consolidated Appropriations Act of 2018.","Monitored issues related to prescription drug pricing for outpatient drugs.","Issues related to opioids.","Monitored issues related to prescription drug prices; issues related to the Merit-Based Incentive Payment System (MIPS); issues related to the packaging of drugs in the 2019 hospital outpatient proposed rule.","Monitored issues related to prescription drug prices; issues related to the Merit-Based Incentive Payment System (MIPS); issues related to the packaging of drugs in the 2019 hospital outpatient proposed rule; H.R. 5172, NOPAIN Act and S. 3067, Non-Opioids Prevent Addiction In the Nation Act and issues involving access to patients to non-opioid alternatives.","Monitored issues related to prescription drug prices; H.R. 5172, NOPAIN Act and S. 3067, Non-Opioids Prevent Addiction In the Nation Act and issues involving access to patients to non-opioid alternatives; issues related to outpatient reimbursement.","Monitored issues related to prescription drug prices; H.R. 5172, NOPAIN Act and S. 3067, Non-Opioids Prevent Addiction In the Nation Act and issues involving access to patients to non-opioid alternatives; issues related to the 2021 OPPS final rule; monitored issues related to H.R. 133, the Consolidated Appropriations Act of 2021.","Monitored issues related to prescription drug prices; H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access to patients to non-opioid alternatives; monitored implementation of P.L. 117-2, the American Rescue Plan.","Monitored issues related to prescription drug prices; S. 586 / H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access to patients to non-opioid alternatives; monitored implementation of P.L. 117-2, the American Rescue Plan.","H.R. 5376, Build Back Better Act, as it relates to prescription drug prices; S. 586 / H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access to patients to non-opioid alternatives.","H.R. 5376, Build Back Better Act, as it relates to prescription drug prices; H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access to patients to non-opioid alternatives.","Monitored H.R. 5376, Build Back Better Act, as it relates to prescription drug prices; S. 586 / H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access for patients to non-opioid alternatives.","Monitored H.R. 5376, Build Back Better Act, as it relates to prescription drug prices; H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access for patients to non-opioid alternatives.","Monitored H.R. 5376 (P.L. 117-169), the Inflation Reduction Act, as it relates to prescription drug prices; S. 586 / H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access for patients to non-opioid alternatives.","H.R. 2617 (P.L. 117-328), the Consolidated Appropriations Act of 2023, as it relates to access to non-opioid alternatives. S. 586 / H.R.3259, Non-Opioids Prevent Addiction In the Nation Act (NOPAIN Act) and issues involving access for patients to non-opioid alternatives. Monitored implementation of H.R. 5376 (P.L. 117-169), the Inflation Reduction Act, as it relates to prescription drug prices.","Monitored separate payment policy for nonopioid alternatives. Monitored issues involving funding for development of new therapies.","Monitored separate payment policy for nonopioid alternatives. Issues involving rare disease therapies.","Issues related to rare pediatric disease and Priority Review Vouchers (PRVs).","Monitored issues related to rare pediatric disease and Priority Review Vouchers (PRVs)."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}