{"id":127150,"name":"ONE ACTION","slug":"one-action","state":"DC","description":"Grassroots advocacy fighting global AIDS and extreme poverty.","totalSpending":1600000,"filings":27,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":220000}],"firms":["TIBER CREEK GROUP"],"lobbyists":["JEFFREY SHAPIRO","JENNIFER OLSON","MATTHEW LEFFINGWELL","JOHN GONZALEZ","JAMES HEIMBACH","DREW CANTOR","NIKOLE BURROUGHS"],"issues":["HCR","FOR","BUD","BAN",null],"sampleDescriptions":["global health issues, Global Fund, HIV/AIDS international programs, malaria programs","S. 2463 BUILD act of 2018 HR 5105.","150 account, U.S. foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Electrify Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs. Consolidated Appropriations act PL 115-161","150 account, U.S. foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Electrify Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs. Consolidated Appropriations act PL 115-161. House Fiscal Year 2019 State, Foreign Operations, and Related Programs Appropriations Legislation. Department of Defense Appropriations Act, 2019.","Global health issues, Global Fund, HIV/AIDS international programs, malaria programs","BUILD act of 2018 HR 5105, S. 2463. Nominations for the Millennium Challenge Corporation","150 account, U.S. foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Power Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs. Consolidated Appropriations act PL 115-161. House Fiscal Year 2019 State, Foreign Operations, and Related Programs Appropriations Legislation.","150 account, US foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Power Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs","Global Fragility Act (HR 2116, HR 1580, S 727)","S. 2563, the ILLICIT CASH Act","Special Drawing Rights at International Financial Institutions","Global health issues, Global Fund, HIV/AIDS international programs, malaria programs, S 3829, Global Health Security and Diplomacy Act, S. 368, Global Health, Empowerment and Rights Act","150 account, US foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Power Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs, HR 6800 HEROES Act and emergency supplemental appropriations for global health programs to address COVID-19 internationally","150 account, US foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Power Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs, H.R. 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act, the Health, Economic Assistance, Liability Protection, and Schools (HEALS) Act,  and emergency supplemental appropriations for global health programs to address COVID-19 internationally","Special Drawing Rights at International Monetary Fund","150 account, US foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Power Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs, H.R. 133 / PL 116-260 - FY2021 Omnibus and COVID Relief and Response Act,  and emergency supplemental appropriations for global health programs to address COVID-19 internationally","Global health funding and policy; Issues related to funding the global response to COVID-19 in the American Rescue Plan Act (PL 117-2).","Special Drawing Rights at International Monetary Fund.","150 account, US foreign assistance spending, including PEPFAR, Global Fund, Millenium Challenge Corporation, Power Africa, Overseas Private Investment Corporation, Feed the Future Nutrition programs, and emergency supplemental appropriations for global health programs to address COVID-19 internationally.","Global health funding and policy; Issues related to funding the global response to COVID-19 in the American Rescue Plan Act (PL 117-2); Issues related to global vaccine distribution."],"years":[2018,2019,2020,2021,2022,2023,2024]}