{"id":58882,"name":"OPAL FUELS INC.","slug":"opal-fuels-inc","state":"NY","description":"Biomethane capture and production of renewable electricity and renewable natural gas.","totalSpending":1210000,"filings":9,"yearlySpending":[{"year":2024,"income":300000},{"year":2025,"income":910000}],"firms":["K&L GATES, LLP"],"lobbyists":["MATTHEW LEGGETT","CLIFF ROTHENSTEIN","KARISHMA PAGE","ABIGAIL DINEGAR","MICHAEL EVANS","AMY CARNEVALE","RYAN CARNEY","LAUREN FLYNN","PAMELA GARVIE","BRENDAN LAWLOR","W STEPHENS","LAURIE PURPURO","SCOTT GELBMAN"],"issues":["ENV","TAX","ENG"],"sampleDescriptions":["Internal Revenue Code section 48 Investment Tax Credit (specifically the biogas property and common ownership issues); general education campaign on the beneficial use of Biomethane; eRINs provisions of the EPAs Renewable Fuels Standard.","General education on the beneficial use of biomethane; Internal Revenue Code section 48 Investment Tax Credit; and eRINs provisions of the Renewable Fuels Standard.","General education on the beneficial use of biomethane; general tax policy, including Internal Revenue Code section 48 Investment Tax Credit; general renewable fuels policy, including eRINs provisions and EPA proposed waiver of 2024 cellulosic biofuel volume requirement under Renewable Fuels Standard.","General education on the beneficial use of biomethane; renewable fuel standard policy, including proposed partial waiver of 2024 cellulosic biofuel volume requirement, renewable volume obligations, and additional pathways.","General education on the beneficial use of biomethane; general tax policy, including Internal Revenue Code Section 45Z; renewable fuel standard policy, including proposed partial waiver of 2024 cellulosic biofuel volume requirement, renewable volume obligations, and additional pathways.","General tax policy, including Internal Revenue Code Section 45Z.","General tax policy, including Internal Revenue Code Section 45Z - H.R. 1, One Big Beautiful Bill Act.","General education on the beneficial use of biomethane; renewable fuel standard policy, including Set 2 proposed rule and supplemental notice.","General education on the beneficial use of biomethane; 45ZCF-GREET Model.","General tax policy, including Internal Revenue Code Section 45Z - H.R. 1, One Big Beautiful Bill Act.; 45ZCF-GREET Model.","General education on the beneficial use of biomethane; biofuels policy, including renewable natural gas and renewable electricity; renewable fuel standard policy, including Set 2 proposed rule and Small Refinery Exemption supplemental notice.","General education on the beneficial use of biomethane; biofuels policy, including renewable natural gas and renewable electricity; renewable fuel standard policy; 45ZCF-GREET Model."],"years":[2024,2025]}