{"id":181149,"name":"ORANGE COUNTY TRANSPORTATION AUTHORITY","slug":"orange-county-transportation-authority","state":"CA","description":null,"totalSpending":1830000,"filings":30,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":270000}],"firms":["POTOMAC PARTNERS DC"],"lobbyists":["RICHARD ALCALDE","DANIEL FELIZ","ADAM CROSS"],"issues":["TAX","BUD","AVI","RRR","TRA",null],"sampleDescriptions":["Tax Extenders legislation; Alternative Fuel Tax Credit; Highway Trust Fund","FY19 Appropriations for DOT programs to include FTA's Capital Investment Grant Program","FAA rule making regarding aviations fuel taxes.","Passenger Rail issues.","Surface Transportation Authorization Implementation; transportation funding; transit issues and funding; tolling; passenger rail issues, infrastructure legislation.","Alternative  excise fuels tax credits, and aviation fuels tax issues.","Surface Transportation Authorization.","FY 2020 Appropriations and Budget.","Surface Transportation Authorization and Infrastructure Bill.","Airport transportation issues, aviation fuel tax issues.","Alternative fuels excise tax credits, and aviation fuels tax issues.","Surface Transportation Authorization and Rail Safety Legislation.","FY 2020 Appropriations and Budget (THUD).","Surface Transportation Authorization, CARES Act, and Infrastructure Bill.","FY 2021 Appropriations and Budget (THUD).","Surface Transportation Authorization, COVID relief legislation, and Infrastructure Bill.","FY 2021 Appropriations and Budget (THUD). Heroes Act funding.","FY 2021 Appropriations and Budget (THUD). HEALS and Heroes Act funding (and other COVID-19 relief legislation).","Transportation funding in the Consolidated Appropriations Act, 2021 (HR 133) and the American Rescue Plan Act of 2021 to include funding for the Capital Investment Grant (CIG) projects.","Surface Transportation Authorization and Rail Safety Legislation and funding for grants and rail projects at FRA."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}