{
  "id": 51960,
  "name": "OUSTER, INC.",
  "slug": "ouster-inc",
  "state": "CA",
  "description": "LIDAR technology company",
  "totalSpending": 2210000,
  "filings": 15,
  "yearlySpending": [
    {
      "year": 2022,
      "income": 450000
    },
    {
      "year": 2023,
      "income": 600000
    },
    {
      "year": 2024,
      "income": 600000
    },
    {
      "year": 2025,
      "income": 560000
    }
  ],
  "firms": [
    "HOLLAND & KNIGHT LLP"
  ],
  "lobbyists": [
    "JOEL ROBERSON",
    "NASIM FUSSELL",
    "THOMAS STORY",
    "LESLIE POLLNER",
    "NICOLE ELLIOTT",
    "DANIEL SENNOTT",
    "EMMA EKMAN",
    "MISHA LEHRER",
    "KATHRYN LEHMAN",
    "TODD WOOTEN",
    "DENNIS POTTER",
    "SAMANTHA REINSTEIN"
  ],
  "issues": [
    "TRD",
    null,
    "DEF"
  ],
  "sampleDescriptions": [
    "Issues pertaining to the import and export of light detection and ranging (LIDAR) sensors.",
    "Issues pertaining to the import and export of light detection and ranging (LIDAR) sensors; issues related to the national security and homeland security of LIDAR sensors.",
    "Issues pertaining to the national security and homeland security of light detection and ranging (LIDAR) sensors; the import and export of LIDAR sensors; federal spending on LIDAR sensors that have been determined to be a national security or homeland security risk.",
    "Issues pertaining to the national security and homeland security of light detection and ranging (LIDAR) sensors; the import and export of LIDAR sensors; federal spending on LIDAR sensors that have been determined to be a national security or homeland security risk; H.R. 9565, Securing Infrastructure from Adversaries Act; lidar language in the Fiscal Year 2025 Commerce-Justice Science Appropriation bill (H.R. 9026 and S. 4795) and the Transportation, Housing and Urban Development Appropriations bill (H.R. 9028 and S. 4796).",
    "National security issues pertaining to light detection and ranging (LIDAR) sensors; LIDAR provisions in the Defense Appropriations bill (H.R. 8774 and S. 4921); LIDAR provisions in the Fiscal Year 2025 National Defense Authorization Act (H.R. 8070 and S. 4638.",
    "Issues pertaining to the national security and homeland security of light detection and ranging (LIDAR) sensors; the import and export of LIDAR sensors; federal spending on LIDAR sensors that have been determined to be a national security or homeland security risk; H.R. 9565, Securing Infrastructure from Adversaries Act; LIDAR language in the Fiscal Year 2025 Commerce-Justice Science Appropriation bill (H.R. 9026 and S. 4795) and the Transportation, Housing and Urban Development Appropriations bill (H.R. 9028 and S. 4796).",
    "National security issues pertaining to light detection and ranging (LIDAR) sensors; LIDAR provisions in the Defense Appropriations bill (H.R. 8774 and S. 4921); LIDAR provisions in the Fiscal Year 2025 National Defense Authorization Act (Public Law 118-159).",
    "Issues pertaining to the national security, homeland security, import and export of light detection and ranging (LiDAR) sensors; federal spending on LiDAR sensors that have been determined to be a national security or homeland security risk; Securing Infrastructure from Adversaries Act; LiDAR language in the Fiscal Year 2026 Commerce-Justice Science Appropriation bill and the Fiscal Year 2026 Transportation, Housing and Urban Development Appropriations bill.",
    "National security issues pertaining to light detection and ranging (LiDAR) sensors; LiDAR provisions in the Fiscal Year 2026 National Defense Authorization Act.",
    "National security issues pertaining to light detection and ranging (LiDAR) sensors; LiDAR provisions in the Fiscal Year 2026 National Defense Authorization Act (H.R. 3838 and S. 2296).",
    "Issues pertaining to the national security, homeland security, import and export of light detection and ranging (LiDAR) sensors; federal spending on LiDAR sensors that have been determined to be a national security or homeland security risk; Securing Infrastructure from Adversaries Act (H.R. 4802); LiDAR language in the Fiscal Year 2026 Commerce-Justice Science Appropriation bills (H.R. 5342; S. 2354) and the Fiscal Year 2026 Transportation, Housing and Urban Development Appropriations bills (H.R. 4552; S. 2465); surface transportation reauthorization."
  ],
  "years": [
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 24,
  "trajectory": "stable",
  "yearsActive": 4,
  "avgAnnualSpending": 552500,
  "peakYear": 2023,
  "lobbyistCount": 12,
  "firmCount": 1,
  "issueCount": 2
}