{"id":176452,"name":"PEDIATRIX MEDICAL GROUP (MEDNAX NATIONAL MEDICAL GROUP)","slug":"pediatrix-medical-group-mednax-national-medical-group","state":"FL","description":"National medical provider of neonatal, pediatric, and anesthesiology physician services.","totalSpending":1160000,"filings":25,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":160000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":130000}],"firms":["THE MCMANUS GROUP"],"lobbyists":["JOHN MCMANUS","BARRETT THORNHILL","CHRISTINA HOCHUL","ALANNA TEMME","WILLIAM RHYNE"],"issues":["HCR","VET","MMM"],"sampleDescriptions":["Support for H.R. 2662 / S. 1250 - Restoring Accountability in the Indian Health Services Act of 2017.","Expanding Veterans Health Administration coverage to non-employed physicians. Support for H.R. 5674 VA Mission Act of 2018.","Physician access to Indian Health Services.","Expanding Veterans Health Administration coverage to non-employed physicians.","Surprise Billing Reform.","Support for surprise billing reform, including H.R. 3502, to amend the Public Health Service Act and title XI of the Social Security Act to protect health care consumers from surprise billing practices, and for other purposes; H.R. 3630, the No Surprises Act; S. 1895, the Lower Health Care Costs Act; and S. 1531, the Stopping The Outrageous Practice of Surprise Medical Bills Act of 2019.","Support for surprise billing reform, including S. 1895, the Lower Health Care Costs Act, and H.R. 3630, the No Surprises Act.","Surprise billing reform, including S. 1895, the Lower Health Care Costs Act, and H.R. 3630, the No Surprises Act.","Implementation of the Public Health and Social Services Emergency Fund in H.R. 748.","Surprise billing reform, including S. 1895, the Lower Health Care Costs Act, H.R. 3630, the No Surprises Act, H.R. 5826, the Consumer Protections Against Surprise Medical Bills Act, and H.R. 5800, the Ban Surprise Bills Act. S. 3559/H.R. 6365, the Immediate Relief for Rural Facilities and Providers Act of 2020. Insurance contract issues in the private market.","Surprise billing reform, including S. 1895, the Lower Health Care Costs Act, H.R. 3630, the No Surprises Act, H.R. 5826, the Consumer Protections Against Surprise Medical Bills Act, and H.R. 5800, the Ban Surprise Bills Act. Insurance contract issues in the private market. \n\nCoronavirus relief legislation, including H.R. 6800, the Heroes Act, and S. 4317, the Safe to Work Act.","CY 2021 Payment Policies Under the Physician Fee Schedule and Other Changes to Part B Payment Policies proposed rule (85 FR 50074).\n\nImplementation of Public Law 116-136.","Surprise billing reform including in Division BB, Title I of H.R. 133 - Consolidated Appropriations Act, 2021.","CY 2021 Payment Policies Under the Physician Fee Schedule and Other Changes to Part B Payment Policies proposed rule (85 FR 50074).\n\nImplementation of Public Law 116-136. \n\nMedicaid cuts in H.R. 8702/S. 5007 - Holding Providers Harmless From Medicare Cuts During COVID-19 Act of 2020, and Division CC and Division N Sec. 101 of H.R. 133. The Consolidated Appropriations Act of 2020.","Implementation of Surprise billing reform including in Division BB, Title I of H.R. 133 - Consolidated Appropriations Act, 2021.","Implementation of Surprise billing reform including in Division BB, Title I of H.R. 133 - Consolidated Appropriations Act, 2021.\n\nIssues related to potential patient disruptions caused by contract terminations with insurers.","Implementation of surprise billing reform including in Division BB, Title I of H.R. 133 - Consolidated Appropriations Act, 2021 and CMS-9909-IFC and CMS-9908-IFC.\n\nIssues related to potential patient disruptions caused by contract terminations with insurers.","Implementation of surprise billing reform including in Division BB, Title I of H.R. 133 - Consolidated Appropriations Act, 2021 and CMS-9909-IFC and CMS-9908-IFC.","Implementation of provisions included in Subtitle BB of PL. 116-260 - No Surprises Act.","Implementation of provisions included in Subtitle BB of PL. 116-260 - No Surprises Act. Issues relating to access to and quality of infant formula. Issues related to maternal care deserts."],"years":[2018,2019,2020,2021,2022,2024,2025]}