{"id":179392,"name":"PFS INVESTMENTS, INC.","slug":"pfs-investments-inc","state":"GA","description":"financial education, services, and products","totalSpending":1920000,"filings":32,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["MINDSET ADVOCACY, LLC"],"lobbyists":["BRANT IMPERATORE","WILLIAM MUELLER","GREG MCILVAINE","BRIDGET HAGAN","CHARLIE SCHREIBER","ZACHARY OSTRO","DOUGLAS LEE","SCOTT SHEWCRAFT","REBECCA ALCORN"],"issues":["FIN","RET","INS","LBR","TAX","CSP",null],"sampleDescriptions":["PL 111-203, Dodd-Frank Wall Street Reform and Consumer Projection Act, Title IX, Section 913, Securities and Exchange Commission study and rulemaking regarding obligations of brokers, dealers, and investment advisors.","Department of Labor final rule to change the definition of fiduciary under the Employee Retirement Income Security Act - Conflict of Interest Rule (RIN 1210-AB32); Definition of the Term \"Fiduciary\"; Conflict of Interest Rule-Retirement Investment Advice; Best Interest Contract Exemption (Prohibited Transaction Exemption 2016-01); Class Exemption for Principal Transactions in Certain Assets Between Investment Advice Fiduciaries and Employee Benefit Plans and IRAs (Prohibited Transaction Exemption 2016-02); Prohibited Transaction Exemptions  75-1, 77-4, 80-83, 83-1, 84-24, and 86-128 (RIN 1210-AB79);  H.R. 2823/S/1321 - Affordable Retirement Advice for Savers Act; H.R. 3857 - PASS Act of 2017","PL 111-203, Dodd-Frank Wall Street Reform and Consumer Projection Act, Title IX, Section 913, Securities and Exchange Commission study and rulemaking regarding obligations of brokers, dealers, and investment advisors, SEC Reg. Best Interest","H.R. 6743, Consumer Information Notification Requirement Act, establishing a federal data security standard for financial firms.","U.S. Securities and Exchange Commission (SEC) proposed rule to establish a best interest standard for broker-dealers making recommendations to retail customers (RIN 3235-AM35); U.S. SEC proposed rule to require registered investment advisers and registered broker-dealers to provide a relationship summary to retail investors (RIN 3235-AL27); U.S. SEC proposed interpretation of the standard of conduct for investment advisers under the Investment Advisers Act of 1940 (RIN 3235-AM36)","Federal standards related to data security, privacy and use.","U.S. Securities and Exchange Commission (SEC) proposed rule to establish a best interest standard for broker-dealers making recommendations to retail customers (RIN 3235-AM35); U.S. SEC proposed rule to require registered investment advisers and registered broker-dealers to provide a relationship summary to retail investors (RIN 3235-AL27); U.S. SEC proposed interpretation of the standard of conduct for investment advisers under the Investment Advisers Act of 1940 (RIN 3235-AM36); H.R. 1815, SEC Disclosure Effectiveness Testing Act","U.S. Securities and Exchange Commission (SEC) proposed rule to establish a best interest standard for broker-dealers making recommendations to retail customers (RIN 3235-AM35); \n\nU.S. SEC proposed rule to require registered investment advisers and registered broker-dealers to provide a relationship summary to retail investors (RIN 3235-AL27); \n\nU.S. SEC proposed interpretation of the standard of conduct for investment advisers under the Investment Advisers Act of 1940 (RIN 3235-AM36);\n\nProposed rulemaking on fiduciary rule and prohibited transaction exemptions (RIN 1210-AB82); \n\nHR 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019 Sec. 401, Modification of Required Distribution\nrules for designated beneficiaries","H.R. 2474, Protecting the Right to Organize Act, provisions related to promoting workers entrepreneurial freedom (Sec. 4(a)(2)).","U.S. Securities and Exchange Commission (SEC) final rule to establish a best interest standard for broker-dealers making recommendations to retail customers (RIN 3235-AM35); \nU.S. SEC final rule to require registered investment advisers and registered broker-dealers to provide a relationship summary to retail investors (RIN 3235-AL27); \nU.S. SEC final interpretation of the standard of conduct for investment advisers under the Investment Advisers Act of 1940 (RIN 3235-AM36).","U.S. Securities and Exchange Commission (SEC) final rule to establish a best interest standard for broker-dealers making recommendations to retail customers (RIN 3235-AM35); \nU.S. SEC final rule to require registered investment advisers and registered broker-dealers to provide a relationship summary to retail investors (RIN 3235-AL27); \nU.S. SEC final interpretation of the standard of conduct for investment advisers under the Investment Advisers Act of 1940 (RIN 3235-AM36); \nProposed rulemaking on fiduciary rule and prohibited transaction exemptions (RIN 1210-AB82); \nHR 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019 Sec. 401, Modification of Required Distribution rules for designated beneficiaries.","S. 2968, the Consumer Online Privacy Rights Act; Draft United State Consumer Data Privacy Act of 2019; provisions related to sharing of data and the use of data in insurance underwriting.","HR 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019 Sec. 401, Modification of Required Distribution rules for designated beneficiaries.","Public Law No: 116-136, the Coronavirus Aid, Relief, and Economic Security Act; Sec. 2301, Employee Retention Credit for Employers Subject to Closure due to COVID-19; Sec. 2303, Modification of Net Operating Losses; Sec. 2305, Modification of Credit for Prior Year Minimum Tax Liability of Corporations; Sec. 2306, Modification of Limitation on Business Interest; Sec. 2307, Technical Amendments Regarding Qualified Improvement Property","S. 2968, the Consumer Online Privacy Rights Act; Draft United States Consumer Data Privacy Act of 2019; provisions related to sharing of data and the use of data in insurance underwriting","HR 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019 Sec. 401, Modification of Required Distribution rules for designated beneficiaries. Public Law No: 116-136, the Coronavirus Aid, Relief, and Economic Security Act; Sec. 2202-2203, provisions related to retirement accounts.","H.R. 2474, Protecting the Right to Organize Act, provisions related to workers entrepreneurial freedom (Sec. 4(a)(2)). Public Law No: 116-136, the Coronavirus Aid, Relief, and Economic Security Act; Sec. 2202-2203, Sec. 1102, the Paycheck Protection Program; Secs.2102 & 2104, provisions relating to unemployment benefits; other provisions related to employee and worker benefits. Public Law No: 116-127, the Families First Coronavirus Response Act; Sec. 3102, Amendments to the Family and Medical Leave Act of 1993; Sec. 5102, Paid Sick Time Requirement; other provisions related to paid sick and paid family & medical leave programs.","S. 2968, the Consumer Online Privacy Rights Act; Draft United States Consumer Data Privacy Act of 2019, provisions related to sharing of data and the use of data in insurance underwriting; U.S. Securities and Exchange Commission (SEC) final rule to establish a best interest standard for broker-dealers making recommendations to retail customers (RIN 3235-AM35); U.S. SEC final rule to require registered investment advisers and registered broker- dealers to provide a relationship summary to retail investors (RIN 3235-AL27); U.S. SEC final interpretation of the standard of conduct for investment advisers under the Investment Advisers Act of 1940 (RIN 3235-AM36).","Public Law No: 116-136, the Coronavirus Aid, Relief, and Economic Security Act, Sec. 2301, Employee Retention Credit for Employers Subject to Closure due to COVID-19, Sec. 2303, Modification of Net Operating Losses, Sec. 2305, Modification of Credit for Prior Year Minimum Tax Liability of Corporations, Sec. 2306, Modification of Limitation on Business Interest, Sec. 2307, Technical Amendments Regarding Qualified Improvement Property.","HR 1994, the Setting Every Community Up for Retirement Enhancement Act of 2019, Sec. 401, Modification of Required Distribution rules for designated beneficiaries; Public Law No: 116-136, the Coronavirus Aid, Relief, and Economic Security Act, Sec. 2202-2203, provisions related to retirement accounts; DOL RIN 1210-AB96, Conflict of Interest Rule-Retirement Investment Advice: Notice of Court Vacatur; DOL RIN 2020-14261, Improving Investment Advice for Workers & Retirees."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}