{"id":162785,"name":"PHARMACEUTICAL PRINTED LITERATURE ASSOCIATION","slug":"pharmaceutical-printed-literature-association","state":"IL","description":"Trade Association","totalSpending":1180000,"filings":23,"yearlySpending":[{"year":2018,"income":60000},{"year":2019,"income":100000},{"year":2020,"income":180000},{"year":2021,"income":200000},{"year":2022,"income":150000},{"year":2024,"income":190000},{"year":2025,"income":300000}],"firms":["VENN STRATEGIES"],"lobbyists":["ERIK OLSON","MICHAEL SPIRA","MICHELLE SEGER","PETER GOELZ","BRIDGET ANSHUS","KELLY FERGUSON","JOHN RICHTER","TAHARVIS ROSS","JAKARA EASON","ALLISON EVERTON","BROOKE WILLIS"],"issues":["HCR","BUD","DEF"],"sampleDescriptions":["Promoting continued access to pharmaceutical printed packaging information.","Promotion of legislative language within H.R. 3164, the agriculture, Rural Development, Food and Drug Administration, and Related agencies appropriations Act, 2020, to eliminate funding to complete regulations that would create an e-labeling standard for pharmaceutical packaging information.","Promotion of legislative language within H.R. 2500, the National Defense Authorization Act of 2020, to ensure that prescription drugs made available to Department of Defense military treatment facilities include labels that are printed and physically accompany the package from which the drug is to be dispensed and such label provides adequate directions for use of such drug.","Promoting continued access to pharmaceutical printed packaging information, including promotion for H.R. 5198, Patients' Right to Know Their Medication Act of 2019.","Promoting continued access to pharmaceutical printed packaging information, including promotion for H.R. 5198, Patients' Right to Know Their Medication Act of 2019 and monitoring H.R. 7614 the FY21 Labor-HHS-Education Appropriations Bill.","Promoting continued access to pharmaceutical printed packaging information, including promotion for the Patients' Right to Know Their Medication Act.","Promoting continued access to pharmaceutical printed packaging information, including promotion for H.R. 6519, the Patients' Right to Know Their Medication Act of 2022.","Educating offices about paper labeling in FDA appropriations.","Promoting continued access to pharmaceutical printed packaging information, including promotion for H.R. 1173, the Patients' Right to Know Their Medication Act of 2023, and H.R. 1503, and FDA's proposed PMI rule.","Promoting continued access to pharmaceutical printed packaging information, including promotion for H.R. 1173, the Patients' Right to Know Their Medication Act of 2023, and FDA's proposed PMI rule.","Promoting continued access to pharmaceutical printed packaging information, including promotion for the Patients' Right to Know Their Medication Act, and FDA's proposed PMI rule."],"years":[2018,2019,2020,2021,2022,2024,2025]}