{"id":196261,"name":"PHARMACEUTICAL RESEARCH AND MANUFACTURERS OF AMERICA (PHRMA)","slug":"pharmaceutical-research-and-manufacturers-of-america-phrma","state":"DC","description":"trade group representing U.S. pharmaceutical research and biotechnology companies","totalSpending":1190000,"filings":25,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":150000},{"year":2022,"income":160000},{"year":2024,"income":120000},{"year":2025,"income":100000}],"firms":["DESIMONE CONSULTING, LLC"],"lobbyists":["RICK DESIMONE"],"issues":["ECN","MMM","TRD","SCI","MED","PHA"],"sampleDescriptions":["Issues related to the impact of the bio-pharmaceutical industry on the economy.","Issues related to policy changes to Medicare Part B & D.","Issues related to intellectual property protections in foreign trade agreements.","Issues related to the development of new medical therapies.","Issues related to access to medicines and other medical therapies, the development of new medical therapies and regulatory matters regarding the biopharmaceutical industry.","Issues related to the development of new medical therapies including patient access and pricing; H.R.6201, Families First Coronavirus Response Act (P.L.116-127); H.R.748, CARES Act (P.L.116-136).","Issues related to the impact of the bio-pharmaceutical industry on the economy; H.R.748, CARES Act (P.L.116-136).","Issues related to access to medicines and other medical therapies, the development of new medical therapies, pharmaceutical supply chain and regulatory matters regarding the biopharmaceutical industry.","Issues related to the development of new medical therapies including patient access and pricing.","Issues related to policy changes to Medicare Part D.","Issues related to patient access and pricing.\nIssues related to policy changes to Medicare Part D.","Issues related to patient access and pricing; Issues related to policy changes to Medicare Part D; PDUFA Reauthorization; FY2022 Budget Reconciliation (H.R.5376).","Issues related to patient access and pricing; Issues related to policy changes to Medicare Part D; Issues related to PBM reform; PDUFA Reauthorization, H.R.7667, Food and Drug Amendments of 2022, S.4348, FDASLA Act of 2022; FY2022 Budget Reconciliation (H.R.5376).","Issues related to patient access and pricing; Issues related to policy changes to Medicare Part D; Issues related to PBM reform; PDUFA Reauthorization, H.R.7667, Food and Drug Amendments of 2022, S.4348, FDASLA Act of 2022; FY2022 Budget Reconciliation (H.R.5376); H.R.6833, Making continuing appropriations for fiscal year 2023, and for other purposes.","Issues related to patient access and pricing. Issues related to policy changes to Medicare Part D. Issues related to PBM reform. Issues related to antimicrobial resistance policy; S.2076, PASTEUR Act of 2021. Issues related to user fee reauthorization; H.R.7667, Food and Drug Amendments of 2022; S.4348, FDASLA Act of 2022; H.R.2617, Consolidated Appropriations Act, 2023.","Issues related to patient access and pricing. Issues related to policy changes to Medicare Part D. Issues related to PBM reform; H.R. 2880, Protecting Patients Against PBM Abuses Act and H.R.5376, Share the Savings with Seniors Act. Issues related to 340B reform. Issues related to the Ensuring Pathways to Innovative Cures (EPIC) Act, H.R.7174.","Issues related to patient access and pricing. Issues related to policy changes to Medicare Part D. Issues related to PBM reform; H.R. 2880, Protecting Patients Against PBM Abuses Act and H.R.5376, Share the Savings with Seniors Act. Issues related to 340B reform; H.R.8574, To amend the Public Health Service Act to reform the 340B drug pricing program, and for other purposes. Issues related to the Ensuring Pathways to Innovative Cures (EPIC) Act, H.R.7174.","Issues related to patient access and pricing. Issues related to policy changes to Medicare Part D. Issues related to PBM reform; H.R.2880, Protecting Patients Against PBM Abuses Act; H.R.5376, Share the Savings with Seniors Act; H.R.10445, Further Continuing Appropriations and Disaster Relief Supplemental Appropriations Act, 2025; H.R.10545, American Relief Act, 2025. Issues related to 340B reform; H.R.8574, To amend the Public Health Service Act to reform the 340B drug pricing program, and for other purposes. Issues related to the Ensuring Pathways to Innovative Cures (EPIC) Act, H.R.7174.","Issues related to patient access and pricing. Issues related to policy changes to Medicare Part D. Issues related to 340B reform. Issues related to the EPIC (Ensuring Pathways to Innovative Cures) Act, H.R.1492/S.832.","Issues related to patient access and pricing. Issues related to policy changes to Medicare Part D. Issues related to 340B reform. Issues related to the EPIC (Ensuring Pathways to Innovative Cures) Act, H.R.1492/S.832. Most Favored Nation (MFN) policy activity related to the reconciliation process, H.R.1, One Big Beautiful Bill Act."],"years":[2018,2019,2020,2021,2022,2024,2025]}