{
  "id": 185398,
  "name": "PHRMA",
  "slug": "phrma",
  "state": "DC",
  "description": null,
  "totalSpending": 2700000,
  "filings": 27,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 150000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 50000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "HORIZON GOVERNMENT AFFAIRS"
  ],
  "lobbyists": [
    "JOEL WHITE",
    "AMANDA KRZEPICKI",
    "MICHAEL PIERCE"
  ],
  "issues": [
    "HCR",
    null
  ],
  "sampleDescriptions": [
    "IPAB, Budget, 340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D rebates, Importation of drugs",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D rebates, Importation of drugs, Drug pricing, LIS Copays.",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D rebates, Importation of drugs, Drug pricing.",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D rebates, Importation of drugs, Drug pricing, Coronavirus issues.",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D Rebates, Importation of Drugs, Drug Pricing, Coronavirus Issues.",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D Rebates, Importation of Drugs, Drug Pricing, Coronavirus Issues, Build Back Better legislation, TRIPs Waiver",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D Rebates, Importation of Drugs, Drug Pricing, Coronavirus Issues, Build Back Better legislation, TRIPs Waiver, FDA reauthorization legislation",
    "340B, Medicare Part D, Medicare Part B Issues, Medicare non-interference, Medicare Part D Rebates, Importation of Drugs, Drug Pricing, Coronavirus Issues, Inflation Reduction Act, TRIPs Waiver, FDA reauthorization legislation",
    "340B, Medicare Part D, Medicare Part B Issues, Importation of Drugs, Drug Pricing, Coronavirus Issues, Inflation Reduction Act, TRIPs Waiver, insurance coverage issues and Inflation Reduction Act implementation, March-in rights - Biden Administration announcement, HR 5378-Lower Costs, More Transparency Act; S.2973-Modernizing and Ensuring PBM Accountability Act, HR 7174, The EPIC Act.",
    "340B, Medicare Part D, Medicare Part B Issues, Importation of Drugs, Drug Pricing, Coronavirus Issues, Inflation Reduction Act, TRIPs Waiver, insurance coverage issues and Inflation Reduction Act implementation, March-in rights - Biden Administration announcement, HR 5378-LowerCosts, More Transparency Act; S.2973-Modernizing and Ensuring PBM Accountability Act, HR 7174, The EPIC Act.",
    "340B issues, Medicare Part D, Medicare Part B Issues, Importation of Drugs, Drug Pricing, Inflation Reduction Act, Insurance coverage issues related to prescription drugs; H.R. 1, the One Big Beautiful Bill Act; H.R. 1492, S. 832, the EPIC Act; Most Favored Nation Drug Pricing; Medicare IRA implementation, Drug Premium Stabilization Program."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 168750,
  "peakYear": 2018,
  "lobbyistCount": 3,
  "firmCount": 1,
  "issueCount": 1
}