{"id":184585,"name":"PHYSICIAN-LED HEALTHCARE FOR AMERICA (FORMERLY PHYSICIAN HOSPITALS OF AMERICA)","slug":"physician-led-healthcare-for-america-formerly-physician-hospitals-of-america","state":"DC","description":"Association of physician-owned hospitals.","totalSpending":1230000,"filings":25,"yearlySpending":[{"year":2018,"income":170000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":110000}],"firms":["CAPITOL COUNSEL LLC"],"lobbyists":["AARON COHEN","DENISE HENRY MORRISEY","MARTIN GOLD","STACIE AMAN","SHANNON FINLEY","CHARLES FRENCH","LUKE HATZIS","ANN JABLON","JAMES MCCRERY","CAITLIN CANTER","JEFFERY WALTER","JEFFREY CARROLL","ETHAN PITTLEMAN","SARA FRANKO","MICHELLE MATHY","NICK BOUKNIGHT"],"issues":["MMM"],"sampleDescriptions":["Repeal Section 6001 of the Affordable Care Act which prohibits expansion of physician-owned hospitals, including related provisions in H.R. 1628, the American Health Care Act, and proposed Senate substitute amendments, including the Health Care Freedom Act and Senators Graham and Cassidy proposed block grant substitute amendment; and related provisions in H.R. 1156 and S. 1133, the Patient Access to Higher Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exemption on the prohibition on certain physician referrals for hospitals.","Repeal Section 6001 of the Affordable Care Act which prohibits expansion of physician-owned hospitals, including related provisions in H.R. 1156 and S. 1133, the Patient Access to Higher Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exemption on the prohibition on certain physician referrals for hospitals; and the House report for H.R. 6470, the Labor/HHS/Education appropriations bill for FY 2019.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals, and Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals, and Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals, including related provisions in H.R. 3062 and S. 2860, the Patient Access to High Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exception to the prohibition on certain physician referrals for hospitals.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals, and Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals, including related provisions in H.R. 3062 and S. 2860, the Patient Access to High Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exception to the prohibition on certain physician referrals for hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including related provisions in: (1) H.R. 6074, the Coronavirus Preparedness and Response Supplemental Appropriations Act; (2) H.R. 6201, the Families First Coronavirus Response Act; and (3) H.R. 748, the Coronavirus Aid, Relief, and Economic Security Act.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals, and Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals, including related provisions in H.R. 3062 and S. 2860, the Patient Access to High Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exception to the prohibition on certain physician referrals for hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including related provisions in H.R. 6800, the HEROES Act.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals, and Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals, including related provisions in H.R. 3062 and S. 2860, the Patient Access to High Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exception to the prohibition on certain physician referrals for hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including related provisions in H.R. 6800, the HEROES Act; H.R. 8406, the Heroes Act; S. 4318, the American Workers, Families, and Employers Assistance Act; S. 4320, the Coronavirus Response Additional Supplemental Appropriations Act, 2020; and S. 4322, the Safely Back to School and Back to Work Act.","Repeal Section 6001 of the Affordable Care Act; section 6001 prohibits expansion of physician-owned hospitals, and Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals, including related provisions in H.R. 3062 and S. 2860, the Patient Access to High Quality Health Care Act, to repeal changes made by health care reform laws to the Medicare exception to the prohibition on certain physician referrals for hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including related provisions in H.R. 6800, the HEROES Act; H.R. 8406, the Heroes Act; S. 4318, the American Workers, Families, and Employers Assistance Act; S. 4320, the Coronavirus Response Additional Supplemental Appropriations Act, 2020; S. 4322, the Safely Back to School and Back to Work Act; and H.R. 133, the Consolidated Appropriations Act, 2021 - P.L. 116-260.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-owned hospitals, including related provisions in H.R. 1330, the Patient Access to Higher Quality Care Act; and related issues regarding hospital competition and consolidation.\n\nCenter for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals.\n\nCoronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including implementation of related provisions in H.R. 1319, the American Rescue Plan Act, P.L. 117-2, S. 748, the Medicare Sequester Relief Act, and H.R. 315, the Medicare Sequestration COVID Moratorium Act.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-owned hospitals, including related provisions in H.R. 1330, the Patient Access to Higher Quality Care Act; and related issues regarding hospital competition and consolidation.\n\nCenter for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals.\n\nCoronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including implementation of related provisions in H.R. 1319, the American Rescue Plan Act, P.L. 117-2.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-owned hospitals, including related provisions in H.R. 1330, the Patient Access to Higher Quality Care Act; and related issues regarding hospital competition and consolidation. Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including implementation of related provisions in H.R. 1319, the American Rescue Plan Act, P.L. 117-2.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-owned hospitals, including related provisions in H.R. 1330, the Patient Access to Higher Quality Care Act of 2021, and S. 4130, the Patient Access to Higher Quality Care Act of 2022; and related issues regarding hospital competition and consolidation. Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-owned hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-owned hospitals to respond to COVID-19, including implementation of related provisions in H.R. 1319, the American Rescue Plan Act, P.L. 117-2.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-led hospitals, including related provisions in H.R. 1330, the Patient Access to Higher Quality Care Act of 2021, and S. 4130, the Patient Access to Higher Quality Care Act of 2022; and related issues regarding hospital competition and consolidation. Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-led hospitals. Coronavirus response efforts, including support for health care providers, patients and small business, and enable physician-led hospitals to respond to COVID-19, including implementation of related provisions in H.R. 1319, the American Rescue Plan Act, P.L. 117-2.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-led hospitals - including related provisions in H.R. 977/S. 470, the Patient Access to Higher Quality Care Act; and in Draft Legislation by Rep. Burgess to amend title XVIII of the Social Security Act to revise certain physician self-referral exemptions relating to physician-owned hospitals in rural areas; and related issues regarding hospital competition and consolidation. Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-led hospitals. Reform Medicare Advantage prior authorization, including related provisions in the GOLD Card Act, H.R. 4968; H.R. 4822, the Health Care Price Transparency Act - including requirements for Medicare Advantage electronic prior authorization and real-time decisions; and prior authorization transparency provisions in H.R. 4822, and H.R. 5378, the Lower Costs, More Transparency Act.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-led hospitals - including related provisions in H.R. 977/S. 470, the Patient Access to Higher Quality Care Act; and in Draft Legislation by Rep. Burgess to amend title XVIII of the Social Security Act to revise certain physician self-referral exemptions relating to physician-owned hospitals in rural areas; and related issues regarding hospital competition and consolidation. Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-led hospitals. Reform Medicare Advantage prior authorization, including related provisions in: H.R. 4968, the GOLD Card Act; H.R. 4822, the Health Care Price Transparency Act; H.R. 5378, the Lower Costs, More Transparency Act; and S. 4518/S. 4532/H.R. 8702, to establish requirements with respect to the use of prior authorization under Medicare Advantage plans.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-led hospitals - including related provisions in H.R. 977/S. 470, the Patient Access to Higher Quality Care Act; and in H.R. 9001, the Physician Led and Rural Access to Quality Care Act, to revise certain physician self-referral exemptions relating to physician-owned hospitals in rural areas; and related issues regarding hospital competition and consolidation. Center for Medicare & Medicaid Innovation demonstration to expand patient access to physician-led hospitals. Reform Medicare Advantage prior authorization, including related provisions in: H.R. 4968, the GOLD Card Act; H.R. 4822, the Health Care Price Transparency Act; H.R. 5378, the Lower Costs, More Transparency Act; and S. 4518/S. 4532/H.R. 8702, to establish requirements with respect to the use of prior authorization under Medicare Advantage plans. Advocacy related to H.R. 8246, Second Chances for Rural Hospitals Act, and access to physician-led entities.","Repeal Section 6001 of the Affordable Care Act - section 6001 prohibits expansion of physician-led hospitals - including related provisions in H.R. 2191. Issues regarding CMMI demonstration and Medicare 2-2-2 policy."],"years":[2018,2019,2020,2021,2022,2024,2025]}