{"id":101096,"name":"PMI US CORPORATE SERVICES INC. (FKA PMI GLOBAL SERVICES INC.)","slug":"pmi-us-corporate-services-inc-fka-pmi-global-services-inc","state":"DC","description":"Service company for Philip Morris International (PMI), an international tobacco company","totalSpending":3730000,"filings":30,"yearlySpending":[{"year":2018,"income":400000},{"year":2019,"income":700000},{"year":2020,"income":560000},{"year":2021,"income":810000},{"year":2022,"income":440000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":340000}],"firms":["AKIN GUMP STRAUSS HAUER & FELD"],"lobbyists":["JAMES TUCKER","JOHN GILLILAND","VIC FAZIO","GEOFF VERHOFF","ED PAGANO","VALERIE WHITE","FRANCINE FRIEDMAN","CHARLIE JOHNSON","ILEANA ROS-LEHTINEN","CHRISTINA HALEY","STEPHEN KHO","ZACHARY PAULSEN"],"issues":["FOR","TOB","HOM","CPT",null,"TRD"],"sampleDescriptions":["Issues related to international organizations.","Discussions related to modified risk tobacco products.","Issues related to international organizations; discussions concerning U.S. policy guidance provided to executive branch personnel.","Discussion related to modified risk tobacco products.","Discussions related to modified risk products.","Issues related to international organizations; discussions concerning U.S. policy guidance provided to executive branch personnel; Combating Illicit Trade in Tobacco Products Act (H.R. 1642).","Combating Illicit Trade in Tobacco Products Act (H.R. 1642/S. 1965)","Education related to reduced risk tobacco products; Federal authorization of marketing of a modified risk tobacco product.","Issues related to international organizations discussions concerning U.S. policy guidance provided to executive branch personnel.  Education related to reduced risk tobacco products.","Issues related to international organizations.; Discussions concerning U.S. policy guidance provided to executive branch personnel; Education related to reduced risk tobacco product.","Education related to reduced risk tobacco products;\nFederal authorization of marketing of a modified risk tobacco product.","Issues related to international organizations.\nDiscussions concerning U.S. policy guidance provided to executive branch personnel.\nEducation related to reduced risk tobacco product.","Educate officials regarding matters at the U.S. International Trade Commission.","Issues related to international organizations; Discussions concerning U.S. policy guidance provided to executive branch personnel; Education related to reduced risk tobacco product.","Issues related to international organizations.; Discussions concerning U.S. policy guidance provided to executive branch personnel.; Education related to reduced risk tobacco product.","Issues related to international organizations. Discussions concerning U.S. policy guidance provided to executive branch personnel. Education related to reduced risk tobacco product.","Education related to reduced risk tobacco products and FDA review of same.","Education related to reduced risk tobacco products and foreign market access issues.","Education related to reduced risk tobacco products.","Discussions related to implementation of Family Smoking Prevention and Tobacco Control Act (P.L. 111-31); Discussions related to tobacco harm reduction and reduced risk products; Discussions related to enforcement of illicit tobacco products, including importation of counterfeit products; Discussions related to efforts to prevent youth access to tobacco products."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}