{"id":145050,"name":"PRAIRIE ISLAND INDIAN COMMUNITY","slug":"prairie-island-indian-community","state":"MN","description":"Tribal government.","totalSpending":1210000,"filings":26,"yearlySpending":[{"year":2018,"income":190000},{"year":2019,"income":290000},{"year":2020,"income":270000},{"year":2021,"income":40000},{"year":2022,"income":110000},{"year":2024,"income":140000},{"year":2025,"income":170000}],"firms":["DENTONS US LLP"],"lobbyists":["HEATHER SIBBISON","JOHN BEZDEK","JOHN RUSSELL","VALERIE NELSON","SAMUEL DAUGHETY","ROSE PETOSKEY","NATASHA JOHN","SUZANNE SCHAEFFER","MITCHELL FORBES","MAURISA BELL","STEPHANIE SFIRIDIS","CATELIN AIWOHI"],"issues":["IND"],"sampleDescriptions":["General tribal affairs policy issues; fee-to-trust issues.","General tribal affairs policy issues; fee-to-trust issues","General tribal affairs policy issues; fee-to-trust issues; COVID-19 relief; CARES Act;","General tribal affairs policy issues; fee-to-trust issues; Any legislation regarding response to COVID-19;","General tribal affairs policy issues; fee-to-trust issues; Any legislation regarding response to COVID-19; COVID Relief funding package;","General tribal affairs policy issues; fee-to-trust issues; Any legislation regarding response to COVID-19; American Recovery Act of 2021;  Infrastructure proposals and FY22 Appropriations.","General tribal affairs policy issues; fee-to-trust issues; Any legislation regarding response to COVID-19; American Recovery Act of 2021; Implementation of Infrastructure legislation; Final Omnibus Appropriations bill for FY22; Community Projects in FY 23 Appropriations.","General tribal affairs policy issues; fee-to-trust issues; Any legislation regarding response to COVID-19; Implementation of Infrastructure legislation; Community Projects in FY 23 Appropriations.","Implementation of the Bipartisan Infrastructure Act and the Inflation Reduction Act; FY 24 and FY 25 Appropriations. Community Projects;","Implementation of the Bipartisan Infrastructure Act and the Inflation Reduction Act; FY 25 Appropriations. Community Projects;","FY Appropriations and Community Projects; FY 26 Appropriations; Implementation of grants pursuant to Bipartisan Infrastructure Act and Inflation Reduction Act; Executive Orders;","FY 26 Appropriations and Community Projects; Implementation of grants pursuant to Bipartisan Infrastructure Act and Inflation Reduction Act; Executive Orders;","FY 26 Appropriations and Community Projects; Executive Orders;"],"years":[2018,2019,2020,2021,2022,2024,2025]}