{"id":149129,"name":"PRIVACY FOR AMERICA","slug":"privacy-for-america","state":"DC","description":"Coalition in support of comprehensive federal consumer data privacy & security legislation","totalSpending":2650000,"filings":26,"yearlySpending":[{"year":2019,"income":300000},{"year":2020,"income":100000},{"year":2021,"income":200000},{"year":2022,"income":370000},{"year":2023,"income":480000},{"year":2024,"income":640000},{"year":2025,"income":560000}],"firms":["VENABLE LLP"],"lobbyists":["MICHAEL SIGNORELLI","EMILIO CIVIDANES","STUART INGIS","GREGORY GILL","TARA POTASHNIK","SARAH DONOVAN","JOSH FINESTONE","NICHOLAS CHOATE","ANNE KIERIG","STEVE VEST","PATRICK KANE","WILLIAM NORDWIND","ROBERT HARTWELL","ALYSSA WOLFINGTON","MIKE BLOOMQUIST","YARDLY POLLAS-KIMBLE","JOHN V. DRZEWICKI","THOMAS BOYD","ALLAIRE MONTICOLLO","KATELYN ASMUS"],"issues":["CSP","CPI",null],"sampleDescriptions":["Internet, marketing, and data protection issues, including potential comprehensive federal consumer data privacy and security legislation.","Data privacy, protection, and security issues; potential data privacy and security legislation in the House of Representatives and Senate","Data privacy, protection, and security issues;\nPotential data privacy and security legislation in the House of Representatives and Senate; \nS. 2968; H.R. 2013; \nSen. Wicker Privacy Discussion Draft; \nHouse Energy and Commerce Staff Discussion Draft.","Data privacy, protection, and security issues;\nPotential data privacy and security legislation in the House of Representatives and Senate; S. 2968, the Consumer Online Privacy Rights Act; H.R. 5703, the PRIVCY Act; Sen. Wicker Privacy Discussion Draft; House Energy and Commerce Staff Discussion Draft; S. 3749, the Public Health Emergency Privacy Act; H.R. 6866, the Public Health Emergency Privacy Act; S. 3663, the COVID-19 Consumer Data Protection Act of 2020; S. 3861, the Exposure Notification Privacy Act","Data privacy, protection, and security issues;\nPotential data privacy and security legislation in the House of Representatives and Senate; S. 2968, the Consumer Online Privacy Rights Act; H.R. 5703, the PRIVCY Act; Sen. Wicker Privacy Discussion Draft; House Energy and Commerce Staff Discussion Draft; S. 3749, the Public Health Emergency Privacy Act; H.R. 6866, the Public Health Emergency Privacy Act; S. 3663, the COVID-19 Consumer Data Protection Act of 2020; S. 3861, the Exposure Notification Privacy Act; S.4626 the SAFE DATA Act; Sen. Brown Data Accountability and Transparency Act of 2020 Draft","Data privacy, protection, and security issues;\nPotential data privacy and security legislation in the House of Representatives and Senate","Data privacy, protection, and security issues;\nPotential data privacy, security, and Federal Trade Commission monetary relief legislation in the House of Representatives and Senate","Data privacy, protection, and security issues; Potential data privacy, security, and Federal Trade Commission monetary relief legislation in the House of Representatives and Senate","Data privacy, protection, and security issues Potential data privacy, security, and Federal Trade Commission monetary relief legislation in the House of Representatives and Senate Children's Privacy","Data privacy, protection, and security issues Potential data privacy, security, and Federal Trade Commission monetary relief legislation in the House of Representatives and Senate Children's Privacy Financial Privacy Data brokers","Data privacy, protection, and security issues Potential data privacy, security legislation Children's Privacy Financial Privacy Data brokers","Data privacy, protection, and security issues; Potential data privacy, security legislation; Children's Privacy; Financial Privacy; Data brokers","Data privacy, protection, and security issues; Potential data privacy, security legislation; Children's Privacy; Financial Privacy; Data brokers; Artificial Intelligence"],"years":[2019,2020,2021,2022,2023,2024,2025]}