{"id":101138,"name":"PROFESSIONAL BACKGROUND SCREENERS ASSOCIATION","slug":"professional-background-screeners-association","state":"NC","description":"Trade association","totalSpending":1560000,"filings":27,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":300000},{"year":2020,"income":210000},{"year":2021,"income":180000},{"year":2022,"income":300000},{"year":2024,"income":240000},{"year":2025,"income":150000}],"firms":["AKIN GUMP STRAUSS HAUER & FELD"],"lobbyists":["JAMES TUCKER","ED PAGANO","CHRISTOPHER TREANOR","LAUREN O'BRIEN","FRANCINE FRIEDMAN","VIRGIL MILLER","VALERIE WHITE","ZACHARY RUDISILL","CHRISTINA HALEY","KYLE PEREL","SEAN D'ARCY","PETER ROWAN","RICHARD COPPOLA","WILLIAM STAMPER"],"issues":["GOV","LBR","LAW","CSP","TAX"],"sampleDescriptions":["Access to, and accuracy of, public records.","H.R. 1646, Certainty in Enforcement Act.","H.R. 2359.","Access to, and accuracy of, public records; litigation reform; H.R. 2359.","H.R. 1646, Certainty in Enforcement Act; Equal Employment Opportunity Commission guidance.","Access to, and accuracy of, public records; litigation reform; H.R. 2359; Olympic athlete safety.","Access to, and accuracy of, public records, regarding the PACER system.","Access to, and accuracy of, public records; litigation reform; Olympic athlete safety; privacy and data security.","Equal Employment Opportunity Commission guidance.","Access to, and accuracy of, public records; litigation reform; Olympic athlete safety; privacy and data security; FCRA  reform.","Issues related to re-entry; expansion of work opportunity tax credit (WOTC).","Access to, and accuracy of, public records; privacy and data security; FCRA  reform.","Access to, and accuracy of, public records; litigation reform; Olympic athlete safety; privacy and data security; FCRA reform.","Expansion of Work Opportunity Tax Credit (WOTC) eligibility criteria.","Access to, and accuracy of, public records; privacy and data security; FCRA reform.","Access to, and accuracy of, public records; privacy and data security; FCRA reform including promoting clarity of disclosures to consumers.","Access to, and accuracy of, public records, regarding the PACER system and S. 1014 the First Step Implementation Act.","Access to, and accuracy of, public records; privacy and data security including DPPA reform; FCRA reform including promoting clarity of disclosures to consumers.","Access to, and accuracy of, public records including PACER; promoting clarity of disclosures to consumers.","Promoting clarity of disclosures to consumers; Issues related to the Fair Credit Reporting Act (FCRA)."],"years":[2018,2019,2020,2021,2022,2024,2025]}