{"id":125455,"name":"PROTECTING ACCESS TO PAIN RELIEF COALITION","slug":"protecting-access-to-pain-relief-coalition","state":"DC","description":"Ad Hoc Coalition","totalSpending":2010000,"filings":23,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":150000},{"year":2020,"income":230000},{"year":2021,"income":360000},{"year":2022,"income":480000},{"year":2024,"income":320000},{"year":2025,"income":320000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["MICHAEL WERNER","JOEL ROBERSON","ETHAN JORGENSEN-EARP","PARKER REYNOLDS","SARAH STARLING CROSSAN"],"issues":["HCR","PHA","BUD"],"sampleDescriptions":["Advocating for policy to ensure patient access to pain relief; H.R. 664, Stop OD Act of 2017; S.1554, Safer Prescribing of Controlled Substances Act; H.R. 3964, Opioid Addiction Prevention Act of 2017; H.R. 2063, Opioid PACE Act of 2017.","Advocating for policy to ensure patient access to pain relief; S.2680, Opioid Crisis Response Act of 2018; H.R. 6, SUPPORT for Patients and Communities Act.","Advocating for policy to ensure patient access to pain relief; S.2680, Opioid Crisis Response Act of 2018; H.R. 6, SUPPORT for Patients and Communities Act; HHS Pain Management Interagency Task Force.","HHS Pain Management Interagency Task Force; FDA/USDA appropriations bill; Regulation of over-the-counter pain medicine.","H.R. 1865, Further Consolidated Appropriations Act, 2020, FDA/USDA appropriations; Regulation of over-the-counter pain medicine.","FY 2021 appropriations for the US Food and Drug Administration; The Over-the-Counter Monograph Safety, Innovation, and Reform Act of 2019 (S. 2740), which was included in Coronavirus Aid, Relief, and Economic Security (CARES) Act (H.R. 748).","FY 2021 appropriations for the US Food and Drug Administration; H.R. 5172, NOPAIN Act.","Coronavirus Response and Relief Supplemental Appropriations Act, 2021 (H.R. 133).","Labor HHS Appropriations legislation; draft legislation regarding pain management.","Labor HHS Appropriations.","S.3062 & H.R. 4502 - Labor HHS Appropriations Act, 2022; draft legislation regarding pain management.","S.3062 & H.R. 4502 - Labor HHS Appropriations Act, 2022.","House and Senate appropriations legislation and chronic pain surveillance legislation.","House and Senate appropriations legislation.","Policies related to labeling in the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies appropriations legislation; Centers for Disease Control and Prevention funding for chronic pain surveillance in the Labor, Health and Human Services, Education, and Related Agencies appropriations legislation; chronic pain surveillance legislation.","policies related to labeling in the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies appropriations legislation; Centers for Disease Control and Prevention funding for chronic pain surveillance in the Labor, Health and Human Services, Education, and Related Agencies appropriations legislation; chronic pain surveillance legislation.","Policies related to labeling in the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies appropriations legislation; chronic pain surveillance legislation; S. 2922 - Advancing Research for Chronic Pain Act; S.3393/H.R. 4531 - Support for Patients and Communities Reauthorization Act.","Policies related to labeling in the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies appropriations legislation; chronic pain surveillance legislation; S.2922 - Advancing Research for Chronic Pain Act; S.3393/H.R. 4531 - Support for Patients and Communities Reauthorization Act.","Policies and future legislation related to drug labeling and chronic pain surveillance."],"years":[2018,2019,2020,2021,2022,2024,2025]}