{"id":165576,"name":"PURDUE PHARMA LLP","slug":"purdue-pharma-llp","state":"DC","description":null,"totalSpending":1550000,"filings":31,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":150000},{"year":2020,"income":200000},{"year":2021,"income":200000},{"year":2022,"income":250000},{"year":2023,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":200000}],"firms":["CAPITOL HILL CONSULTING GROUP"],"lobbyists":["BRIAN SUTTER","DAVID EDWARDS","DAVID JORY","THOMAS WHARTON","EMILY WILKINSON-HOLLAND","CHRISTOPHER DAVIS"],"issues":["MMM","HCR","BUD","PHA","BNK",null],"sampleDescriptions":["General Medicare and Medicaid issues including, but not limited to, coverage reimbursement, payments and rebates","Issues related to prescription drug abuse; issues related to abuse deterrent formulations; issues related to Medicaid rebates; issues related to implementation of the Affordable Care Act;","Issues related to Labor-HHS funding. Issues related to funding of the 21st Century Cures Act.","Controlled Drug Substances Act (21 USC 13)","General Medicare and Medicaid issues including, but not limited to, coverage reimbursement, payments and rebates, abuse deterrent formulations.","Controlled Drug Substances Act (21 USC 13).","Issues related to prescription drug abuse; issues related to abuse deterrent formulations; issues related to Medicaid rebates; issues related to implementation of the Affordable Care Act.","Issues related to prescription drug abuse; issues related to abuse deterrent formulations; issues related to Medicaid rebates; issues related to implementation of the Affordable Care Act.Issues related to legal settlements.","Monitoring for issues related prevention of abuse, misuse or diversion of prescription drugs.","Monitoring for issues related to prevention of abuse, misuse or diversion of prescription drugs; federal response to the COVID-19 crisis; prescription drug payment reform; and pharmaceutical supply chain.","Monitoring for issues and hearing related to prevention of abuse, misuse or diversion of prescription drugs; federal response to the COVID-19 crisis; prescription drug payment reform; and pharmaceutical supply chain.","Monitored congressional efforts around the SACKLER Act, including H.R. 2096 / S. 2472 and HR 4777 / S 2497, including outreach regarding potential committee activity on the legislation.","Monitored congressional efforts around the SACKLER Act.","Monitoring for issues and hearing related to prevention of abuse, misuse or diversion of prescription drugs; prescription drug payment reform; and pharmaceutical supply chain."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}