{"id":160871,"name":"RADIANCE TECHNOLOGIES, INC.","slug":"radiance-technologies-inc","state":"AL","description":"System Engineering, Technology Development, Testing & Evaluation, Application & Integratio","totalSpending":1200000,"filings":16,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":220000},{"year":2020,"income":320000},{"year":2021,"income":320000},{"year":2022,"income":160000}],"firms":["MAYNARD NEXSEN PC"],"lobbyists":["LINDA MAYNOR","WILLIAM STIERS"],"issues":["DEF","SMB","HOM"],"sampleDescriptions":["FY2018 Defense Appropriations and Authorization bills (H.R. 1625) for Advanced Protection technologies, directed energy development, critical infrastructure protection; FY2019 Defense Appropriations and Authorization bills (H.R. 6157, Senate Subcommittee Draft) for Advanced Protection technologies, directed energy development, high fidelity modeling simulation & analysis","FY2019 Defense Appropriations and Authorization bills (H.R. 6157, S. 3159) for Advanced Protection technologies, directed energy development, high fidelity modeling simulation & analysis","FY2020 Defense Appropriations (to be introduced) for advanced protection technology, air and missile defense technologies.","H.R.2022 - ESOP Business Act of 2019","FY20 Defense Appropriations (H.R. 2968, unnumbered Senate)- advanced protection technology, air and missile defense technologies; FY20 Defense Authorization (H.R. 2500, S. 1790)- provisions impacting employee owned companies, Army Futures Command.","FY20 Defense Appropriations (H.R. 2968, S. 2474)- advanced protection technology, air and missile defense technologies; FY20 Defense Authorization (H.R. 2500, S. 1790)- provisions impacting employee owned companies, Army Futures Command.","Port resiliency and security - FY21 Homeland Security Appropriations (bill numbers to be determined).","Directed energy systems, air and missile defense technologies, position navigation and timing resiliency - FY21 Defense Appropriations (bill numbers to be determined).","Directed energy systems, air and missile defense technologies, position navigation and timing resiliency - FY21 Defense Appropriations (H.R. 7617, unnumbered Senate).","Port resiliency and security - FY21 Homeland Security Appropriations (H.R. 7669, unnumbered Senate).","Directed energy systems, air and missile defense technologies, position navigation and timing resiliency - FY21 Defense Appropriations (H.R. 7617, H.R. 133).","Port resiliency and security - FY21 Homeland Security Appropriations (H.R. 7669, H.R. 133).","FY22 Homeland Security Appropriations Bills (House and Senate unnumbered) - port resiliency and security","FY22 Defense Authorization Bills (House and Senate unnumbered) and FY22 Defense Appropriations Bills (House and Senate unnumbered) - directed energy development, air and missile defense system integration, position navigation and timing laboratory.","Air and Missile Defense Integration, directed energy development, position navigation timing laboratory - FY22 National Defense Authorizations (HR 4350, S.2792) and FY22 Defense Appropriations (HR 4432, unnumbered Senate).","Post resiliency and security - FY22 Homeland Security Appropriations (HR 4431, unnumbered Senate).","Post resiliency and security - FY22 Homeland Security Appropriations (HR 4431, S.3058).","Air and Missile Defense Integration, directed energy development, position navigation timing laboratory - FY22 National Defense Authorizations (HR 4350, S.2792) and FY22 Defense Appropriations (HR 4432, S.3023).","Research and development in directed energy technologies, protective electronics, AI/ML, modeling and simulation tools - FY23 National Defense Authorization Act (unnumbered) and FY23 Defense Appropriations (unnumbered).","Port Resiliency and Security - FY23 Homeland Security Appropriations (unnumbered)."],"years":[2018,2019,2020,2021,2022]}