{
  "id": 162780,
  "name": "RAIL SECURITY ALLIANCE",
  "slug": "rail-security-alliance",
  "state": "DC",
  "description": "raise awareness of trade and security issues in the railroad industry",
  "totalSpending": 2750000,
  "filings": 24,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 520000
    },
    {
      "year": 2019,
      "income": 390000
    },
    {
      "year": 2020,
      "income": 140000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 400000
    },
    {
      "year": 2023,
      "income": 440000
    },
    {
      "year": 2024,
      "income": 180000
    },
    {
      "year": 2025,
      "income": 480000
    }
  ],
  "firms": [
    "VENN STRATEGIES"
  ],
  "lobbyists": [
    "STEPHANIE SILVERMAN",
    "ERIK OLSON",
    "JOHN HEBERT",
    "AUSTIN ROBERTS",
    "MICHAEL LANZA",
    "KELSEY JOHNSON",
    "EMILIA DISANTO",
    "BENJAMIN STEINBERG",
    "AUSTIN NORTON",
    "JOSHUA THARRINGTON",
    "SAMUEL GOODSTEIN",
    "MATTHEW SCOTT",
    "GARRETT LUKKEN",
    "KILEY PHILLIPS"
  ],
  "issues": [
    "HOM",
    "RRR",
    "TRD",
    "DEF",
    "BUD",
    "TRA",
    "TAX",
    null
  ],
  "sampleDescriptions": [
    "Policy related to the security of the United States rail critical infrastructure.",
    "Trade and investment policy related to the United States rail manufacturing industry.",
    "Trade and investment policy related to the United States rail manufacturing industry, including lobbying on CFIUS reform legislation S2098 and HR4311",
    "Trade and investment policy related to the United States rail manufacturing industry, including lobbying on CFIUS reform legislation S2098 and HR4311 and advocating for the inclusion of rail components in USTR's 301 tariff lists.",
    "Trade and investment policy related to the United States rail manufacturing industry, including lobbying on CFIUS reform legislation S2098 and HR4311 that is part of the NDAA conference.",
    "Policy related to the security, cybersecurity and investment into the United States public transportation systems.",
    "Trade and investment policy related to the United States rail manufacturing industry, including advocating for the inclusion of rail components in USTR's 301 tariff lists.",
    "Policy related to the security of the United States rail critical infrastructure, including H.R. 6072/S.3023 Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2019; H.R. 6157 Continuing Appropriations; H.R. 695, Further Additional Continuing Appropriations Act 2019.",
    "Policy related to the security and cybersecurity of the United States rail critical infrastructure.",
    "Trade and investment policy related to the United States rail manufacturing industry and policy related to the security and cybersecurity of the United States rail critical infrastructure",
    "Trade and investment policy related to the United States rail manufacturing industry and policy related to the security and cybersecurity of the United States rail critical infrastructure, including S.846, The Transit Infrastructure Vehicle Security Act.",
    "Trade and investment policy related to the United States rail manufacturing industry, including advocating for the continued inclusion of rail components to USTR's 301 tariff lists.",
    "Policy related to the security of the United States rail critical infrastructure, 116th Congress H.R.21 Consolidated Appropriations Act, 2019, H.R.267 Transportation, Housing and Related Agencies Appropriations Act, 2019, H.R.648 Consolidated Appropriations Act, 2019.",
    "Policy related to the security cybersecurity and investment into the United States public transportation systems including S.846 Transit Infrastructure Vehicle Security Act.",
    "Trade and investment policy related to the United States rail manufacturing industry and policy related to the security and cybersecurity of the United States rail critical infrastructure, including S.846 & HR. 2739, The Transit Infrastructure Vehicle Security Act.",
    "Policy related to the security cybersecurity and investment into the United States public transportation systems including S.846 & HR 2739, Transit Infrastructure Vehicle Security Act.",
    "Policy related to the United States rail manufacturing industry including S.846 & HR.2739, The Transit Infrastructure Vehicle Security Act & National Defense Authorization Act of 2020, S.1790 & HR.2500.",
    "Policy related to the United States rail manufacturing industry & The National Defense Authorization Act of 2020, S.1790 & HR.2500.",
    "Policy related to the United States public transportation systems including S.846 & HR.2739, The Transit Infrastructure Vehicle Security Act & The National Defense Authorization Act of 2020, S.1790 & HR.2500.",
    "Policy related to the security & cybersecurity of the United States rail critical infrastructure."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -8,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 343750,
  "peakYear": 2018,
  "lobbyistCount": 14,
  "firmCount": 1,
  "issueCount": 7,
  "industry": "technology"
}