{
  "id": 184858,
  "name": "RED BULL NORTH AMERICA, INC.",
  "slug": "red-bull-north-america-inc",
  "state": "CA",
  "description": "Beverage Company",
  "totalSpending": 1920000,
  "filings": 32,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 240000
    },
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "ANNE MACMILLAN",
    "LARISSA MARTINEZ",
    "HEATHER PODESTA",
    "ERIC ROSEN",
    "KATHRYN WISE",
    "TIMOTHY MARTIN",
    "DANIELLE BECK",
    "KEVIN DIESTELOW",
    "JAMES OBRIEN",
    "WILLIAM SITTON"
  ],
  "issues": [
    "BEV",
    "AGR",
    "TRD",
    "TRA",
    null,
    "BUD"
  ],
  "sampleDescriptions": [
    "Educate policymakers about energy beverages.",
    "Monitor issues related to the implementation of the 2015 Dietary Guidelines and efforts to reform the 2020 Dietary Guidelines process; monitor efforts to reform the Supplemental Nutrition Assistance Program (SNAP).",
    "Monitor issues related to the implementation of the 2015 Dietary Guidelines and efforts to reform the 2020 Dietary Guidelines process; monitor efforts to reform the Supplemental Nutrition Assistance Program (SNAP); monitor H.R. 3042, the Agriculture Improvement Act of 2018, and H.R. 2, the Agriculture Nutrition Act of 2018.",
    "Monitor issues related to the implementation of the 2015 Dietary Guidelines and efforts to reform the 2020 Dietary Guidelines process; monitor efforts to reform the Supplemental Nutrition Assistance Program (SNAP); monitor S. 3042/H.R. 2, the Agriculture Improvement Act of 2018.",
    "Educate policymakers about energy beverages; monitor issues important to the industry.",
    "Monitor issues related to the implementation of the 2015 Dietary Guidelines and efforts to reform the 2020 Dietary Guidelines process.",
    "Monitor issues related to the implementation of the 2015 Dietary Guidelines and establishment of the 2020 Dietary Guidelines for Americans.",
    "Educate policymakers on the implementation of the 2015 Dietary Guidelines and establishment of the 2020 Dietary Guidelines for Americans.",
    "Educate policymakers on the implementation of the 2020 Dietary Guidelines for Americans.",
    "Educate policymakers on the importance of current science-based Dietary Guidelines for Americans.",
    "Educate policymakers on the importance of current science-based Dietary Guidelines for Americans. Monitor the planning and implementation of the White House Conference on Hunger, Nutrition, and Health with regard to federal nutrition programs and standards.",
    "Educate policymakers on the impacts of Section 301 tariffs. Monitor the Office of the U.S. Trade Representatives statutory review of Sec. 301 tariffs.",
    "Monitor the rail labor negotiations and PL 117-216.",
    "Educate policymakers on the importance of current science-based Dietary Guidelines for Americans. Monitor the implementation of nutrition regulations from the National Strategy on Hunger, Nutrition, and Health.",
    "Educate policymakers on the impacts of Section 301 tariffs. Monitor the Office of the U.S. Trade Representative's statutory review of Sec. 301 tariffs.",
    "Monitor the development of P.L. 118-42.",
    "Educate policymakers on the impacts of tariffs on the energy drink sector.",
    "Educate policymakers on the importance of current science-based Dietary Guidelines for Americans. Monitor pending nutrition regulations related to food additives and ingredients."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 240000,
  "peakYear": 2018,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 5
}