{"id":182916,"name":"REFORM GOVERNMENT SURVEILLANCE","slug":"reform-government-surveillance","state":"DC","description":"Coalition of technology companies","totalSpending":2540000,"filings":23,"yearlySpending":[{"year":2018,"income":330000},{"year":2019,"income":290000},{"year":2020,"income":290000},{"year":2021,"income":380000},{"year":2022,"income":410000},{"year":2024,"income":360000},{"year":2025,"income":480000}],"firms":["MONUMENT ADVOCACY"],"lobbyists":["ANDREW HOWELL","E. ASHLEY HOY","RICH THOMAS","KIMBERLY ELLIS","JOHN MULLIGAN","KATHRYN MILLS","THOMAS HAWKS","CHAN PARK","BRYAN ALPHIN","CHARLES VERDERY","ANDERSON HEIMAN","JEFFREY GARY","MICHAEL TANNER","TROY STOCK"],"issues":["BUD","GOV","INT","LAW"],"sampleDescriptions":["Issues related to FISA; Cross border data","Issues relate to transparency; Privacy; Encryption; Government Surveillance; Issues relate to FISA","Issues relate to transparency; Privacy; encryption; government surveillance; Data localization;  Cross-border data issues","Issues relate to transparency; Privacy; Encryption; Government Surveillance; Data localization; Appropriations","Issues relate to transparency; Privacy; Encryption; Government Surveillance; Data localization","Issues relate to transparency; Privacy; Encryption; Government Surveillance","Issues related to transparency; privacy; encryption; government surveillance; data localization; cross border data issues; engagement with the Privacy Civil Liberties Oversight Board (PCLOB)","Issues related to privacy; encryption; government surveillance; data localization; engagement with the Privacy Civil Liberties Oversight Board (PCLOB)","Issues related to transparency; privacy; encryption; government surveillance; engagement with the Privacy Civil Liberties Oversight Board (PCLOB)","Issues related to transparency; privacy; encryption; government surveillance; data localization; cross border data issues; engagement with the Privacy Civil Liberties Oversight Board (PCLOB); FISA reauthorization","Issues related to transparency; privacy; encryption; government surveillance; S.3398-EARN IT Act of 2020","Issues related to privacy; encryption; government surveillance; data localization; S.3398-EARN IT Act of 2020","Issues related to transparency; privacy; encryption; government surveillance; data localization; cross border data issues; FISA reauthorization; S.3398-EARN IT Act of 2020","Issues related to transparency; privacy; encryption; government surveillance; data localization","Issues related to transparency; privacy; encryption; government surveillance","Issues related to transparency; privacy; encryption; government surveillance; data localization; cross border data issues","Issues related to transparency; privacy; encryption; government surveillance; data localization; H.R. 7072 NDO Fairness Act; S.3538/H.R. 6544 - EARN IT Act","Issues related to transparency; privacy; encryption; government surveillance; data localization; H.R. 7072/S. 4373 - NDO Fairness Act.","Issues related to transparency, privacy, encryption, data localization, cross-border data reform and policies, and government surveillance reform, including H.R. 6611/S. 3351, the FISA Reform and Reauthorization Act of 2023 and H.R. 6570, the Protect Liberty and End Warrantless Surveillance Act of 2023.","Issues related to transparency, privacy, encryption, data localization, cross-border data reform and policies, and government surveillance reform, including H.R. 6611/S. 3351, the FISA Reform and Reauthorization Act of 2023 and H.R. 6570, the Protect Liberty and End Warrantless Surveillance Act of 2023; H.R. 3089/S.4037, the NDO Fairness Act."],"years":[2018,2019,2020,2021,2022,2024,2025]}