{"id":201624,"name":"RESOURCE MANAGEMENT SERVICE LLC","slug":"resource-management-service-llc","state":"AL","description":"Manage forest lands for institutional investors","totalSpending":1300000,"filings":17,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":240000},{"year":2020,"income":320000},{"year":2021,"income":320000},{"year":2022,"income":100000}],"firms":["CGA STRATEGIES LLC"],"lobbyists":["CATHERINE EMMERSON"],"issues":["NAT","TRD","LBR","TAX"],"sampleDescriptions":["Education and advocacy regarding working forests and activities related to the working Forests Caucus. Outreach regarding forest certification issues including EPA Interim Recommendations regarding procurement. Discussions regarding ESA and Habitat Conservation Plan and issues related to species. Advocacy related to the Timber Innovation Act.  Advocacy related to the upcoming reauthorization of the Farm Bill.","Education and advocacy regarding working forests and activities related to the working Forests Caucus. Outreach regarding forest certification issues including EPA Interim Recommendations regarding procurement. Discussions regarding ESA and Habitat Conservation Plan and issues related to species. Advocacy related to the Timber Innovation Act.  Advocacy related to the upcoming reauthorization of the Farm Bill. Inquiries related to forestry activities in S.2098, Foreign Investment Risk Modernization Act.","Outreach regarding conservation without conflict initiatives.","Outreach to House and Senate staff expressing concern regarding tariff impacts on lumber export markets.","Outreach regarding conservation without conflict initiatives. Outreach regarding EPA carbon neutrality proposed rulemaking.","Outreach regarding conservation without conflict initiatives. Outreach regarding EPA carbon neutrality proposed rulemaking.  Outreach on Great American Outdoors legislation.","No longer applicable.","Outreach to select House and Senate offices regarding impact of White House immigration policy on H2- B visa availability and impact of this on the forest products sector that heavily relies on foreign workers.","Generally, the importance of H2 B workers to the forest products industry.","General engagement with new member offices regarding positions on climate change, new forest products markets, the use of wood in procurement and conservation views.","None.","Education regarding timber tax related provisions in any tax reconciliation measure."],"years":[2018,2019,2020,2021,2022]}