{"id":101191,"name":"RESTAURANT BRANDS INTERNATIONAL INC (RBI)","slug":"restaurant-brands-international-inc-rbi","state":"FL","description":"Quick service restaurant company.","totalSpending":1420000,"filings":19,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":190000},{"year":2020,"income":320000},{"year":2021,"income":160000},{"year":2022,"income":240000},{"year":2024,"income":270000}],"firms":["AKIN GUMP STRAUSS HAUER & FELD"],"lobbyists":["ARSHI SIDDIQUI","JEFF MCMILLEN","GORDON BATES","LAUREN O'BRIEN","GEOFF VERHOFF","BRENDAN DUNN","SAM OLSWANGER","LOUIS AGNELLO"],"issues":["TAX","GOV","SMB"],"sampleDescriptions":["Strategic and policy advice on tax reform.","Strategic and policy advice on appropriations and franchise related issues.","Strategic and policy advice on tax reform as related to implementation of the Tax Cuts and Jobs Act.","Strategic and policy advice on tax related legislation.","Policy advice related to small business and the Paycheck Protection Program (CARES Act H.R.748).","Monitoring developments related to COVID-19 legislation; Policy advice related to small business and the Paycheck Protection Program (CARES Act H.R.748).","Strategic and policy advice on tax-related legislation.","Monitoring developments related to COVID-19 legislation; policy advice related to small business and the Paycheck Protection Program (The CARES Act, H.R.748).","Strategic and policy advice on appropriations and franchise-related issues.","Strategic and policy advice on COVID-19 stimulus legislation and franchise-related issues.","Policy advice related to small business and the Paycheck Protection Program (CARES Act H.R.748)","Strategic and policy advice on corporate and franchise-related issues.","Issues related to corporate taxation in reconciliation legislation, including the Build Back Better Act (H.R.5376).","Strategic and policy advice on corporate, workforce, and franchise-related issues.","Issues related to corporate taxation in reconciliation legislation, including the Inflation Reduction Act (P.L. 117-169).","Issues related to corporate taxation in year-end legislation.","Issues related to corporate taxation and strategic and policy advice on the fiscal outlook."],"years":[2018,2019,2020,2021,2022,2024]}