{"id":168002,"name":"RTI INTERNATIONAL","slug":"rti-international","state":"NC","description":"Government Relations","totalSpending":1180000,"filings":28,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":160000},{"year":2020,"income":160000},{"year":2021,"income":160000},{"year":2022,"income":160000},{"year":2024,"income":120000},{"year":2025,"income":260000}],"firms":["CORNERSTONE GOVERNMENT AFFAIRS, INC."],"lobbyists":["JOHN CRUMBLISS","MARK MURRAY","MICHAEL SMITH","JAMES RICHARDS","TODD WEBSTER","MARK MIODUSKI","TONY ESSALIH","ERIK FATEMI","SUSAN SWEAT"],"issues":["FOR","BUD","ENG"],"sampleDescriptions":["Engage international development and health appropriations","International development and health appropriations, campus sexual assault","DOE gasification","Engage international development and health appropriations, basic education","International development and health appropriations, campus sexual assault, community policing, opioids","Engage international development and health appropriations, basic education, domestic radicalization research","International development and health appropriations, campus sexual assault, community policing, opioids, domestic radicalization research","International development and health appropriations, campus sexual assault, community policing, opioids, domestic radicalization research, the BOLD Act","Engage international development and health appropriations, basic education, public health","International development and health appropriations, campus sexual assault, community policing, opioids, public health","Engage international development and health appropriations, basic education, public health, Section 889 clarification.","International development and health appropriations, campus sexual assault, community policing, opioids, public health, Section 889 clarification.","Issues related to international development, health appropriations, campus sexual assault, community policing, opioids, and public health.","Engage on international development and health appropriations.","Issues related to international development, health appropriations, community policing, opioids, and public health.","Issues related to international development, health appropriations, opioids, and public health.","Issues related to international development, health appropriations, federal funding, and public health."],"years":[2018,2019,2020,2021,2022,2024,2025]}