{"id":103029,"name":"RURAL COUNTY REPRESENTATIVES OF CALIFORNIA","slug":"rural-county-representatives-of-california","state":"CA","description":"Advocates on behalf of rural issues at the state and federal levels.","totalSpending":1210000,"filings":24,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":200000},{"year":2020,"income":150000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":150000},{"year":2025,"income":210000}],"firms":["ACG ADVOCACY"],"lobbyists":["SHERYL COHEN","PATRICK GRANT","DAVID URBAN","ROBERTO FIERRO","SEAN BYRNE","GABRIEL PEREZ-ALVAREZ","SARAH KOHN","JACQUELINE JUFFER","JAMIE PANARITES","CAMERON SEWARD"],"issues":["BAN","TRA","EDU","IND","CAW","AGR","DEF","CPT","BUD"],"sampleDescriptions":["Banking issues impacting rural counties in California.","Transportation issues impacting rural counties in California.","Education issues impacting rural counties in California.\nEducation Infrastructure.","Native American issues impacting rural counties in California.","Water issues impacting rural counties in California.","Farming issues impacting rural counties in California.","Military installations issues impacting rural counties in California.","Broadband issues impacting rural counties in California.","Banking issues impacting rural counties in California.\nCannabis issues impacting rural counties in California.","Paycheck Protection Program (PPP).\nH.R.6800: Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act.","Paycheck Protection Program (PPP).","Farming issues impacting rural counties in California.\nCannabis issues impacting rural counties in California.","Transportation issues impacting rural counties in California. Bipartisan Infrastructure Law implementation.","Education issues impacting rural counties in California. Education Infrastructure.","Farming issues impacting rural counties in California. Cannabis issues impacting rural counties in California.","Cannabis issues impacting rural counties in California. Farming issues impacting rural counties in California.","Military installation issues impacting rural counties in California.","Cannabis issues impacting rural counties in California. Farming issues impacting rural counties in California. 2025 Farm Bill Reauthorization. H.R.1 - One Big Beautiful Bill Act.","Secure Rural Schools Reauthorization.","Cannabis issues impacting rural counties in California. Farming issues impacting rural counties in California. 2025 Farm Bill Reauthorization. Public Law 119-21: One Big Beautiful Bill Act."],"years":[2018,2019,2020,2021,2022,2024,2025]}