{"id":161962,"name":"RURAL STATES FED TRANSP POLICY DEVELOPMENT GROUP","slug":"rural-states-fed-transp-policy-development-group","state":"DC","description":null,"totalSpending":1180000,"filings":27,"yearlySpending":[{"year":2018,"income":100000},{"year":2019,"income":220000},{"year":2020,"income":120000},{"year":2021,"income":270000},{"year":2022,"income":90000},{"year":2024,"income":120000},{"year":2025,"income":260000}],"firms":["MR. JOHN A. DEVIERNO"],"lobbyists":["JOHN DEVIERNO"],"issues":["TRA"],"sampleDescriptions":["Funding for and conditions attached to programs of financial assistance to states for transportation, including for highways, transit, highway safety and aviation, and also including matters relating to the Highway Trust Fund and to transportation appropriations.","Funding for and conditions attached to programs of financial assistance to states for transportation, including for highways, transit, highway safety and aviation, and also including matters related to transportation appropriations and the Highway Trust Fund.","Funding for and conditions attached to programs of financial assistance to states for transportation, including for highways, transit, highway safety and aviation, and also including matters related to transportation appropriations and the Highway Trust Fund, including S. 2302.","Funding for and conditions attached to programs of financial assistance to states for transportation, including for highways, transit, highway safety and aviation, and also including matters related to transportation appropriations and the Highway Trust Fund, including S. 2302 and repeal of FAST Act rescission of highway contract authority.","Funding for and conditions attached to programs of financial assistance to states for transportation, including for highways, transit, highway safety and aviation, and also including matters related to transportation appropriations and the Highway Trust Fund, including S. 2302 and H.R. 2.","Funding for and conditions attached to or related to programs of financial assistance to states for transportation, including for highways, transit, highway safety, and aviation, whether as to authorization or appropriation.","Funding for and conditions attached or related to programs of financial assistance to states for transportation, including for highways, transit, highway safety, and aviation, whether through authorization, the Highway Trust Fund, or appropriations."],"years":[2018,2019,2020,2021,2022,2024,2025]}