{
  "id": 196081,
  "name": "SABINE-NECHES NAVIGATION DISTRICT",
  "slug": "sabine-neches-navigation-district",
  "state": "TX",
  "description": "The SNND is responsible for managing and partnering to improve the Sabine-Neches Waterway.",
  "totalSpending": 2040000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 220000
    },
    {
      "year": 2019,
      "income": 210000
    },
    {
      "year": 2020,
      "income": 210000
    },
    {
      "year": 2021,
      "income": 280000
    },
    {
      "year": 2022,
      "income": 280000
    },
    {
      "year": 2023,
      "income": 280000
    },
    {
      "year": 2024,
      "income": 280000
    },
    {
      "year": 2025,
      "income": 280000
    }
  ],
  "firms": [
    "MABRY PUBLIC AFFAIRS LLC"
  ],
  "lobbyists": [
    "MILAM MABRY"
  ],
  "issues": [
    "BUD",
    "TRA",
    null
  ],
  "sampleDescriptions": [
    "Fiscal Year 2018 Appropriations Bills and Budgets that pertain to the U.S. Army Corps of Engineers' FY'18 and FY'19 Budget/Appropriations Legislation, Process and Budgets.\n\nDisaster Supplemental Appropriations Legislation.",
    "Fiscal Year 2019 Appropriations Bills and Budgets that pertain to the U.S. Army Corps of Engineers' FY'19 Budget/Appropriations Legislation, Process and Budgets.",
    "Fiscal Year 2020 Appropriations Legislation Impacting the US Army Corps of Engineers' annual Budget Process.",
    "Fiscal Year 2020 U.S. Army Corps Funding Allocations and Fiscal Year 2021 Appropriations Legislation Impacting the US Army Corps of Engineers' annual Budget Process.\n\nTracking all legislative responses to COVID-19 - including the CARES ACT and any developing longer-term economic recovery legislation.",
    "Fiscal Year 2021 Appropriations Legislation and Allocations Impacting the US Army Corps of Engineers' annual Budget Process.\n\nTracking all legislative responses to COVID-19 - and any developing longer-term economic recovery legislation.",
    "Tracking and working the Water Resources Development Act of 2020 and all legislation associated with its authorization process including the Fiscal Year 2021 Omnibus Appropriations Legislation.",
    "Tracking and working the Implementation of the Water Resources Development Act of 2020.\n\nTracking the Congress' actions regarding any Infrastructure Package and any bills that may result from this initiative.",
    "Fiscal Year 2022 Appropriations Legislation and Allocations Impacting the US Army Corps of Engineers' annual Budget Process.",
    "Tracking and working the Implementation of the Water Resources Development Act of 2020.\n\nTracking the Congress' actions regarding any Infrastructure Package and any bills that may result from this initiative like the Bipartisan Infrastructure Bill.",
    "Fiscal Year 2022 Appropriations \"Work Plan\" and Fiscal Year 2023 Legislation and Allocations Impacting the US Army Corps of Engineers' annual Budget Process.",
    "Tracking and working the Water Resources Development Act of 2022.",
    "Annual Fiscal Year Appropriations and \"Work Plan\" and Annual Energy & Water Appropriations Fiscal Legislation and Allocations Impacting the US Army Corps of Engineers' annual Budget Process.",
    "Tracking and working the Water Resources Development Act.",
    "Working on the annual President's Budget process and the Congress' annual appropriations process specifically related to federal share funding for the U.S. Army Corps of Engineers.",
    "Working toward the implementation of the most recent WRDA 2022 legislation and preparing for the next WRDA reauthorization - WRDA 2024. Additionally working with MARAD regarding its Ready Reserve Fleet along the Sabine-Neches Waterway.",
    "The Fiscal Years 2025 and 2026 US Army Corps Budget and Appropriations Process within the Administration and on Capitol Hill.",
    "Preparing for the WRDA 2026 Reauthorization Legislation on Capitol Hill and working with MARAD re. the Beaumont Reserve Fleet."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 27,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 255000,
  "peakYear": 2021,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 2
}