{
  "id": 191988,
  "name": "SAGINAW CHIPPEWA INDIAN TRIBE OF MICHIGAN",
  "slug": "saginaw-chippewa-indian-tribe-of-michigan",
  "state": "MI",
  "description": "Indian Tribal Government",
  "totalSpending": 1768000,
  "filings": 31,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 144000
    },
    {
      "year": 2019,
      "income": 219000
    },
    {
      "year": 2020,
      "income": 165000
    },
    {
      "year": 2021,
      "income": 220000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 300000
    }
  ],
  "firms": [
    "SPIRIT ROCK CONSULTING"
  ],
  "lobbyists": [
    "AURENE MARTIN",
    "LARRY ROSENTHAL",
    "JENNIFER HEIDE VAN DER",
    "DAMIAN PADILLA"
  ],
  "issues": [
    "IND",
    "TAX",
    "GAM",
    "LBR",
    null,
    "LAW"
  ],
  "sampleDescriptions": [
    "General tribal representation on tribal issues; including tribal sovereignty issues.",
    "Monitor tax reform; monitor implementation of the General Tribal Welfare Exclusion Act.  Analysis of proposed IRS regulation affecting casino withholding.",
    "Monitor and advocate tribal position on issues affecting Indian gaming, including off-reservation and Internet gaming issues.  Assist with analysis of IRS proposed rule affecting casino withholding procedures.",
    "Support the passage of Tribal Labor Sovereignty Act, S. 63 and H.R. 986",
    "General tribal representation on tribal issues; including tribal sovereignty issues, Farm bill (H.R. 2)",
    "Monitor and advocate tribal position on issues affecting Indian gaming, including off-reservation and Internet gaming issues. Assist with analysis of IRS proposed rule affecting casino withholding procedures.",
    "Monitor tax reform; monitor implementation of the General Tribal Welfare Exclusion Act. Analysis of proposed IRS regulation affecting casino withholding.",
    "Support the passage of Tribal Labor Sovereignty Act.",
    "General tribal representation on tribal issues; including tribal sovereignty issues, Farm bill implementation.",
    "Monitor tax legislation; monitor implementation of the General Tribal Welfare Exclusion Act. Analysis of proposed IRS regulation affecting casino withholding.",
    "Monitor and advocate tribal position on issues affecting Indian gaming, including off-reservation and Internet gaming issues. Monitor IRS proposed rule affecting casino withholding procedures.",
    "Monitor and advocate tribal position on issues affecting Indian gaming, including off-reservation, sports wagering and Internet gaming issues. Monitor IRS proposed rule affecting casino withholding procedures.",
    "General tribal representation on tribal issues; including tribal sovereignty issues, Farm bill implementation.\n\nAdvocate for tribal government funding in the H.R. 748, the CARES Act.",
    "Tribal COVID bills",
    "Tribal COVID legislation",
    "COVID bills",
    "Tribal COVIOD funding legislation",
    "Monitor and advocate for pro-tribal tax policy.",
    "General tribal representation. Assist with Community Project Funding requests.",
    "Advocate for passage of the Tribal Law Enforcement Parity Act."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 108,
  "trajectory": "exploding",
  "yearsActive": 8,
  "avgAnnualSpending": 221000,
  "peakYear": 2025,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 5
}