{"id":187760,"name":"SALESFORCE.COM INC.","slug":"salesforce-com-inc","state":"CA","description":"provider of enterprise cloud technology solutions","totalSpending":1630000,"filings":29,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":180000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":180000},{"year":2025,"income":240000}],"firms":["FRANKLIN SQUARE GROUP, LLC"],"lobbyists":["MATTHEW TANIELIAN","JOSHUA ACKIL","KARA CALVERT CAMPBELL","BRIAN PETERS","BRIAN WORTH","SARAH BETH JANSEN","TROY PERRY","JESSICA MARTINEZ","WESLEY MCCLELLAND","KEVIN CUMMINS","ROLAND LITTERST"],"issues":["CPI","TRD","FIN","IMM","LBR","CPT","GOV","ENV",null],"sampleDescriptions":["cloud technology; cybersecurity; Electronic Communications Protection Act; International Communications Privacy Act;\nencryption policy; surveillance reform; privacy and security","information technology trade issues; global data flows; international trade agreements; US-EU safe harbor","issues related to cloud security","high skilled immigration programs","Workforce Development and Apprenticeship programs","issues related to intellectual property and patent reform","federal IT acquisition policy; issues related to FedRAMP and FITARA; cybersecurity; federal IT modernization; H.R.2777 MGT Act","information technology trade issues; global data flows; international trade agreements; US-EU Privacy Shield","Issues related to intellectual property legislation and regulation","information technology trade issues; global data flows; international trade agreements","issues related to high skilled immigration","federal IT acquisition policy; cybersecurity; federal IT modernization","cloud technology; cybersecurity; encryption policy; surveillance reform; privacy and security","cloud technology; cybersecurity; encryption policy; privacy and security; government IT modernization","federal IT acquisition policy; cybersecurity; federal IT modernization; COVID recovery","Trillion Trees Initiative","Trillion Trees Campaign","cloud technology; cybersecurity; encryption policy; privacy and security; government IT modernization; S. 3398, EARN IT Act; S. 4066, Platform Accountability and Consumer Transparency (PACT) Act","federal IT acquisition policy; cybersecurity; federal and state IT modernization; issues related to COVID-19 recovery","cloud technology; cybersecurity; encryption policy; privacy and security; government IT modernization; S. 3398, EARN IT Act; S. 4066, Platform Accountability and Consumer Transparency (PACT) Act; legislation related to Section 230 of the Communications Decency Act"],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}