{"id":181745,"name":"SEATTLE CHILDREN'S HOSPITAL RESEARCH AND FOUNDATION","slug":"seattle-children-s-hospital-research-and-foundation","state":"WA","description":null,"totalSpending":1655000,"filings":27,"yearlySpending":[{"year":2018,"income":205000},{"year":2019,"income":195000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":185000},{"year":2024,"income":360000},{"year":2025,"income":360000}],"firms":["THE PETRIZZO GROUP, INC."],"lobbyists":["TJ PETRIZZO","MEGAN PEREZ BURKE","CAMILLE LEPIRE"],"issues":["HCR","MMM","BUD","MED"],"sampleDescriptions":["Advocated for legislation to ensure that every child maintains coverage under Medicaid and CHIP. Advocated for Children's GME, Medicaid reform for chronically ill pediatric patients, funding for NIH pediatric research.","Advocated for legislation to ensure that every child maintains coverage under Medicaid and CHIP. Advocated for Children's GME, Medicaid reform for chronically ill pediatric patients, funding for NIH pediatric research. Opposition to proposals to cap IDC reimbursements for NIH extramural research.","Advocated for legislation to ensure that every child maintains coverage under Medicaid and CHIP. Advocated for Children's GME, Medicaid reform for chronically ill pediatric patients, funding for NIH pediatric research. Legislation to advance cures for Sickle Cell disease.","Advocated for legislation to ensure that every child maintains coverage under Medicaid and CHIP. Advocated for Children's GME, Medicaid reform for chronically ill pediatric patients, funding for NIH pediatric research, and against new proposed regulations on public charge.","Advocated for legislation to ensure that every child maintains coverage under Medicaid and CHIP. Advocated for Children's GME, Medicaid reform for chronically ill pediatric patients, funding for NIH pediatric research and against new proposed regulations on public charge. .","Advocated for legislation to ensure that every child maintains coverage under Medicaid and CHIP. Advocated for Children's GME, Medicaid reform for chronically ill pediatric patients, funding for NIH pediatric research, and against new proposed regulations on public charge. . Opposition to proposals to cap IDC reimbursements for NIH extramural research.","Advocated for passage of ACE Kids Act (H.R. 1226/ S. 317); improvements to the Child Abuse Prevention and Treatment Act (H.R. 2076); Children's GME; funding for NIH pediatric research; reauthorization of PCORI PEDSnet program; increased funding for sickle cell research; and funding for Trans-NIH Pediatric Consortium (N-PERC).","Advocated for mental health funding; H.R. 1009/S. 1102, Mental Health Services for Students Act\n; improvements to the Child Abuse Prevention and Treatment Act (H.R. 2076); Children's GME; funding for NIH pediatric research; reauthorization of PCORI PEDSnet program; increased funding for sickle cell research; and funding for Trans-NIH Pediatric Consortium (N-PERC).","Advocated mental health funding in school; GME; funding for NIH pediatric research; increased funding for sickle cell research; and funding for Trans-NIH Pediatric Consortium (N-PERC).","Funding for NIH research; increased funding for sickle cell research","Advocated mental health funding in school; GME; funding for NIH pediatric research; increased funding for sickle cell research; and funding for Trans-NIH Pediatric Consortium (N-PERC). H.R. 4159, PACT Act.","Funding for NIH research; increased funding for sickle cell research.  H.R. 4159, PACT Act.","Advocated for mental health funding; H.R. 1009/S. 1102, Mental Health Services for Students Act\n; improvements to the Child Abuse Prevention and Treatment Act (H.R. 2076); Children's GME; funding for NIH pediatric research; reauthorization of PCORI PEDSnet program; increased funding for sickle cell research; and funding for Trans-NIH Pediatric Consortium (N-PERC). H.R. 4159, PACT Act.","Funding for NIH research; H.R. 4159, PACT Act.","Advocated for mental health funding; improvements to the Child Abuse Prevention and Treatment Act (H.R. 2076); Children's GME; funding for NIH pediatric research; COVID-19 funding for children's hospitals; and funding for Trans-NIH Pediatric Consortium (N-PERC). H.R. 4159, PACT Act.","Advocated for mental health funding; Children's GME; funding for NIH pediatric research; COVID-19 funding for children's hospitals; and funding for Trans-NIH Pediatric Consortium (N-PERC). H.R. 4159, PACT Act.","Advocated for mental health funding; improvements to the Child Abuse Prevention and Treatment Act (H.R. 2076); Children's GME; funding for NIH pediatric research; COVID-19 funding for children's hospitals; and funding for Trans-NIH Pediatric Consortium (N-PERC). H.R. 4159, PACT Act. Funding for Children's Hospitals as part of COVID-19 response.","Advocated for mental health funding; Children's GME; funding for NIH pediatric research; COVID-19 funding for children's hospitals; and funding for Trans-NIH Pediatric Consortium (N-PERC). H.R. 4159, PACT Act. Funding for Children's Hospitals as part of COVID-19 response.","Pediatricians Accelerate Childhood Therapies Act of 2021\nKids Access to Primary Care Act\nMental and Behavior Health Care Improvements for Pediatric patient population","Children's Graduate Medical Education (CHGME)\nMental and Behavioral health funding during COVID-19 Pandemic \nPediatric Pandemic National Coordinating Network"],"years":[2018,2019,2020,2021,2022,2024,2025]}