{"id":201878,"name":"SEQIRUS","slug":"seqirus","state":"NJ","description":"pharmaceutical company","totalSpending":1170000,"filings":26,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":135000},{"year":2020,"income":180000},{"year":2021,"income":180000},{"year":2022,"income":180000},{"year":2024,"income":135000},{"year":2025,"income":180000}],"firms":["SL STRATEGIES, LLC"],"lobbyists":["SARA LOVE RAWLINGS","JORDAN TENENBAUM","MARY JOHNSON"],"issues":["HCR","BUD","DEF"],"sampleDescriptions":["Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2018. Fiscal Year 2019 Labor, HHS and Education Appropriations bills.","Fiscal Year 2018 Labor, HHS, and Education Appropriations bills. Fiscal Year 2019 Labor, HHS, and Education Appropriations bills.","Fiscal Year 2019 Labor, HHS, and Education Appropriations bills.","Fiscal Year 2019 Labor, HHS and Education Appropriations bills.","Fiscal Year 2019 Labor, HHS and Education Appropriations bills. Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2018.","Fiscal Year 2020 Labor, Health and Human Services, Education and Related Agencies Appropriations Bills","Fiscal Year 2021 Labor, Health and Human Services, Education and Related Agencies Appropriations Bills","Fiscal Year 2022 Labor, HHS, Education and Related Agencies Appropriations bills; Covid manufacturing supply chain issues","Fiscal Year 2022 Labor, HHS, Education and Related Agencies Appropriations bill; Fiscal Year 2022 DOD Appropriations bills","National Influenza Vaccine Modernization Strategy within DoD","Fiscal Year 2022 Labor, HHS, Education and Related Agencies Appropriations bill; Fiscal Year 2022 DOD Appropriations bill","H.R.2471, Consolidated Appropriations Act, 2022; S. 3799, PREVENT Pandemics Act","Fiscal Year 2023 LHHS Appropriations Bills","S. 3799, PREVENT Pandemics Act","Fiscal Year 2024 and Fiscal Year 2025 HHS Appropriations bills; H5N1 influenza response","Pandemic All Hazards Preparedness Act reauthorization; policies impacting preparedness for and response to seasonal and pandemic influenza","Fiscal Year 2025 HHS Appropriations bills; H5N1 influenza response","Fiscal Year 2025 HHS Appropriations bills; specifically provisions related to seasonal influenza and H5N1 pandemic response.","Fiscal Year 2025 HHS Appropriations bills","Response to the H5N1 influenza outbreak"],"years":[2018,2019,2020,2021,2022,2024,2025]}