{"id":124968,"name":"SHAKOPEE MDEWAKANTON DAKOTA (SIOUX) COMMUNITY","slug":"shakopee-mdewakanton-dakota-sioux-community","state":"MN","description":null,"totalSpending":2550000,"filings":27,"yearlySpending":[{"year":2018,"income":130000},{"year":2019,"income":310000},{"year":2020,"income":410000},{"year":2021,"income":160000},{"year":2022,"income":230000},{"year":2023,"income":540000},{"year":2024,"income":650000},{"year":2025,"income":120000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["PHILIP BAKER-SHENK","KAYLA GEBECK","JAMES MEGGESTO","KENNETH PARSONS","CAMRYN TOWLE","CHASE GERMANN","PARKER REYNOLDS","SCOTT MASON","DENNIS POTTER","CHRISTOPHER JAARDA"],"issues":["IND",null],"sampleDescriptions":["Tribal self government; land and natural resources; gaming; fee-to-trust issues; S.140, S.248 & H.R. 511, Tribal Labor Sovereignty Act; transportation policies; government to government consultation; UAS policy; tax policy; Farm Bill policy; S.1405, FAA Reauthorization Act; gaming management; H.R. 2, S.3042, Agriculture Improvement Act of 2018.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; S.140, S.248 & H.R. 511, Tribal Labor Sovereignty Act; transportation policies; government to government consultation; UAS policy; tax policy; Farm Bill policy; gaming management.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; Tribal Labor Sovereignty Act; transportation policies; government to government consultation; UAS policy; tax policy; Farm Bill policy and implementation; gaming management; H.R. 2810, Tax Fairness for Tribal Youth Act of 2019.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; Tribal Labor Sovereignty Act; transportation policies; government to government consultation; UAS policy; tax policy; Farm Bill policy and implementation; gaming management; H.R. 2810, Tax Fairness for Tribal Youth Act of 2019; CARES Act; coronavirus relief.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; CARES Act; coronavirus relief; paycheck protection program implementation; education policy.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; CARES Act; coronavirus relief; paycheck protection program implementation; education policy; Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; CARES Act; coronavirus relief; education policy; Consolidated Appropriations Act implementation; American Rescue Plan Act of 2021 enactment and implementation.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; coronavirus relief; American Rescue Plan Act of 2021 enactment and implementation; labor management.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; coronavirus relief; American Rescue Plan Act of 2021 enactment and implementation; Infrastructure Investment and Jobs Act implementation.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; coronavirus relief; Infrastructure Investment and Jobs Act implementation; Native Farm Bill Coalition priority issues.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; Infrastructure Investment and Jobs Act implementation; Native Farm Bill Coalition priority issues; congressionally directed spending.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; Infrastructure Investment and Jobs Act implementation; Native Farm Bill Coalition priority issues; congressionally directed spending; 2023 Farm Bill development.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; Native Farm Bill Coalition priority issues; congressionally directed spending; Farm Bill development; implementation of storm water management.","Tribal self government; land and natural resources; gaming; fee-to-trust issues; government to government consultation; tax policy; gaming management; Native Farm Bill Coalition priority issues; congressionally directed spending; Farm Bill development; energy conservation, generation and woodland restoration.","Tax reform; CIRCIA reporting requirements; confirmation of nomination to chair National Indian Gaming Commission; anti-money laundering; farm bill provisions; food distribution program and SNAP eligibility; FY 2025 appropriations; farm credit reform proposals; forest land transfer; meat processing and inspection proposals; wild rice protection proposals; forest protection proposals.","Tax reform and tribally chartered corporations; CISA and CIRCIA reporting requirements; confirmation of nomination to chair National Indian Gaming Commission; anti-money laundering; farm bill provisions; food distribution program and SNAP eligibility; farm credit reform proposals; forest land transfer; meat processing and inspection proposals; wild rice protection proposals; forest protection proposals; fee to trust policy and procedure; criminal justice and jurisdiction in Indian Country; 48C tax credit.","Tribal Labor Sovereignty Act legislation; Farm Bill legislation; fee to trust; tribally chartered corporations; gaming eligibility determinations; funding freeze and personnel cuts; nominations and confirmations.","Tribal Labor Sovereignty Act legislation; nominations and confirmations.","Tribal Labor Sovereignty Act legislation."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}