{"id":179439,"name":"SHELL USA, INC.","slug":"shell-usa-inc","state":"DC","description":"&#226;€‹Energy and petrochemicals company","totalSpending":1140000,"filings":20,"yearlySpending":[{"year":2019,"income":150000},{"year":2020,"income":200000},{"year":2021,"income":100000},{"year":2022,"income":230000},{"year":2024,"income":240000},{"year":2025,"income":220000}],"firms":["MINDSET ADVOCACY, LLC"],"lobbyists":["BRANT IMPERATORE","COURTNEY TAYLOR","PORTER BYERS","RICK DEARBORN","DANA GRESHAM","WILLIAM MUELLER","DWAYNE BOLTON","ZACHARY OSTRO","SARAH ALEXANDER"],"issues":["TRD","ENV","ENG","IMM","LBR","TAX","HOM","DEF"],"sampleDescriptions":["General issues related to trade policy and trade agreements; \nissues regarding ratification of the U.S.-Mexico-Canada Agreement (USMCA); \nissues related to domestic content requirements; issues related to tariffs, including steel and supply issues, and issues related to Sections 232 and 301 of the US Trade Act; \nissues related to Customs and Border Patrol.","Issues related to US Army Corps of Engineers permitting","General offshore energy; general offshore access and resource potential issues, including DOI's 5 year leasing program and Eastern Gulf of Mexico access; issues related to the development of offshore wind, and issues related to the storage of ethane.","Issues related to US Army Corps of Engineers permitting, storage of methane, issues related to offshore wind and other renewables","General offshore energy; general offshore access and resource potential issues, including DOI's 5 year leasing program and Eastern Gulf of Mexico access","General offshore energy; general offshore access and resource potential issues, including DOI's 5 year leasing program and Eastern Gulf of Mexico access; CARES Act (S. 3548)","Entry into United States for essential personnel","Issues related to US Army Corps of Engineers permitting, issues related to offshore wind and other clean energy","General offshore energy; general offshore access and resource potential issues, including DOI's 5 year leasing program and Eastern Gulf of Mexico access; CARES Act (S. 3548), H.R. 6395, National Defense Authorization Act for Fiscal Year 2021","General issues related to trade policy and trade agreements;\nissues related to domestic content requirements; issues related to tariffs, including supply line issues, and issues related to Sections 232 and 301 of the US Trade Act.","Energy infrastructure; Biden Administration pause on oil and gas leasing and permitting","Energy infrastructure; Biden Administration pause on oil and gas leasing and permitting; OCS Five-Year Plan","Energy infrastructure; Biden Administration pause on oil and gas leasing and permitting; OCS Five-Year Plan Bipartisan Infrastructure Law implementation","Issues related to US Army Corps of Engineers permitting, issues related to offshore wind and other clean energy Offshore energy permitting issues (National Marine Fisheries Service)","General issues related to trade policy and trade agreements; issues related to domestic content requirements; issues related to tariffs, including supply line issues, and issues related to Sections 232 and 301 of the US Trade Act.","H.R. 6865, Coast Guard Authorization Act of 2022","Issues related to US Army Corps of Engineers permitting, issues related to offshore wind and other clean energy Offshore energy permitting issues (National Marine Fisheries Service) Taking and Importing Marine Mammals; Taking Marine Mammals Incidental to Geophysical Surveys Related to Oil and Gas Activities in the Gulf of Mexico.","General corporate tax issues and windfall profit tax","General corporate tax issues","Homeland Security, CISA critical infrastructure incident reporting, DOE/PHMSA cyber regulations."],"years":[2019,2020,2021,2022,2024,2025]}