{"id":125453,"name":"SIX CONTINENTS HOTELS, INC. D/B/A IHG HOTELS & RESORTS","slug":"six-continents-hotels-inc-d-b-a-ihg-hotels-resorts","state":"GA","description":"Hotel Company","totalSpending":1760000,"filings":26,"yearlySpending":[{"year":2018,"income":150000},{"year":2019,"income":150000},{"year":2020,"income":260000},{"year":2021,"income":260000},{"year":2022,"income":290000},{"year":2024,"income":320000},{"year":2025,"income":330000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["JOEL ROBERSON","CHRISTOPHER DELACY","MARISSA SERAFINO","DIMITRIOS KARAKITSOS","KERRY FEEHERY","SCOTT MASON","CHRISTOPHER ARMSTRONG","PAUL BOCK","SHAWNA FRANCIS WATLEY","KARL KOCH","KATHRYN LEHMAN","JODI CHANDLER","BETH VIOLA","PAOLO MASTRANGELO","NICOLE ELLIOTT","TODD WOOTEN","ISABEL LANE","CAMRYN TOWLE","DANIEL SENNOTT","KAYLA GEBECK","PARKER REYNOLDS","ELIZABETH CRADDOCK","MISHA LEHRER","JOSHUA ODINTZ","ISABELLA LINDEN","DENNIS POTTER"],"issues":["DEF","TAX","IMM","TOU","LBR","ENV"],"sampleDescriptions":["Issues relating to DOD long-tem per diem in the National Defense Authorization Act; issues relating to DOD on-base lodging.","Issues related to the IRS final rule on \"Treatment of Certain Interests in Corporations as Stock or Indebtedness\" (Section 385 rule); Issues relating to implementation of comprehensive tax reform.","Comprehensive immigration reform; Deferred Action for Childhood Arrivals (DACA); seasonal worker visas.","Support for travel and tourism to United States hotels and resorts; H.R. 2495 and S.1164, the Stop Online Booking Scams Act.","Issues relating to the National Labor Relations Board joint employer decision; H.R. 3441, the \"Save Local Business Act.\"","Issues relating to DOD long-term per diem and DOD on-base lodging in the National Defense Authorization Act (H.R. 5515, S.2987); The U.S. Army Privatized Army Lodging (PAL) program.","Comprehensive immigration reform; Deferred Action for Childhood Arrivals (DACA); visas for international travel to the United States.","Support for travel and tourism to United States hotels and resorts; H.R. 2495 and S.1164, the Stop Online Booking Scams Act; Department of Commerce Investment Advisory Council; Federal per diem policy for short-term rentals.","Issues relating to the National Labor Relations Board joint employer decision; H.R. 3441, the \"Save Local Business Act\"; H.R. 6695, the Trademark Licensing Protection Act.","Support for travel and tourism to United States hotels and resorts; online hotel booking scams;  Department of Commerce Investment Advisory Council; Federal per diem policy for short-term rentals.","Issues relating to the National Labor Relations Board joint employer decision.","Issues relating to DOD on-base lodging; The U.S. Army Privatized Army Lodging (PAL) program.","Issues relating to DOD on-base lodging; the U.S. Army Privatized Army Lodging (PAL) program.","Support for travel and tourism to United States hotels and resorts; online hotel booking scams; Federal per diem policy for short-term rentals; human trafficking prevention.","Issues relating to DOD on-base lodging; the U.S. Army Privatized Army Lodging (PAL) program; Section 2824 of Senate National Defense Authorization Act (S.1790).","Support for travel and tourism to United States hotels and resorts; online hotel booking scams; Federal per diem policy for short-term rentals; human trafficking prevention; federal economic relief for hotels impacted by COVID-19 pandemic, including the Coronavirus Aid, Relief, and Economic Security Act (CARES Act; Public Law 116-136).","Sustainability and energy efficiency of commercial buildings.","Support for travel and tourism to United States hotels and resorts; federal economic relief for hotels impacted by COVID-19 pandemic, including implementation of the Coronavirus Aid, Relief, and Economic Security Act (CARES Act; Public Law 116-136); federal per diem rates impacted by the COVID-19 pandemic.","Issues relating to the employee retention tax credit; issues relating to tax credits for COVID-19 cleaning and sanitation.","Support for travel and tourism to United States hotels and resorts; federal economic relief for hotels impacted by COVID-19 pandemic, including implementation of the Coronavirus Aid, Relief, and Economic Security Act (CARES Act; Public Law 116-136); federal per diem rates impacted by the COVID-19 pandemic; liability protections for businesses that follow COVID-19 health guidelines; unemployment insurance for furloughed hotel employees."],"years":[2018,2019,2020,2021,2022,2024,2025]}