{"id":204916,"name":"SK HYNIX AMERICA INC.","slug":"sk-hynix-america-inc","state":"DC","description":"Energy, technology, telecom.","totalSpending":1950000,"filings":16,"yearlySpending":[{"year":2020,"income":220000},{"year":2021,"income":560000},{"year":2022,"income":520000},{"year":2023,"income":560000},{"year":2024,"income":90000}],"firms":["INVARIANT LLC"],"lobbyists":["NICOLE VENABLE","JOEY SMITH","LANDON STROPKO","MARK FRIEDMANN","VENKATASATYA KROVI","KENNY ROBERTS","KEVIN WALSH","SAMUAL LOVE","ANNIE D'AMATO","CHRISTOPHER GILLOTT"],"issues":["TRD","ENV","ENG","SCI","PHA",null],"sampleDescriptions":["General trade and investment issues.","Discuss general trade and investment issues.","Discuss SK as a resource on environmental issues.","Monitor discussions on electric vehicles.","Monitor proposals on semiconductors, including S.1260, U.S. Innovation and Competition Act.","Monitor proposals and issues related to biopharmaceuticals.","Monitor proposals and supply chain issues related to semiconductors.","Educate policymakers on electric vehicles and monitor legislative proposals.","Educate on proposals and supply chain issues related to semiconductors.","Discuss SK as a resource on environmental issues. Monitor legislation and rulemakings regarding electric vehicle batteries and recycling.","Discuss SK as a resource on environmental issues. Monitor rulemakings regarding electric vehicle batteries and recycling.","Educate policymakers on electric vehicles and monitor legislative proposals. Monitor rulemakings regarding electric vehicle batteries.","Educate on proposals and supply chain issues related to semiconductors. Monitor passage and implementation of P.L. 117-167, CHIPS and Science Act.","Educate policymakers on electric vehicles and monitor legislative proposals. Monitor P.L. 117-169, Inflation Reduction Act and rulemakings regarding electric vehicle batteries.","Discuss SK as a resource on environmental issues. Monitor P.L. 117-169, Inflation Reduction Act and rulemakings regarding electric vehicle batteries and recycling.","Monitor proposals and issues related to biopharmaceuticals such as S.3799, PREVENT Pandemics Act, and H.R. 834, PREPARE Act.","Educate policymakers on electric vehicles and monitor legislative proposals. Monitor the implementation of P.L.117-58, the Infrastructure Investment and Jobs Act, and P.L.117-169, the Inflation Reduction Act, particularly rulemakings regarding electric vehicle batteries.","Discuss SK as a resource on environmental issues. Monitor implementation of P.L.117-58, the Infrastructure Investment and Jobs Act and P.L.117-169, Inflation Reduction Act, particulaly rulemakings and opportunities regarding electric vehicle batteries and recycling.","Monitor proposals and issues related to semiconductors and artificial intelligence (AI).","Monitor proposals and issues related to biopharmaceuticals. Educate policymakers on SK Pharmteco's active pharmaceutical ingredient manufacturing capabilities."],"years":[2020,2021,2022,2023,2024]}