{"id":209306,"name":"SKYDIO, INC.","slug":"skydio-inc","state":"CA","description":"Drone manufacturer that uses artificial intelligence for consumer, enterprise, and gov't.","totalSpending":1630000,"filings":20,"yearlySpending":[{"year":2021,"income":140000},{"year":2022,"income":330000},{"year":2023,"income":360000},{"year":2024,"income":360000},{"year":2025,"income":440000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["JOEL ROBERSON","LESLIE POLLNER","MICHAEL FRIEDBERG","JENNY BUSBY","DANIEL SENNOTT","MISHA LEHRER","THOMAS STORY","EMMA EKMAN","KATHRYN LEHMAN","KARL KOCH","CHRISTOPHER SENN","PETER TABOR","ISABELLA LINDEN","THOMAS FREEMAN","BENJAMIN YEPEZ"],"issues":["TRA","AER","DEF",null,"HOM"],"sampleDescriptions":["Support the use of drones for infrastructure inspections and low-attitude beyond visual line of sight operations.","Support the use of drones for infrastructure inspections; American Jobs Plan.","Support the use of drones for infrastructure inspections; American Jobs Plan provisions related to critical infrastructure inspections; funding for the FAA Unmanned Aircraft Systems Collegiate Training Initiative.","Support the use of drones for infrastructure inspections and funding for the FAA Unmanned Aircraft Systems Collegiate Training Initiative (H.R. 5315, the Drone Infrastructure Inspection Grant Act); Bipartisan Infrastructure Framework provisions related to critical infrastructure inspections (H.R. 3684, the Infrastructure Investment and Jobs Act).","Support the use of drones for infrastructure inspections and funding for the Federal Aviation Administration (FAA) Unmanned Aircraft Systems Collegiate Training Initiative (H.R. 5315, the Drone Infrastructure Inspection Grant Act); implementation of the Infrastructure Investment and Jobs Act provisions related to infrastructure inspections and construction (H.R. 3684); FAA reorganization.","Support the use of drones for infrastructure inspections and funding for the Federal Aviation Administration (FAA) Unmanned Aircraft Systems Collegiate Training Initiative (H.R. 5315, the Drone Infrastructure Inspection Grant Act); implementation of the Infrastructure Investment and Jobs Act provisions related to infrastructure inspections, construction and drone security (Public Law 117-58); FAA reorganization; beyond visual line of sight operation of drones; Fiscal Year 2023 appropriations for the Federal Aviation Administration.","DOD acquisition of small drones; drone security issues; Fiscal Year 2023 appropriation for the Department of Defense; Fiscal Year 2023 National Defense Authorization Act.","Support the use of drones for infrastructure inspections and funding for the Federal Aviation Administration (FAA) Unmanned Aircraft Systems Collegiate Training Initiative (H.R. 5315, the Drone Infrastructure Inspection Grant Act); implementation of the Infrastructure Investment and Jobs Act provisions related to infrastructure inspections, construction and drone security (Public Law 117-58); FAA reorganization; beyond visual line of sight operation of drones; Fiscal Year 2023 appropriations for the Federal Aviation Administration (H.R. 8294); U.S. Coast Guard short-range drone program.","DOD acquisition of small drones; drone national security issues; Fiscal Year 2023 appropriation for the Department of Defense (H.R. 8236); Fiscal Year 2023 National Defense Authorization Act (H.R. 7900).","Support the use of drones for infrastructure inspections and drone workforce training through the Federal Aviation Administration (FAA) Unmanned Aircraft Systems Collegiate Training Initiative; the Drone Infrastructure Inspection Grant Act (H.R. 5315 and S. 4744); implementation of the Infrastructure Investment and Jobs Act (Public Law No: 117-58) provisions related to ports (Section 11402) and SMART grants (Section 25005); FAA reorganization; beyond visual line of sight operation of drones; Fiscal Year 2023 appropriations for the Federal Aviation Administration (H.R. 8294 and 4670); U.S. Coast Guard short-range drone program; Coast Guard Reauthorization Act of 2022 provisions on drones (S. 4802).","DOD acquisition of small drones; drone national security issues; Fiscal Year 2023 appropriation for the Department of Defense (H.R. 8236 and S. 4663); Fiscal Year 2023 National Defense Authorization Act (H.R. 7900 and S. 4543).","Support the use of drones for infrastructure inspections; drone workforce training through the Federal Aviation Administration (FAA) Unmanned Aircraft Systems Collegiate Training Initiative; the Drone Infrastructure Inspection Grant Act (H.R. 5315 and S. 4744); implementation of the Infrastructure Investment and Jobs Act (Public Law No: 117-58) provisions related to SMART grants (Section 25005); FAA reorganization; beyond visual line of sight operation of drones; Fiscal Year 2023 appropriations for the Federal Aviation Administration in the Fiscal Year 2023 Consolidated Appropriations Act (Public Law 117-328); U.S. Coast Guard short-range drone program; Coast Guard Reauthorization Act of 2022 provisions on drones (S. 4802).","DOD acquisition of small drones; drone national security issues; Fiscal Year 2023 appropriation for the Department of Defense (H.R. 8236 and S. 4663); Fiscal Year 2023 National Defense Authorization Act (Public Law 117-263); U.S. Coast Guard short-range drone program; Coast Guard Reauthorization Act of 2022 provisions on drones (S. 4802).","Support the use of unmanned aircraft systems for infrastructure inspections; the Drone Infrastructure Inspection Grant Act (H.R. 3593 and S. 1817); implementation of the Infrastructure Investment and Jobs Act (Public Law No: 117-58) provisions related to SMART grants (Section 25005); Department of Transportation contracts and grants for drones; beyond visual line of sight operation of drones; automation in aviation; beyond visual line of sight operation of drones; drone provisions in the H.R. 3935, the Securing Growth and Robust Leadership in American Aviation Act, and S. 1939, the FAA Reauthorization Act of 2023; Fiscal Year 2025 appropriations for the Federal Aviation Administration; U.S. Coast Guard reauthorization and short-range drone program; implementation of the Coast Guard Reauthorization Act of 2022 provisions on drones (Public Law 117-263).","DOD acquisition of small drones; drone national security issues; Fiscal Year 2025 appropriation for the Department of Defense; Fiscal Year 2025 National Defense Authorization Act; DOD Replicator Initiative; U.S. Coast Guard short-range drone program; implementation of the Coast Guard Reauthorization Act of 2022 provisions on drones (Public Law 117-263).","Support the use of unmanned aircraft systems for infrastructure inspections; implementation of the Infrastructure Investment and Jobs Act (Public Law No: 117-58) provisions related to SMART grants (Section 25005); Department of Transportation acquisition, contracts and grants for drones; beyond visual line of sight operation of drones; automation in aviation; beyond visual line of sight operation of drones; implementation of the drone infrastructure inspection grant program provision in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); drone provisions in the Fiscal Year 2025 appropriations for the Federal Aviation Administration (H.R. 9028); U.S. Coast Guard reauthorization and short-range drone program; implementation of the Coast Guard Reauthorization Act of 2022 provisions on drones (Public Law 117-263).","DOD acquisition of small unmanned aircraft systems; drone national security issues; drone provisions in the Fiscal Year 2025 appropriation for the Department of Defense (H.R. 8774); Fiscal Year 2025 National Defense Authorization Act (H.R. 8070 and S. 4638); DOD Replicator Initiative; U.S. Coast Guard short-range drone program; implementation of the Coast Guard Reauthorization Act of 2022 provisions on drones (Public Law 117-263).","Support the use of unmanned aircraft systems for infrastructure inspections; implementation of the Infrastructure Investment and Jobs Act (Public Law No: 117-58) provisions related to SMART grants (Section 25005); Department of Transportation acquisition, contracts and grants for drones; beyond visual line of sight (BVLOS) operation of drones; automation in aviation; implementation of the Drone Infrastructure Inspection Grant (DIIG) program provision in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); drone provisions in the Fiscal Year 2025 Transportation, Housing and Urban Development Appropriations bill (H.R. 9028 and S. 4796); drone provisions in the Fiscal Year 2025 Homeland Security Appropriations bill (H.R. 8752); U.S. Coast Guard reauthorization and short-range drone program; implementation of the Coast Guard Reauthorization Act of 2022 provisions on drones (Public Law 117-263).","DOD acquisition of small unmanned aircraft systems; drone national security issues; drone provisions in the Fiscal Year 2025 appropriation for the Department of Defense (H.R. 8774 and S. 4921); Fiscal Year 2025 National Defense Authorization Act (H.R. 8070 and S. 4638); DOD Replicator Initiative; U.S. Coast Guard short-range drone program; implementation of the Coast Guard Reauthorization Act of 2022 provisions on drones (Public Law 117-263).","Support the use of unmanned aircraft systems for infrastructure inspections; implementation of the Infrastructure Investment and Jobs Act (Public Law No: 117-58) provisions related to SMART grants (Section 25005); Department of Transportation acquisition, contracts and grants for drones; beyond visual line of sight (BVLOS) operation of drones; automation in aviation; implementation of the Drone Infrastructure Inspection Grant (DIIG) program provision in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); drone provisions in the Fiscal Year 2025 Transportation, Housing and Urban Development Appropriations bill (H.R. 9028 and S. 4796); drone provisions in the Fiscal Year 2025 Homeland Security Appropriations bill (H.R. 8752)."],"years":[2021,2022,2023,2024,2025]}