{
  "id": 205692,
  "name": "SKYDWELLER AERO INC.",
  "slug": "skydweller-aero-inc",
  "state": "VA",
  "description": "US aerospace company with offices/facilities in the US and Spain",
  "totalSpending": 2050000,
  "filings": 19,
  "yearlySpending": [
    {
      "year": 2020,
      "income": 220000
    },
    {
      "year": 2021,
      "income": 360000
    },
    {
      "year": 2022,
      "income": 480000
    },
    {
      "year": 2023,
      "income": 562500
    },
    {
      "year": 2024,
      "income": 427500
    }
  ],
  "firms": [
    "CAPITOL 6 ADVISORS"
  ],
  "lobbyists": [
    "CHRIS COX",
    "PHILIP HOON",
    "DAVID LEHMAN",
    "STEPHANIE GADBOIS"
  ],
  "issues": [
    "AVI",
    "DEF",
    "AGR",
    "BUD",
    "SCI",
    "TEC",
    "HOM",
    null
  ],
  "sampleDescriptions": [
    "Issues related to renewable technology aircraft with commercial, defense, homeland security, forest service and other government applications; FY 21 National Defense Authorization and FY 21 Department of Defense (DoD) Appropriations.",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security, forest service and other government applications; FY 21 Department of Defense (DoD) Appropriations and H.R.6395/S.4049, National Defense Authorization Act for Fiscal Year 2021.",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security, forest service and other government applications; FY 21 Department of Defense (DoD) Appropriations, H.R.6395/S.4049, National Defense Authorization Act for Fiscal Year 2021, and H.R.133, Making consolidated appropriations for the fiscal year ending September 30, 2021, providing coronavirus emergency response and relief, and for other purposes (P.L.116-260).",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security, forest service and other government applications; FY22 Department of Defense Appropriations; FY22 National Defense Authorization Act.",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security, forest service and other government applications; FY22 Department of Defense Appropriations Act (H.R.4432); FY22 National Defense Authorization Act (H.R.4350/S.2792).",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security, forest service and other government applications; FY2022 Department of Defense Appropriations Act (H.R.4432, S.3023); FY2022 National Defense Authorization Act (H.R.4350, S.2792, P.L.117-81).",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security and other government applications; FY2022 Department of Defense Appropriations Act (H.R.4432, S.3023); FY2023 National Defense Authorization Act; FY2023 Department of Defense Appropriations Act.",
    "Issues related to renewable technology aircraft with commercial, defense, homeland security and other government applications; FY2022 Department of Defense Appropriations Act (H.R.4432, S.3023); FY2023 National Defense Authorization Act; FY2023 Department of Defense Appropriations Act .",
    "FY2024 National Defense Authorization Act",
    "FY2024 Department of Defense Appropriations Act",
    "FY2025 National Defense Authorization Act",
    "FY2025 Department of Defense Appropriations Act"
  ],
  "years": [
    2020,
    2021,
    2022,
    2023,
    2024
  ],
  "growthRate": 94,
  "trajectory": "growing",
  "yearsActive": 5,
  "avgAnnualSpending": 410000,
  "peakYear": 2023,
  "lobbyistCount": 4,
  "firmCount": 1,
  "issueCount": 7
}