{
  "id": 52086,
  "name": "SMALL UAV COALITION",
  "slug": "small-uav-coalition",
  "state": "DC",
  "description": "Trade Association representing unmanned aircraft system manufacturers and operators",
  "totalSpending": 1800000,
  "filings": 11,
  "yearlySpending": [
    {
      "year": 2022,
      "income": 340000
    },
    {
      "year": 2023,
      "income": 680000
    },
    {
      "year": 2024,
      "income": 160000
    },
    {
      "year": 2025,
      "income": 280000
    }
  ],
  "firms": [
    "DGA GROUP GOVERNMENT RELATIONS LLC"
  ],
  "lobbyists": [
    "LARA TENNYSON",
    "MARGEAUX PLAISTED",
    "MICHAEL DROBAC",
    "GREGORY WALDEN",
    "BRETT SCOTT",
    "ADRIANA SANTONI VICENS",
    "MAGGIE KLAU"
  ],
  "issues": [
    "AVI",
    null
  ],
  "sampleDescriptions": [
    "Implementation of drone provisions in FAA Reauthorization Act of 2018; FY 2023 THUD appropriations: report language and proposed report language on drones; FAA realignment proposal in reprogramming request and FY 23 budget proposal; draft legislative proposal for FAA realignment of UAS functions; S. 73, American Security Drone Act, included in S. 1260, U.S. Innovation and Competition Act and H.R. 4521, America COMPETES Act; FAA type certification for drones; implementation of BVLOS Aviation Rulemaking; S. 3542, Drone Act of 2022; section 2209 rulemaking; H.R. 6489, Infrastructure Grant Security Act;",
    "Implementation of drone provisions in FAA Reauthorization Act of 2018; FY 2022 THUD appropriations and report language relating to drones; S. 73, American Security Drone Act, including in S. 1260, US Innovation and Competition Act and H.R. 4521, America COMPETES Act; FAA reprogramming request, drone provisions; FAA type certification for drones; S. 3542, Drone Act of 2022; Implementation of BVLOS Aviation Rulemaking Committee report and recommendations; Federal Aviation Administration Reauthorization proposal; White House AAM and Drone Summit August 2022; H.R. 5315 & S. 4744, the Drone Infrastructure Inspection Grant (DIIG) Act; S. 4687, Safeguarding the Homeland from the Threats Poses by Unmanned Aircraft Systems Act of 2022; S. 4801, Stopping Harmful Incidents to Enforce Lawful Drone Use (SHIELD U) Act; H.R. --, Counter-UAS Authorities Extension and Transparency Enhancement Act of 2022; Continuing Resolution - H.R. 6833 - counter-UAS provisions",
    "Implementation of drone provisions in FAA Reauthorization Act of 2018; FY 2023 THUD appropriations and report language relating to drones; FAA type certification for drones; S. 3542, Drone Act of 2022; Implementation of BVLOS Aviation Rulemaking Committee report and recommendations; Federal Aviation Administration Reauthorization legislative proposals; H.R. 5315 & S. 4744, the Drone Infrastructure Inspection Grant (DIIG) Act; S. 4687, Safeguarding the Homeland from the Threats Poses by Unmanned Aircraft Systems Act of 2022; S. 4801, Stopping Harmful Incidents to Enforce Lawful Drone Use (SHIELD U) Act; H.R. --, Counter-UAS Authorities Extension and Transparency Enhancement Act of 2022; Continuing Resolution - H.R. 6833 and omnibus appropriation - counter-UAS provisions and American Security Drone Act; Beyond Visual Line of Sight approvals process legislative proposal",
    "Implementation of drone provisions in FAA Reauthorization Act of 2018; FAA type certification for drones; Implementation of BVLOS Aviation Rulemaking Committee report and recommendations; H.R. 3935, Securing Growth & Robust Leadership in American Aviation Act (passed in July) and S. 1939, FAA Reauthorization Act of 2023 provisions and proposed amendments relating to drones; counter-drone legislative and executive proposals; Proposals for inclusion in FY 2025 THUD appropriations bill, including funding for DIIG program and ADS-B equipage.",
    "Implementation of drone provisions in FAA Reauthorization Act of 2018 and FAA Reauthorization Act of 2024; FAA type certification for drones; type and airworthiness certification and other approvals Implementation of BVLOS Aviation Rulemaking Committee report and recommendations; FY 2025 THUD appropriations H.R. 9028 and S. 4796, drone provisions, including funding for DIIG program and ADS-B equipage; National Defense Authorization Act, S. 4638 and H.R. 8070, counter-UAS provisions; H.R. 8610, Counter-UAS Authority Security, Safety Reauthorization Act.",
    "Implementation of drone provisions in FAA Reauthorization Act of 2018 and FAA Reauthorization Act of 2024; type and airworthiness certification and other approvals; implementation of BVLOS Aviation Rulemaking Committee report and recommendations; environmental process streamlining; FY 26 THUD appropriations: funding for Drone Infrastructure Inspection Grant (DIIG) program, drone workforce training grant program, and ADS-B equipage rebate program; counter-UAS legislative proposals; unidentified aircraft flights over New Jersey and other states; nomination of Michael Kratsios; S. 663, DEFENSE Act; H.R. 1058, Directing Resources for Officers Navigating Emergencies (DRONE) Act, H.R. 1907, Defense Against Drones Act",
    "Implementation of drone provisions in FAA Reauthorization Act of 2018 and FAA Reauthorization Act of 2024; type and airworthiness certification and other approvals; implementation of BVLOS Aviation Rulemaking Committee report and recommendations; environmental process streamlining; FY 26 THUD appropriations: funding for Drone Infrastructure Inspection Grant (DIIG) program, drone workforce training grant program, and ADS-B equipage rebate program; counter-UAS legislative proposals; unidentified aircraft flights over New Jersey and other states; S. 663, DEFENSE Act; H.R. 1058, Directing Resources for Officers Navigating Emergencies (DRONE) Act, H.R. 1907, Defense Against Drones Act"
  ],
  "years": [
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -18,
  "trajectory": "stable",
  "yearsActive": 4,
  "avgAnnualSpending": 365000,
  "peakYear": 2023,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 1
}