{
  "id": 125583,
  "name": "SMITHFIELD FOODS, INC.",
  "slug": "smithfield-foods-inc",
  "state": "VA",
  "description": "Pork processor and hog producer",
  "totalSpending": 5300000,
  "filings": 22,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 460000
    },
    {
      "year": 2020,
      "income": 690000
    },
    {
      "year": 2021,
      "income": 690000
    },
    {
      "year": 2022,
      "income": 690000
    },
    {
      "year": 2023,
      "income": 920000
    },
    {
      "year": 2024,
      "income": 1040000
    },
    {
      "year": 2025,
      "income": 810000
    }
  ],
  "firms": [
    "HOLLAND & KNIGHT LLP"
  ],
  "lobbyists": [
    "BETH VIOLA",
    "RICHARD GOLD",
    "JOEL ROBERSON",
    "SHAWNA FRANCIS WATLEY",
    "CHRISTOPHER DELACY",
    "KATHRYN LEHMAN",
    "KERRY FEEHERY",
    "PAUL BOCK",
    "KAYLA GEBECK",
    "CHRISTOPHER ARMSTRONG",
    "SCOTT MASON",
    "KARL KOCH",
    "TODD WOOTEN",
    "PETER TABOR",
    "MOLLY ROSS"
  ],
  "issues": [
    "TRD",
    "AGR",
    "TAX",
    "IMM",
    "FOO",
    "LBR",
    "HCR",
    "ENV",
    "TOR",
    "ENG",
    null,
    "FIN"
  ],
  "sampleDescriptions": [
    "U.S. trade policy, food safety, immigration reform.",
    "International agricultural exports; US animal disease prevention; hurricane preparedness.",
    "Issues related to pet food safety.",
    "Issues related to US-Japan Bilateral Trade Agreement; US-China Bilateral Trade Negotiations; Action pursuant to Section 301:  Enforcement of US WTO Rights in Large Aircraft dispute; US-Mexico-Canada Agreement.",
    "Issues related to the U.S. heparin supply.",
    "Internal Revenue Code Sections 385 and 163(j);Issues related to regulations under Section 163(J) and 385, as well as the Polish Tax Treaty.",
    "Environmental issues related to agriculture.",
    "Environmental issues related to agriculture; greenhouse gas emission reduction; manure generated renewable natural gas and fertilizer.",
    "International agricultural exports; Issues related to COVID-19 in the meatpacking industry.",
    "Worker Safety issues related to COVID-19.",
    "Issues related to US-China Phase One Economic and Trade Agreement; Action pursuant to Section 301:  Enforcement of US WTO Rights in Large Aircraft dispute.",
    "Liability provisions related to COVID-19.",
    "Worker Safety issues related to COVID-19; allocation and distribution of COVID-19 vaccine for meatpacking and agriculture essential workers.",
    "Issues related to US-China Phase One Economic and Trade Agreement; Action pursuant to Section 301:  Tariff and exclusion issues related to resolution of WTO Large Aircraft dispute.",
    "Legal/workplace matters related to COVID-19 and ensuring continuity of the nations food supply.",
    "Ensuring health and safety of food workers and continuity of the nations food supply amid ongoing COVID-19 pandemic; allocation and distribution of COVID-19 vaccine for meatpacking and agriculture essential workers.",
    "International agricultural exports; Ensuring health and safety of food workers and continuity of the nations food supply amid ongoing COVID-19 pandemic; California Proposition 12.",
    "International agricultural exports; Ensuring health and safety of food workers and continuity of the nation's food supply amid ongoing COVID-19 pandemic; California Proposition 12; H.R.1393/S.300 - Justice for Black Farmers Act of 2021, Title II, Sec. 205 - Restrictions on Conveyed Land and Title V - Agricultural System Reforms.",
    "Issues related to U.S. agricultural exports.",
    "Policy issues related to renewable natural gas."
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 76,
  "trajectory": "growing",
  "yearsActive": 7,
  "avgAnnualSpending": 757143,
  "peakYear": 2024,
  "lobbyistCount": 15,
  "firmCount": 1,
  "issueCount": 11,
  "industry": "agriculture"
}