{
  "id": 137640,
  "name": "SOLAR ENERGY INDUSTRIES ASSOCIATION",
  "slug": "solar-energy-industries-association",
  "state": "DC",
  "description": "Association for solar energy and related businesses",
  "totalSpending": 2170000,
  "filings": 26,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 330000
    },
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 50000
    },
    {
      "year": 2021,
      "income": 190000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 320000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 480000
    }
  ],
  "firms": [
    "SQUIRE PATTON BOGGS"
  ],
  "lobbyists": [
    "CHESTER LOTT",
    "DAVID SCHNITTGER",
    "SARAH VILMS",
    "SAMUEL ADCOCK",
    "BILL SHUSTER",
    "REBEKAH SUNGALA",
    "THOMAS ANDREWS",
    "CAMILO DAZA MANGA"
  ],
  "issues": [
    "TRD",
    "TAX",
    "ENG",
    "BUD",
    null
  ],
  "sampleDescriptions": [
    "US International Trade Commission case on imported solar cells and modules",
    "Issues related to Solar Investment Tax Credit",
    "Issues related to Solar Investment Tax Credit and\nEnergy Storage Tax Incentive & Deployment Act (S. 1868)",
    "Issues related to Solar Investment Tax Credit\nEnergy Storage Tax Incentive & Deployment Act (S. 1868)\nSupport for Rural Energy For America Program (REAP)",
    "education concerning impacts of Sec. 201 Solar tariffs on industry",
    "Support for competitive practices in electric sector",
    "Issues related to Solar Investment Tax Credit extension and ITC stand alone storage",
    "Support for competitive practices in electric sector.\nsupport for Rural Energy for America Program",
    "Issues related to Solar Investment Tax Credit (ITC)extension and ITC storage",
    "education concerning impacts of Sec. 201 safeguard tariffs and USTR exemption for bifacial solar panels on US solar industry",
    "Education concerning impacts of Sec. 201 Solar tariffs on industry",
    "Issues related to Solar Investment Tax Credit (ITC) extension and ITC storage",
    "Advocacy for FY 23 appropriations supporting solar, energy storage and transmission",
    "Advocating for FY 25 funding of the Department of Energys Solar Energy Technologies Office: advocate for data collection within the Energy Information Administration.",
    "Issues related to Solar Investment Tax Credit (ITC) extension and ITC storage and tariffs",
    "Issues related to Solar Investment Tax Credit (ITC) and energy tax credits.",
    "Education concerning impacts of solar tariffs on industry.",
    "Issues related to Solar Investment Tax Credit (ITC), permitting and energy tax credits."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 45,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 271250,
  "peakYear": 2025,
  "lobbyistCount": 8,
  "firmCount": 1,
  "issueCount": 4,
  "industry": "energy"
}