{"id":184958,"name":"SOLUGEN, INC.","slug":"solugen-inc","state":"TX","description":"Bio-based chemical manufacturer","totalSpending":1740000,"filings":19,"yearlySpending":[{"year":2019,"income":80000},{"year":2020,"income":190000},{"year":2021,"income":350000},{"year":2022,"income":280000},{"year":2023,"income":440000},{"year":2024,"income":400000}],"firms":["INVARIANT LLC"],"lobbyists":["BENJAMIN KLEIN","ANNE MACMILLAN","ANNE PALISI","LANDON STROPKO","MARK FRIEDMANN","LOGAN HOLLERS","DENA BARON SMITH","PAUL ARCANGELI","IAN FOLEY","ADAM TARR","ELIZABETH THOMPSON","JARED SONCRANT","ANNIE D'AMATO","MORGAN VINA"],"issues":["CHM","DEF","ENV","AGR",null,"LBR","TRA"],"sampleDescriptions":["Introduce Solugens technology to policymakers","Educate Members about Solugen and discuss potential for developing cleaner, domestic chemicals for industrial processes.","Support use of bio-based corrosion control chemicals, including related provisions in H.R. 6395 / S. 4049, the National Defense Authorization Act for Fiscal Year 2021.","Support use of bio-based corrosion control chemicals, including related provisions in the FY 22 National Defense Authorization Act and the FY22 Defense Appropriations bill.","Introduce policymakers to Solugens technology to remove carbon from chemicals. Support regulatory pathway for biobased chemicals.","Introduce policymakers to Solugens technology to promote bio-based chemicals. Support regulatory pathway for bio-based chemicals.","Support use of bio-based corrosion control chemicals, including related provisions in the H.R.4350/S.2792, National Defense Authorization Act for Fiscal Year 2022, and H.R.4432, Department of Defense Appropriations Act, 2022.","Support and encourage Department of Defense funding for the use of biobased corrosion control chemicals; support the identification and prototyping of modular manufacturing for critical chemical supply chains.","Educate policymakers about Solugens technology to promote bio-based chemicals; monitor P.L.117-58, Infrastructure Investment and Jobs Act; monitor H.R.5376, Build Back Better Act and draft Senate legislation.","Support Department of Defense funding for the use of biobased corrosion control chemicals in H.R. 8236 Fiscal Year (FY) 2023 Department of Defense Appropriations bill and draft Senate legislation; support the identification and prototyping of modular manufacturing for critical chemical supply chains in H.R. 7900/S. 4543 National Defense Authorization Act for Fiscal Year 2022.","Educate policymakers about Solugen's technology to promote bio-based chemicals; monitor P.L.117-58, Infrastructure Investment and Jobs Act; monitor P.L. 117-169, Inflation Reduction Act.","Educate policymakers about Solugen's technology to promote bio-based chemicals; monitor P.L.117-58, Infrastructure Investment and Jobs Act; monitor P.L. 117-169, Inflation Reduction Act. Monitor implementation of Executive Order on Advancing Biotechnology and Biomanufacturing.","Educate policymakers about Solugen's technology; advocate for sustainable chemical research and development opportunities in the Farm Bill Reauthorization.","Support the use of bio-based chemicals in the Department of Defense; educate and advocate for domestic precursor chemical supply chains in the FY 2025 National Defense Authorization Act.","Educate policymakers about Solugen's technology to produce bio-based chemicals; monitor P.L.117-58, Infrastructure Investment and Jobs Act; monitor P.L.117-169, Inflation Reduction Act. Monitor implementation of Executive Order on Advancing Biotechnology and Biomanufacturing. Educate policymakers on Premanufacture Notice decision for glucaric acid under TSCA and on the Environmental Protection Agency's chemical review process.","Educate policymakers about Solugen's technology; advocate for 2024 Farm Bill language directing the U.S. Department of Agriculture to produce a report describing the extent to which agricultural chemical needs in the United States are reliant on foreign supply chains.","Support the use of bio-based chemicals in the Department of Defense; educate and advocate for secure supply chains in the FY 2025 National Defense Authorization Act.","Educate policymakers about Solugen's technology to produce bio-based chemicals; monitor P.L.117-58, Infrastructure Investment and Jobs Act; monitor P.L. 117-169, Inflation Reduction Act. Monitor implementation of Executive Order on Advancing Biotechnology and Biomanufacturing. Educate policymakers on the Premanufacture Notice decision for glucaric acid under TSCA and on the Environmental Protection Agency's chemical review process.","Educate policymakers about Solugen's technology to produce bio-based chemicals; monitor P.L.117-58, Infrastructure Investment and Jobs Act; monitor P.L. 117-169, Inflation Reduction Act. Monitor implementation of Executive Order on Advancing Biotechnology and Biomanufacturing. Educate policymakers on Premanufacture Notice decision for glucaric acid under TSCA and on the Environmental Protection Agency's chemical review process.","Discuss issues related to prevailing wage determinations."],"years":[2019,2020,2021,2022,2023,2024]}