{"id":139531,"name":"SOUTHERN UTE INDIAN TRIBE","slug":"southern-ute-indian-tribe","state":"CO","description":"Client is a federally-recognized Indian tribe engaged in governmental activities.","totalSpending":1999000,"filings":29,"yearlySpending":[{"year":2018,"income":340000},{"year":2019,"income":175000},{"year":2020,"income":230000},{"year":2021,"income":270000},{"year":2022,"income":290000},{"year":2023,"income":300000},{"year":2024,"income":394000}],"firms":["POWERS PYLES SUTTER & VERVILLE, P.C."],"lobbyists":["PAUL MOOREHEAD","NOOR ADHOOB","NATASHA JOHN"],"issues":["IND","ENG",null],"sampleDescriptions":["General tribal matters; Pine River Indian Irrigation Project; the IRRIGATE Act and the WIIN Act (PL 114-322) implementation; physical infrastructure; the Tribal Labor Sovereignty Act (S.63/H.R.986); trust reform; land consolidation matters; land transfers (H.R.215); Land Management System matters; and DOI reorganization matters; tax legislation (H.R.3138, S.1935), water rights (H.R.2939, S.1230); sovereign immunity (S.1948); patent reform (S.1390).","Indian energy-related legislation, including the Native American Energy Act (H.R.210) and the Indian Tribal Energy Development and Self-determination Act Amendments (S.245); and NEPA matters and shale development.","Indian energy-related legislation, including the Native American Energy Act (H.R.210) and the Indian Tribal Energy Development and Self-determination Act Amendments (S.245); and NEPA matters and shale development; Tribal Labor Sovereignty Act (H.R.986, S.63);and Farm Bill Re-authorization (H.R.2, S.3042).","General tribal matters; Pine River Indian Irrigation Project; the IRRIGATE Act and the WIIN Act (PL 114-322) implementation; physical infrastructure; the Tribal Labor Sovereignty Act (S.63/H.R.986); trust reform; land consolidation matters; land transfers (H.R.215); Land Management System matters; and DOI reorganization matters; tax legislation (H.R.3138, S.1935), water rights (H.R.2939, S.1230); sovereign immunity (S.1948).","Indian energy-related legislation, including the Native American Energy Act (H.R.210) and the Indian Tribal Energy Development and Self-determination Act Amendments (S.245); NEPA matters and shale development; Tribal Labor Sovereignty Act (H.R.986, S.63);and Farm Bill Re-authorization (H.R.2, S.3042).","Indian energy-related legislation; implementation of the Indian Tribal Energy Development and Self-determination Act; Tribal Labor Sovereignty Act (H.R.779; S.226); Farm Bill Implementation; Federal shutdown and its impacts; tribal land issues; Tribal tax provisions; FY2019 and FY2020 appropriations; DOI reorganization; land into trust policy; natural resources development; gas gathering + pipeline legislation; Pine River Indian Irrigation Project; Climate Change; Bernhardt nomination to be Interior Secretary; WIIN Act; BIA and IHS advanced appropriations bills; and Green New Deal legislation.","General tribal matters; Tribal Labor Sovereignty Act (H.R.779; S.226); Farm Bill Implementation; Federal shutdown and its impacts; tribal land issues; Tribal tax provisions; FY2019 and FY2020 appropriations; DOI reorganization; land into trust policy; natural resources development; gas gathering + pipeline legislation; Pine River Indian Irrigation Project; Climate Change; Bernhardt nomination to be Interior Secretary; WIIN Act; BIA and IHS advanced appropriations bills; and Green New Deal legislation.","Indian energy-related legislation; implementation of the Indian Tribal Energy Development and Self-Determination Act Amendments of 2017 (Pub.L.115-325); and matters relating to Tribal Energy Resource Agreement (TERAs).","General tribal matters; Tribal Labor Sovereignty Act (H.R.779; S.226); 2018 Farm Bill Implementation; tribal land issues; DOI reorganization; land into trust policy; natural resources development; Indian Programs Advance Appropriations Act (S.229 and H.R.1128); Indian Health Service Advance Appropriations Act (H.R.1135); Tax Fairness for Tribal Youth Act of 2019 (H.R.2810); Water Quality Certification Improvement Act bills (S.3303, S.1087 (115th Congress)); H.R.375, a bill to amend the Act of June 18, 1934, to reaffirm the authority of the Secretary of the Interior to take land into trust for Indian Tribes, and for other purposes; Tribal Tax and Investment Reform Act of 2019 (H.R.2484); Indian Community Economic Enhancement Act of 2019 (H.R.1937, S.212); the RESPECT Act (S.2071); implementation of the Native American Business Development, Trade Promotion and Tourism Act; the AUTOS Act (S.1211); Indian irrigation; WIIN/IRRIGATE Act implementation; and Indian Buffalo Management Act.","Implementation of the Indian Tribal Energy Development and Self-Determination Act Amendments of 2017 (Pub.L.115-325); regulations and DOI consultations relating to Tribal Energy Resource Agreement (TERAs).","General tribal matters; 2018 Farm Bill implementation; implementation of the Native American Business Development, Trade Promotion and Tourism Act; Indian Irrigation Act and related appropriations; Indian Buffalo Management Act (H.R.5153); Tribal trade and development legislation; Wildlife Corridors Conservation Act of 2019 (H.R.2795; S.1499); Tribal Wildlife Corridors Act of 2019 (S.2891); Youth Tax Fairness Act of 2019 (H.R.4728); Tax Fairness for Tribal Youth Act (H.R.2810; S.2079); Indigenous Peoples Day; Native American Millennium Challenge Demonstration Act (S.126); PROGRESS for Indian Tribes Act (S.209); HELP America Vote legislation; fiscal year 2019/2019 appropriations; Native American Housing Assistance and Self-Determination Re-authorization Act of 2019 (H.R. 5319).","General tribal matters; NEPA proposed reform; Help America Vote Act (H.R.5510); Indian Buffalo Management Act (H.R.5153); Tribal Labor Sovereignty Act (H.R.779; S.226); Community Reinvestment Act (CRA); SECURE Act; Tax Fairness for Tribal Youth Act of 2019; Tribes 638 contract language regarding criminal convictions; transportation and infrastructure legislation (S.2902); Indian Child Protection and Family Violence Prevention Act; FY2021 appropriations and related matters; Indian Child Welfare Act; Strengthening Our Rural Health Workforce Act of 2019 (S.2891); Tribal Wildlife Corridors; Admiral Weahkee's nomination; Tribal Tax and Investment Reform Act; paid and sick leave mandates in the coronavirus relief packages; APD fee waivers in coronavirus bill; business loans and loan guarantees in the CARES Act.","Tribal Energy Reauthorization Act.","CARES Act 2.0; HEROES Act; coronavirus Relief Fund litigation; DOI/BIA oil and gas in Indian country; Net Operating Losses and next coronavirus bill; FY2021 spending bills; COVID-19, tribal development, capital and Regulatory Reform Authority; Coronavirus Relief Fund; Paycheck Protection Program; NEPA reform; Indian Self-Determination statement by POTUS.","Royalty relief for energy producers; relief for tribal energy producers in CARES Act; and energy, water and infrastructure measures.","Indian energy development; TERP and 638 contract negotiations; tribal energy provisions in next coronavirus bill; and abandoned and orphaned wells and energy development on the Tribe's land.","The Pine River Indian Irrigation Project and the WIIN Act; EIN amendment and the Paycheck Protection Program; the HEALS Act; Indian Loan Guarantee Program amendments for next CARES Act; Tribal Power Act (H.R.5541); Phase IV of coronavirus legislation and tribal provisions; broadband efforts in Moving Forward Act; liability protection provisions; pending MOU with Tribe and Bureau of Land Management on grazing rule; PROGRESS for Indian Tribes Act (S.209); Coronavirus Relief Fund litigation; and the Indian Buffalo Management Act (H.R.5153).","Indian energy development; AGILE Act of 2019 (S.2657).","McGirt decision; Paycheck Protection Program; COVID-19 relief legislation; S.4898, Coronavirus Relief Fund deadline extension bill; FY2021 appropriations; STOP Act (S.1913), cultural property protection legislation, HEARTH Act application, and related environmental documents.","Introduction of the Tribal Labor Sovereignty Act; the WIIN Act; the IRRIGATE Act; the Pine River Project; Haalands nomination to be Secretary of the Interior; the American Rescue Plan Act; COVID- 19 relief legislation; Rep. Gwen Moore's tax credit legislation for tribal governments; Department of Interior Secretarial order 339; tribal regulatory reform in Commerce Department; Sen. Bennet's draft oil and gas leasing and abandoned wells bills; Native American Business Development, Trade Promotion, and Tourism Act of 2000."],"years":[2018,2019,2020,2021,2022,2023,2024]}