{
  "id": 210112,
  "name": "SOUTH FLORIDA ADMIRALTY TRIAL LAWYERS ASSOCIATION",
  "slug": "south-florida-admiralty-trial-lawyers-association",
  "state": "FL",
  "description": "Association of maritime trial lawyers representing seafarers and crew members.",
  "totalSpending": 1980000,
  "filings": 17,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 400000
    },
    {
      "year": 2023,
      "income": 530000
    },
    {
      "year": 2024,
      "income": 400000
    },
    {
      "year": 2025,
      "income": 450000
    }
  ],
  "firms": [
    "SCONSET STRATEGIES, LLC"
  ],
  "lobbyists": [
    "ADAM OLSEN"
  ],
  "issues": [
    "MAR",
    null
  ],
  "sampleDescriptions": [
    "Issues related to the representation of plaintiffs in maritime cases as related to the Jones Act and arbitration.\n\nProvisions impacting maritime employment: Jones Act, domestic and foreign seafarer and crew member court access. \n\nIssues related to the cruise industry, including recommencement of sailing in 2021.",
    "S.593 - Alaska Tourism Recovery Act.\n\nH.R.1318 - Alaska Tourism Restoration Act.\n\nS.1105 - CRUISE Act\n\nIssues related to the cruise industry, including recommencement of sailing.\n\nPriorities for the Coast Guard and MARAD reauthorization bills.\n\nIssues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration.\n\nProvisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "National Defense Authorization Act for Fiscal Year 2022.\n\nInfrastructure Investment and Jobs Act - HR 3684\n\nMonitored status of CDC's No Sail Order (NSO), Conditional Sailing Order (CSO), as well as other agency policies impacting the cruise line industry.\n\nIssues related to the cruise industry, including recommencement of sailing.\n\nIssues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration.\n\nProvisions impacting maritime employment, Jones Act and Seafarer Court Access.\n\nPriorities for the Coast Guard and MARAD reauthorization bills",
    "Cruise and other tourism industry issues related to COVID-19. H.R. 6865, The Don Young Coast Guard Authorization Act of 2022. S.3683 - Alaska Tourism Restoration Extension Act. Monitored status of CDC's No Sail Order (NSO), Conditional Sailing Order (CSO), as well as other agency policies impacting the cruise line industry. Issues related to the cruise industry, including recommencement of sailing. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access. Priorities for MARAD reauthorization bills.",
    "S.4357 - Maritime Administration Authorization Act for Fiscal Year 2023 S.2818 - Cruising for Alaska's Workforce Act S.3683 - Alaska Tourism Restoration Extension Act Priorities for Coast Guard Authorization Act of 2023 Cruise and other tourism industry issues related to COVID-19; H.R. 6865, The Don Young Coast Guard Authorization Act of 2022; Monitored status of CDC's No Sail Order (NSO), Conditional Sailing Order (CSO), as well as other agency policies impacting the cruise line industry. Issues related to the cruise industry, including recommencement of sailing. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "S.4802 Coast Guard Authorization Act of 2022 H.R.5376 - Inflation Reduction Act of 2022 S.4543 - James M. Inhofe National Defense Authorization Act for Fiscal Year 2023 S.4357 - Maritime Administration Authorization Act for Fiscal Year 2023 S.2818 - Cruising for Alaska's Workforce Act S.3683 - Alaska Tourism Restoration Extension Act Cruise and other tourism industry issues related to COVID-19; H.R. 6865, The Don Young Coast Guard Authorization Act of 2022; Monitored status of CDC's No Sail Order (NSO), Conditional Sailing Order (CSO), as well as other agency policies impacting the cruise line industry. Issues related to the cruise industry, including recommencement of sailing. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "H.R. 2617- Consolidated Appropriations Act, 2023 S.4802 Coast Guard Authorization Act of 2022 H.R.5376 - Inflation Reduction Act of 2022 S.4543 - James M. Inhofe National Defense Authorization Act for Fiscal Year 2023 S.4357 - Maritime Administration Authorization Act for Fiscal Year 2023 S.2818 - Cruising for Alaska's Workforce Act S.3683 - Alaska Tourism Restoration Extension Act Cruise and other tourism industry issues related to COVID-19; H.R. 6865, The Don Young Coast Guard Authorization Act of 2022; Monitored status of CDC's No Sail Order (NSO), Conditional Sailing Order (CSO), as well as other agency policies impacting the cruise line industry. Issues related to the cruise industry, including recommencement of sailing. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "H.R. 7659- The Coast Guard Authorization Act of 2024. Senate Coast Guard Reauthorization. Monitor Senate Judiciary Committee Legislation. Legislation o establish a prohibition on the contractual limit of liability for any claim of loss for any seaman, and for other purposes. Issues related to the cruise industry. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "S.4473 - A bill to limit the definition of commercial in title 9, United States Code. H.R. 7659- The Coast Guard Authorization Act of 2024. Senate Coast Guard Reauthorization. Monitor Senate Judiciary Committee Legislation. Legislation o establish a prohibition on the contractual limit of liability for any claim of loss for any seaman, and for other purposes. Issues related to the cruise industry. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "S._____ To establish a prohibition on the contractual limit of liability for any claim of loss for any seaman, and for other purposes. S.4473 - A bill to limit the definition of commercial in title 9, United States Code. H.R. 7659- The Coast Guard Authorization Act of 2024. Senate Coast Guard Reauthorization. Monitor Senate Judiciary Committee Legislation. Issues related to the cruise industry. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access.",
    "S._____ To establish a prohibition on the contractual limit of liability for any claim of loss for any seaman, and for other purposes. Senate Coast Guard Reauthorization. Monitor Senate Judiciary Committee Legislation. Issues related to the cruise industry. Issues related to the representation of Plaintiffs in maritime cases as related to the Jones Act and arbitration. Provisions impacting maritime employment, Jones Act and Seafarer Court Access."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 125,
  "trajectory": "exploding",
  "yearsActive": 5,
  "avgAnnualSpending": 396000,
  "peakYear": 2023,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 1
}