{"id":199338,"name":"SPACEX","slug":"spacex","state":"CA","description":"SpaceX designs, manufactures and launches advanced rockets and spacecraft.","totalSpending":1150000,"filings":23,"yearlySpending":[{"year":2018,"income":100000},{"year":2019,"income":200000},{"year":2020,"income":150000},{"year":2021,"income":200000},{"year":2022,"income":150000},{"year":2024,"income":150000},{"year":2025,"income":200000}],"firms":["HARBINGER STRATEGIES, LLC"],"lobbyists":["STEVE STOMBRES","MANNY ROSSMAN","KYLE NEVINS","JOHN O'NEILL","JONATHAN SLEMROD","PARKER POLING","JOHN LEGANSKI"],"issues":["AER","BUD","DEF","ECN"],"sampleDescriptions":["The National Aeronautics and Space Administration Authorization Act of 2018 (H.R. 5503):  Issues related to commercial, civil and defense space transportation.","The Fiscal Year 2019 Department of Defense Appropriations Act (H.R. 6157, S.3159):  issues related to the funding of military space launches.  The Fiscal Year 2019 Commerce, Justice, and Science Appropriations Act (H.R. 5952, S. 3072):  Issues related to the funding of civil and defense space launches.","The Fiscal Year 2019 National Defense Authorization Act (H.R. 5515, S. 1519):  issues related to space launch competition.","The FY2020 National Defense Authorization Act (No Bill Number):  issues related to space launch competition.","The National Aeronautics and Space Administration Authorization Act (No Bill Number):  issues related to commercial, civil, and defense space transportation.","The FY2020 Department of Defense Appropriations Act (No Bill Number): issues related to the funding of military space launches. The FY2020 Commerce, Justice, and Science Appropriations Act (No Bill Number): Issues related to the funding of civil and defense space launches.","The FY2020 National Defense Authorization Act (H.R. 2500, S. 1790):  issues related to space launch competition.","The FY2020 Department of Defense Appropriations Act (H.R. 2968, H.R. 2740): issues related to the funding of military space launches. The FY2020 Commerce, Justice, and Science Appropriations Act (H.R. 3055): Issues related to the funding of civil and defense space launches.","The National Aeronautics and Space Administration Authorization Act (H.R. 5666): issues related to commercial, civil, and defense space transportation.","General monitoring of issues related to the COVID-19 Pandemic.","The FY2021 Department of Defense Appropriations Act (No Bill Number): issues related to the funding of military space launches. The FY2021 Commerce, Justice, and Science Appropriations Act (No Bill Number): Issues related to the funding of civil and defense space launches.","The William M. (Mac) Thornberry National Defense Authorization Act (H.R. 6395), issues related to space launch competition.","The FY2021 Department of Defense Appropriations Act (H.R. 7617): Issues related to the funding of military space launches. The FY2021 Commerce, Justice, and Science Appropriations Act (H.R. 7667): Issues related to the funding of civil and defense space launches.","The FY 2022 National Defense Authorization Act (No Bill Number):  Issues related to space launch competition.","The FY 2022 National Aeronautics and Space Administration Act (No Bill Number):  Issues related to commercial, civil, and defense space transportation.","The FY 2022 Department of Defense Appropriations Act (No Bill Number):  Issues related to the funding of military space launches.  The FY 2022 Commerce, Justice, and Science Appropriations Act (No Bill Number):  Issues related to the funding of civil and defense space launches.","The FY 2022 National Defense Authorization Act (H.R. 4350):  Issues related to space launch competition.","The FY 2022 Department of Defense Appropriations Act (H.R. 4432):  Issues related to the funding of military space launches.  The FY 2022 Commerce, Justice, and Science Appropriations Act (H.R. 4505):  Issues related to the funding of civil and defense space launches.","The FY 2022 National Defense Authorization Act (Public Law 117-81): Issues related to space launch competition.","The FY 2022 National Aeronautics and Space Administration Act (No Bill Number): Issues related to commercial, civil, and defense space transportation."],"years":[2018,2019,2020,2021,2022,2024,2025]}