{"id":181807,"name":"STARKEY HEARING TECHNOLOGIES","slug":"starkey-hearing-technologies","state":"MN","description":"Starkey Hearing Technologies manufactures and delivers advanced hearing solutions.","totalSpending":1390000,"filings":25,"yearlySpending":[{"year":2018,"income":130000},{"year":2019,"income":170000},{"year":2020,"income":240000},{"year":2021,"income":210000},{"year":2022,"income":260000},{"year":2024,"income":140000},{"year":2025,"income":240000}],"firms":["THE PETRIZZO GROUP, INC."],"lobbyists":["TJ PETRIZZO","MEGAN PEREZ BURKE","BESS HUGHES","CAMILLE LEPIRE"],"issues":["HCR","DEF","BUD","VET"],"sampleDescriptions":["Develop advocacy initiative to advance adoption of hearing health standards throughout the U.S. Government for acquisition and deployment of hearing aids.","Educating hearing health and wellness, and the impact of hearing loss to aging and select populations. Advocating for government initiatives that improve awareness and hearing health.","Educating Hearing health and wellness, and impact of hearing loss to aging and select populations. Advocating for government initiatives that improve awareness and hearing health.","Department of Defense funding for hearing protection technologies; hearing health and wellness and impact of hearing loss to military service members.","Department of Defense funding for hearing protection technologies.","Hearing health and wellness and impact of hearing loss to veterans; advocating for government initiatives that improve access to all hearing aid devices.","Department of Defense funding for hearing protection technologies; hearing health and wellness and impact of hearing loss to military service members","Advocating for government initiatives that improve awareness to overall hearing health.","Advocating for government initiatives that improve awareness to overall hearing health and fund expanded use of hearing protection for American warfighters.","Advocating for government initiatives that improve awareness to overall hearing health and authorize funding of program(s) to provide enhanced hearing protection for American warfighters.","Advocating for government initiatives that improve awareness to overall hearing health and increase utilization of U.S. manufactured medical devices.","Advocated for government initiatives that improve awareness to overall hearing health. Advocated for FEHB program coverage of hearing aids & active hearing protection.","Advocated for government initiatives that improve awareness to overall hearing health and fund expanded use of hearing protection for American warfighters.","Advocated for government initiatives that improve awareness to overall hearing health and authorize funding of program(s) to provide enhanced hearing protection for American warfighters.","Advocated for government initiatives that improve awareness to overall hearing health and increase utilization of U.S. manufactured medical devices."],"years":[2018,2019,2020,2021,2022,2024,2025]}