{
  "id": 139822,
  "name": "STARBUCKS COFFEE CORP",
  "slug": "starbucks-coffee-corp",
  "state": "WA",
  "description": null,
  "totalSpending": 1350000,
  "filings": 27,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 150000
    },
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 100000
    }
  ],
  "firms": [
    "K&L GATES, LLP"
  ],
  "lobbyists": [
    "KARISHMA PAGE",
    "MARY BAKER",
    "JAMES WALSH",
    "STEVEN VALENTINE",
    "TIM PECKINPAUGH",
    "WILLIAM KIRK",
    "SCOTT ALIFERIS",
    "PETER NELSON",
    "SEAN MCGLYNN",
    "STEVEN MCCAIN",
    "STACY ETTINGER",
    "SLADE GORTON",
    "LAUREN FLYNN",
    "RODERICK HALL",
    "SCOTT NELSON",
    "BRENDEN CHAINEY",
    "DARRELL CONNER",
    "SCOTT GELBMAN",
    "JAMIE JACKSON",
    "ANDREW TABLER",
    "VICTORIA HAMSCHO",
    "BRUCE HEIMAN",
    "BART GORDON",
    "MARNE MAROTTA",
    "DAVID SKILLMAN"
  ],
  "issues": [
    "TAX",
    "FOR",
    "IMM",
    "VET",
    "MAN",
    "CIV",
    "EDU",
    "LBR",
    "ENV",
    "AGR",
    null
  ],
  "sampleDescriptions": [
    "Proposals which promote tax reform including employer provided education benefit, corporate, and international tax issues including Upward Mobility Enhancement Act (S. 2007/H.R. 4135) and Tax Reform Legislation (H.R.1 - PL 115-97).",
    "Issues pertaining to company agriculture support programs in developing countries (no specific legislation).",
    "Issues pertaining to employee immigration (no specific legislation).",
    "Company veterans programs and initiatives regarding transition, employment and training (no specific legislation).",
    "Issues pertaining to manufacturing (no specific legislation).",
    "Issues pertaining to company programs related to civic engagement (no specific legislation).",
    "Issues pertaining to company higher education employee benefits including Upward Mobility Enhancement Act (S. 2007/H.R. 4135) and Tax Reform Legislation (H.R.1 - PL 115-97).",
    "Issues pertaining to company programs related to workforce employment and training (no specific legislation).",
    "Issues pertaining to company programs related to workforce employment and training including pay equity (no specific legislation).",
    "Issues pertaining to company higher education employee benefits including Upward Mobility Enhancement Act (S. 2007/H.R. 4135).",
    "Proposals which promote tax reform including employer provided education benefit, corporate, and international tax issues including Upward Mobility Enhancement Act (S. 2007/H.R. 4135).",
    "Issues related to ethical sourcing and green buildings (no specific legislation).",
    "Issues related to ethical sourcing, sustainability, and green buildings (no specific legislation).",
    "Issues related to post-natural disaster importation of coffee seeds to affected areas (no specific legislation).",
    "Issues pertaining to company programs related to workforce employment, benefits, and training (no specific legislation).",
    "Issues related to ethical sourcing, sustainability, and green buildings - no specific legislation.",
    "Issues pertaining to company agriculture support programs in developing countries - no specific legislation.",
    "Issues pertaining to company higher education employee benefits - no specific legislation.",
    "Issues pertaining to company programs and initiatives regarding transition, employment and training - no specific legislation.",
    "Issues pertaining to company programs related to civic engagement - no specific legislation."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -33,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 168750,
  "peakYear": 2019,
  "lobbyistCount": 25,
  "firmCount": 1,
  "issueCount": 10
}