{"id":179172,"name":"STATE OF INDIANA","slug":"state-of-indiana","state":"IN","description":"State Government, Office of the Governor","totalSpending":1665800,"filings":26,"yearlySpending":[{"year":2018,"income":252000},{"year":2019,"income":126000},{"year":2020,"income":147800},{"year":2021,"income":230000},{"year":2022,"income":280000},{"year":2023,"income":280000},{"year":2024,"income":280000},{"year":2025,"income":70000}],"firms":["DEBORAH HOHLT"],"lobbyists":["DEBORAH HOHLT"],"issues":["MMM","LBR","DEF","TRA","ECN","HCR","BAN","MAR","EDU","ENV","AER","AGR","TRD","TEC","DIS","SCI","UNM","BUD",null],"sampleDescriptions":["Healthy Indiana Plan 1115 Waiver\nIssues related to Medicaid funding for opioid response programs","State Plan Modification under Workforce Innovation and Opportunity Act","Issues related to Indiana National Guard, federal military instillations","Issues related to Indiana's West Lake Corridor and South Shore Double Track transit funding grant application","Issues related to state tourism, national landmarks, national parks designations\nIndiana Housing and Community Development Authority - issues related to rural development projects with USDA","Budget proposal reductions to CDC Public Health Prevention Fund","S. 2155 / H.R. 10 -Issues related to community banking provisions in banking reform bills","Issues related to funding for Army Corps of Engineers Coastal operation and maintenance program\nArmy Corp. proposals regarding Chicago Area Waterway System as a means of controlling the migration of Asian Carp","Issues related to Indiana National Guard, federal military facilities in Indiana","Bills and provisions related to Medicaid funding for opioid response and prevention programs","H.R. 2353; S. 3217 Strengthening Career and Technical Education for the 21st Century Act\nIssues related to Workforce Investment and Opportunity Act provisions; State authority\nIndiana Housing and Community Development Authority - issues related to rural development projects with USDA","S. 1808; H.R. 2482 Federal Perkins Loan Program Extension Act\nH.R. 4508 Provisions related to flexible Pell Grant eligibility","H.R. 6 SUPPORT for Patients and Communities Act; provisions on programs to support increased detection and monitoring of fentanyl and other synthetic opioids and other issues","H.R. 2353; S. 3217 Strengthening Career and Technical Education for the 21st Century Act","H.R. 5515 John S. McCain National Defense Authorization Act for Fiscal Year 2019; Issues related to Indiana National Guard, federal military facilities in Indiana","President's Workforce Advisory Board","Comment on Chicago-Naperville, IL-IN-WI Ozone Nonattainment Area Docket ID No. EPA-HQ-OAR-2018-0226","S. 1808; H.R. 2482 Federal Perkins Loan Program Extension Act\nPolicy on Pell Grant eligibility requirements","Issues related to the Joint Hypersonics Transition Office","Appropriations for Capital Investment Grants (CIG) program\nBUILD Grant applications"],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}