{
  "id": 203418,
  "name": "STATE OF CALIFORNIA",
  "slug": "state-of-california",
  "state": "CA",
  "description": "State Government",
  "totalSpending": 1570000,
  "filings": 24,
  "yearlySpending": [
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 230000
    },
    {
      "year": 2021,
      "income": 160000
    },
    {
      "year": 2022,
      "income": 180000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 280000
    }
  ],
  "firms": [
    "EVOLVE STRATEGIES LLC"
  ],
  "lobbyists": [
    "EVE MALDONADO O'TOOLE"
  ],
  "issues": [
    "CAW",
    "BUD",
    "ACC",
    "TRA",
    "HCR",
    "DIS",
    "GOV",
    "NAT",
    "IMM",
    "LBR",
    "ENV",
    "BAN",
    "ENG",
    "IND",
    "SCI",
    null,
    "AGR",
    "VET",
    "TAX",
    "LAW"
  ],
  "sampleDescriptions": [
    "Issues relating to healthcare, transportation, water policy and emergency preparedness.",
    "Disaster Supplemental Appropriations: Wildfire relief funding, and Transportation Emergency Funds availability.",
    "Issues and proposals relating to prescription drug pricing and healthcare expansion.",
    "Issues relating to Shasta Dam, Salton Sea, Water Resilience Portfolio, Delta Tunnel, Drought relief, Tijuana River Pollution and Oroville Dam.",
    "Preservation of funding for California high-speed rail; expedited project delivery for state projects.\n\n(Note: The list below of \"House(s) of Congress and Federal Agencies\" includes the Dept. of Transportation (DOT). This refers, however, to communication with the \"Federal Permitting Improvement Steering Council,\" an interagency group comprised of numerous federal departments and agencies of which DOT is a principal participant.  DOT has been listed because the form offers no selection for FPISC.",
    "FY 2020 Appropriations:  Emergency relief, preparedness and recovery; programmatic FEMA, DHS, Interior, USDA, HUD, Education, HHS funding; Water programmatic funding, including appropriation issues related to Shasta Dam, Salton Sea, and US-Mexico Border Water Infrastructure program.",
    "Issues relating to Dalton Sea, drought relief, Tijuana River pollution, new biological opinions covering operations by the Central Valley Project and the State Water Project; Chevron oil spill, clean water state revolving fund, and EPA retaliatory action on clean water.",
    "FY 2020 Transportation-HUD Appropriations Act- preservation of funding for California high-speed rail.",
    "Disaster and wildfire relief resources; Ridgecrest Earthquakes; FEMA Individual Assistance rule; FEMA disaster relief funds; Paradise certification; CA Fire Assistance Agreement; and Transportation Emergency Relief Funds Availability Act.",
    "Issues and proposals relating to prescription drug pricing and healthcare expansion; Affordable Care Act Section 1557 regulation.",
    "FY 2020 Appropriations: Emergency relief, preparedness and recovery; programmatic FEMA, DHS, Interior-EPA, USDA, HUD, Education, and HHS funding.",
    "Issues relating to Salton Sea, Tijuana River pollution, new biological opinions covering operations by the Central Valley Project and the State Water Project; PFAS; and EPA retaliatory action on clean water.",
    "FY 2020 Transportation-HUD Appropriations Act- preservation of funding for California and high-speed rail.",
    "FY 2020 Appropriations: Emergency relief, preparedness and recovery; programmatic FEMA, DHS, Interior-EPA, USDA, Transportation, HUD funding.",
    "Issues and proposals relating to prescription drug pricing (Lower Prescription Drug Costs Now Act) and healthcare expansion; homelessness and mental health; and Administration's retaliatory action on homelessness.",
    "Disaster and wildfire relief resources; FEMA Individual Assistance rule; FEMA disaster relief funds (EMPG and HMPG); CA Fire Assistance Agreement; Oroville Dam appeal; and Transportation Emergency Relief Funds Availability Act.",
    "Disaster and wildfire relief resources; FEMA Individual Assistance rule; FEMA disaster relief funds (EMPG and HMPG); Oroville Dam appeal; and Transportation Emergency Relief Funds Availability Act.",
    "FY 2021 and Supplemental Appropriations: Emergency relief, preparedness and recovery; programmatic FEMA, DHS, Interior-EPA, Energy-Water, USDA, Transportation, HUD funding.",
    "Infrastructure package/FAST Act Reauthorization-preservation of funding for California and high-speed rail.",
    "Issues and proposals relating to healthcare/hospital capacity, preparedness, relief, personal protective equipment (PPE), and prescription drug pricing."
  ],
  "years": [
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 17,
  "trajectory": "stable",
  "yearsActive": 7,
  "avgAnnualSpending": 224286,
  "peakYear": 2025,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 19
}