{"id":184823,"name":"SWISS REINSURANCE COMPANY LTD","slug":"swiss-reinsurance-company-ltd","state":null,"description":null,"totalSpending":3030000,"filings":31,"yearlySpending":[{"year":2018,"income":280000},{"year":2019,"income":360000},{"year":2020,"income":270000},{"year":2021,"income":360000},{"year":2022,"income":440000},{"year":2023,"income":440000},{"year":2024,"income":440000},{"year":2025,"income":440000}],"firms":["INVARIANT LLC"],"lobbyists":["ANNE MACMILLAN","MARY STANTON","ANNE PALISI","BENJAMIN KLEIN","HEATHER PODESTA","STEPHEN BAILEY","ROBERT HOFFMAN","LARISSA MARTINEZ","CAROLYN CODA","QUINCY ENOCH","MATTHEW RUSSELL","CHRISTOPHER GILLOTT","ADAM TARR","NOAH MARINE","JAMES OBRIEN"],"issues":["AGR","HCR","TAX","INS","ROD","ENV","FIN","BAN","FOR",null,"CPI"],"sampleDescriptions":["Monitor potential efforts to reform the federal crop insurance program.","Monitor reinsurance proposals H.R. 4666, the Premium Relief Act of 2017, and S. 1835, the Lower Premiums Through Reinsurance Act of 2017.","Oppose proposals to amend the Internal Revenue Code of 1986 to disallow the deduction for excess non-taxed reinsurance premiums with respect to United States risk paid to affiliates; monitor proposals for corporate integration, the border adjustable tax (BAT), base erosion prevention, and other legislative and regulatory activities related to comprehensive tax reform; advocate for clarification and changes to the base erosion and anti-abuse tax (BEAT) enacted as part of P.L. 115-97, the Tax Cuts and Jobs Act.","Monitor implementation of proposed regulations related to the creation of a Federal Insurance Office and reinsurance and systemic risk (P.L. 111-203, the Wall Street Reform and Consumer Protection Act of 2009); monitor Financial Stability Oversight Committee activities related to the Dept. of Treasury; monitor implementation of the Flood Insurance Reform Act (P.L. 112-141) and reform efforts in this Congress, including H.R. 1422 / S. 563, the Flood Insurance Market Parity and Modernization Act; monitor H.R. 2874, the 21st Century Flood Reform Act, and S. 1571, National Flood Insurance Program Reauthorization Act of 2017.","Oppose proposals to amend the Internal Revenue Code of 1986 to disallow the deduction for excess non-taxed reinsurance premiums with respect to United States risk paid to affiliates; monitor proposals for corporate integration, base erosion prevention, and other legislative and regulatory activities related to comprehensive tax reform; advocate for clarification and changes to the base erosion and anti-abuse tax (BEAT) enacted as part of P.L. 115-97, the Tax Cuts and Jobs Act.","Monitor proposals related to comprehensive tax reform; advocate for clarification and changes to the base erosion and anti-abuse tax (BEAT) enacted as part of P.L. 115-97, the Tax Cuts and Jobs Act.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Dept of Treasury; monitor legislation to reauthorize and reform the National Flood Insurance Program; monitor legislation to create a federal data breach standard for insurers.","Monitor proposals related to comprehensive tax reform; advocate for clarification and changes to the base erosion and anti-abuse tax (BEAT) enacted as part of P.L. 115-97, the Tax Cut and Jobs Act.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to reauthorize and reform the National Floor Insurance Program; monitor legislation to create a federal data breach standard for insurers; monitor legislation to reauthorize the Terrorism Risk Insurance Act (TRIA); monitor legislation to create a safe harbor for insurers engaging in cannabis-related business.","Monitor developments on infrastructure legislation; educate Members of Congress on large-scale infrastructure investment.","Monitor legislation and developments related to climate change.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to reauthorize and reform the National Flood Insurance Program; monitor legislation to create a federal data breach standard for insurers; monitor legislation to reauthorize the Terrorism Risk Insurance Act (TRIA); monitor legislation to create a safe harbor for insurers engaging in cannabis-related business.","Advocate for the modernization of the Surety Bond Program.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to reauthorize and reform the National Flood Insurance Program; monitor legislation to create a federal data breach standard for insurers; support H.R. 1865, to reauthorize the Terrorism Risk Insurance Act (TRIA); monitor legislation to create a safe harbor for insurers engaging in cannabis-related business; provide support for the participation on The Advisory Committee on Risk Sharing Mechanisms (ACRSM).","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to reauthorize and reform the National Flood Insurance Program; monitor legislation to create a federal data breach standard for insurers; monitor legislation to create a safe harbor for insurers engaging in cannabis-related business; provide support for the participation on The Advisory Committee on Risk Sharing Mechanisms (ACRSM); monitor efforts to examine pandemic insurance.","Monitor proposals related to comprehensive tax reform; advocate for clarification and changes to the base erosion and anti-abuse tax (BEAT) enacted as part of P.L. 115-97, the Tax Cut and Jobs Act; monitor final regulations on Sec. 385 debt/equity regulations.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to reauthorize and reform the National Flood Insurance Program; monitor legislation to create a federal data breach standard for insurers; monitor legislation to create a safe harbor for insurers engaging in cannabis-related business; provide support for the participation on The Advisory Committee on Risk Sharing Mechanisms (ACRSM); monitor efforts to examine pandemic insurance, including H.R. 7011, the Pandemic Risk Insurance Act of 2020; H.R. 6494, the Business Interruption Insurance Coverage Act of 2020; and H.R. 6497, the Never Again Small Business Protection Act of 2020; educate policymakers on impact of surety regulation.","Monitor developments on infrastructure legislation; monitor large-scale infrastructure investment.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to create a federal data breach standard for insurers; monitor legislation to create a safe harbor for insurers engaging in cannabis-related business; provide support for participating on the Advisory Committee on Risk Sharing Mechanisms (ACRSM); monitor efforts to examine pandemic insurance; educate policymakers on impact of surety regulation.","Monitor proposed legislation to reform the Federal Insurance Office and oversight on international insurance agreements; monitor FSOC activities related to the Department of Treasury; monitor legislation to create a federal data breach standard for insurers; monitor legislation to create a safe harbor for insurers engaging in cannabis-related business; provide support for participating on the Advisory Committee on Risk Sharing Mechanisms (ACRSM); monitor efforts to examine pandemic insurance; educate policymakers on impact of surety regulation; monitor proposed legislation to reauthorize the National Flood Insurance program."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}