{"id":201533,"name":"TEXAS HOSPITAL ASSOCIATION","slug":"texas-hospital-association","state":"TX","description":"Represents hospitals and health systems in Texas","totalSpending":1450000,"filings":29,"yearlySpending":[{"year":2018,"income":300000},{"year":2019,"income":200000},{"year":2020,"income":250000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":200000},{"year":2025,"income":150000}],"firms":["CAMERON KRIER MASSEY, INC. DBA SCOUT GR"],"lobbyists":["CAMERON KRIER MASSEY"],"issues":["HCR","MMM"],"sampleDescriptions":["Healthcare reform proposals from Senators Bill Cassidy and Lindsey Graham, provisions resulting in loss of insurance overage, payment cuts to hospital providers, and fixed federal funding in Medicaid.\n\nDepartment of Labor: Proposed Rules; Definition of Employer under Section 3(5) of ERISA - Association Health Plans; expressing concern that the proposed rule will permit an increase in the number of plans which could qualify as large group or self-funded employer plans negatively impacting access to care.\n\nUS Department of Health and Human Services - Office of Civil Rights: Proposed Rules - Protecting Statutory Conscience Rights in Health Care; Delegations of Authority, expressing concern the proposed rule could lead to an inability to provide or receive care when necessary, and unintentionally reduce the availability of services to certain populations.","Issues related to the pending expiration and current disallowance of funds under the 1115 Medicaid Transformation Waiver in Texas.\n\nHR 1892, Continuing Resolution for FY 2017 appropriations: delaying cuts to Medicaid Disproportionate Share Hospital payments; extending funding for the Childrens Health Insurance Program; extending funding for rural hospital programs. \n\nRural Hospital Access Act of 2017 (S.872/H.R. 1955), permanently extending the Medicare Dependent Hospital program and Medicare Low Volume Hospital program. \n\nResponding to Senate Finance Committee and House Ways and Means Committee draft proposals to address expiring Medicare programs for rural hospitals. \n\n2018 Medicare Outpatient Proposed Rule, provisions leading to payment cuts under the 340B program.","Issues related to the 1115 Medicaid Transformation Waiver in Texas.\n\nResponse to CMS on proposed rule to amend definition of short-term, limited duration insurance. CMS-9924-P.\n\nResponse to CMS proposed rule on methods for assuring access to covered Medicaid services - exemptions for state with high managed care penetration rates and rate reduction threshold. CMS-2406-P\n\nResponse to CMS proposed rule on Hospital Inpatient Prospective Payment Systems for Acute Care Hospitals\nand the Long-Term Care Hospital Prospective Payment System and Proposed Policy Changes and Fiscal Year 2019\nRates; Proposed Quality Reporting Requirements for Specific Providers. CMS-1694-P.","Shared white paper on opioids created by the Texas Hospital Association to inform the policy debate in Congress.","Issues related to the 1115 Medicaid Transformation Waiver in Texas.\n\nResponse to CMS on proposed rule to amend definition of short-term, limited duration insurance. CMS-9924-P.\n\nResponse to CMS proposed rule on methods for assuring access to covered Medicaid services - exemptions for state with high managed care penetration rates and rate reduction threshold. CMS-2406-P\n\nResponse to CMS proposed rule on Hospital Inpatient Prospective Payment Systems for Acute Care Hospitals\nand the Long-Term Care Hospital Prospective Payment System and Proposed Policy Changes and Fiscal Year 2019\nRates; Proposed Quality Reporting Requirements for Specific Providers. CMS-1694-P.\n\nResponse to CMS on proposed rule related to Inpatient Rehabilitation Facility Prospective Payment System for FFY 2019, provision implementing a new budget natural case mix system for rehabilitation hospitals. CMS-1688-P.","Shared white paper on opioids created by the Texas Hospital Association to inform the policy debate in Congress.\n\nRespond to HHS proposed rule on protecting statutory conscience rights in health care. Conscience NPRM, RIN 0945-ZA03.","HR 3415 (Poe), the Megan Rondini Act, legislation that requires hospitals to follow certain protocols in the treatment of sexual assault victims.\n\nHR 6273 (Walters/Walden), legislation that requires 340B participating hospitals to follow certain protocols in the treatment of sexual assault victims.\n\nDraft legislation (Barton) that would amend the Public Health Service Act to raise the minimum disproportionate share adjustment percentage required of certain hospitals as a condition of qualifying for the 340B drug discount program, and for other purposes.","Issues related to the 1115 Medicaid Transformation Waiver in Texas and disallowance of funds.\n\nResponse to request for comments by CMS on the physician self-referral law (CMS-1720-NC).\n\nProposed reductions to hospital payments in the CY 2019 Outpatient Prospective Payment System rule.","Issues related to the 1115 Medicaid Transformation Waiver in Texas and disallowance of funds.\n\nResponse to request for comments by CMS on the physician self-referral law (CMS-1720-NC).\n\nProposed reductions to hospital payments in the CY 2019 Outpatient Prospective Payment System rule. \n\nComments to CMS RE: CMS-1695-P, Medicare Program; Proposed Changes to Hospital Outpatient\nProspective Payment and Ambulatory Surgical Center Payment Systems and Quality Reporting Programs (provisions impacting payment of off-campus sites of care).","HR 3415 (Poe), the Megan Rondini Act, legislation that requires hospitals to follow certain protocols in the treatment of sexual assault victims.\n\nHR 6273 (Walters/Walden), legislation that requires 340B participating hospitals to follow certain protocols in the treatment of sexual assault victims.\n\nComments to Proposed Rule (DHS Docket No. USCIS-2010-0012), regarding public charge determinations and subsequent barriers for individuals to receive health care.","Issues related to the 1115 Medicaid Transformation Waiver in Texas and disallowance of funds.\n\nProposed reductions to hospital payments in the CY 2019 Outpatient Prospective Payment System rule. \n\nRequest for delay/repeal of Medicaid DSH payments set to take effect October 1, 2019.\n\nHR 7391 (Arrington), the Rural Hospital Freedom and Flexibility Act of 2018, legislation that provides for coverage of rural emergency medical access services under the Medicare program.","Submitted comments to HHS Office for Civil Rights in response to a request for information on modifying HIPAA rules to improved coordinated care (Docket No: HHS-OCR-0945-AA00).\n\nDiscussion about federal proposals to address surprise billing and the potential impact on Texas hospitals.","Comments to CMS in response to a Public Input Request on Hospital Quality Star Ratings on Hospital Compare; stating concerns about the potential for scores to inadequately and inaccurately reflect the care provided by a hospital. \n\nIssues related to the 1115 Medicaid Transformation Waiver in Texas and disallowance of funds.\n\nRequest for delay/repeal of Medicaid DSH payments set to take effect October 1, 2019.\n\nHR 7391 (Arrington), the Rural Hospital Freedom and Flexibility Act of 2018, legislation that provides for coverage of rural emergency medical access services under the Medicare program.\n\nImpact, generally, of Medicare for All and Medicare for More proposals on patients and the healthcare community.","Submitted comments to HHS on RIN 0955-AA01; 21st Century Cures Act: Interoperability, Information Blocking, and the ONC Health IT Certification Program Proposed Rule.\n\nSubmit comments on federal proposals to address surprise billing and the potential impact on Texas hospitals: The Lower Health Care Costs Act of 2019 (S.1895); the No Surprises Act (H.R. 3630); and, hearing by Ways and Means Committee on May 21.","Issues related to the 1115 Medicaid Transformation Waiver in Texas and disallowance of funds.\n\nRequest for delay/repeal of Medicaid DSH payments set to take effect October 1, 2019. Request to sign a letter of support for delay led by Rep. Engel and Rep. Olson.\n\nDiscuss the impact, generally, of Medicare for All and Medicare for More proposals on patients and the healthcare community. \n\nRequest Congressional sign on to a letter by Rep. Byrne, Rep. Arrington and others supporting proposed changes by CMS and HHS to the area wage index.","Request for delay/repeal of Medicaid Disproportionate Share Hospital program payment cuts set to take effect October 1, 2019. \n\nExpress support for H.R. 3054, DSH Cuts Delay Act of 2019, which would delay the Medicaid Disproportionate Share Hospital program payment cuts for two years. \n\nExpress support for H.R. 2328, the Community Health Investment, Modernization, and Excellence Act of 2019, provision delaying the Medicaid Disproportionate Share Hospital program payment cuts for two years. \n\nProvide feedback on proposed reforms to the Medicaid Disproportionate Share Hospital program payment by the Senate Finance Committee.\n\nDiscuss the impact, generally, of Medicare for All and Medicare for More proposals on patients and the healthcare community. \n\nDiscuss the Medicaid Fiscal Accountability Rule (CMS-2393-P) as proposed by the Centers for Medicare and Medicaid Services; specifically, the rule's impact on Texas hospitals and state financing schemes.\n\nIn letter to Centers for Medicare and Medicaid Services, express appreciation for inclusion of a quartile adjustment to the Medicare area wage index in the FY 2019 Inpatient Prospective Payment system final rule. Call for reinstatement of the Medicare Technical Advisory Group.","Discussed federal proposals to address surprise billing and the potential impact on Texas hospitals: The Lower Health Care Costs Act of 2019 (S.1895); the No Surprises Act (H.R. 3630), the Protecting People From Surprise Medical Bills Act (H.R. 3502), and proposals considered by the Ways and Means Committee. Oppose provisions that call for benchmark price setting/rate setting and support inclusion of an alternative dispute resolution process for providers.","Request for delay/repeal of Medicaid Disproportionate Share Hospital program payment cuts set to take effect October 1, 2019. \n\nExpress support for H.R. 3054, DSH Cuts Delay Act of 2019, which would delay the Medicaid Disproportionate Share Hospital program payment cuts for two years. \n\nExpress support for H.R. 2328, the Community Health Investment, Modernization, and Excellence Act of 2019, provision delaying the Medicaid Disproportionate Share Hospital program payment cuts for two years. \n\nProvide feedback on proposed reforms to the Medicaid Disproportionate Share Hospital program payment by the Senate Finance Committee.\n\nDiscuss the impact, generally, of Medicare for All and Medicare for More proposals on patients and the healthcare community. \n\nDiscuss the Medicaid Fiscal Accountability Rule (CMS-2393-P) as proposed by the Centers for Medicare and Medicaid Services; specifically, the rule's impact on Texas hospitals and state financing schemes.\n\nIn letter to Centers for Medicare and Medicaid Services, express appreciation for inclusion of a quartile adjustment to the Medicare area wage index in the FY 2019 Inpatient Prospective Payment system final rule. Call for reinstatement of the Medicare Technical Advisory Group. \n\nSubmitted comments to Centers for Medicare and Medicaid Services about modernizing and clarifying the physician self-referral law (CMS-1720-P Proposed Rule).\n\nSubmitted comments to the Office of Inspector General at US Dept of Health and Human Services to the proposed rule revising the safe harbors under the federal anti-kickback statute and civil monetary penalty rules regarding beneficiary inducements. (OIG-0936-AA10-P Proposed Rule).","Discussed federal proposals to address surprise billing and the potential impact on Texas hospitals: The Lower Health Care Costs Act of 2019 (S.1895); the No Surprises Act (H.R. 3630), the Protecting People From Surprise Medical Bills Act (H.R. 3502), and proposals considered by the Ways and Means Committee. Oppose provisions that call for benchmark price setting/rate setting and support inclusion of an alternative dispute resolution process for providers. \n\nCoronavirus Preparedness and Response Supplemental Appropriations Act, 2020 (HR 6074). Request for funding support and regulatory relief for hospitals responding to the COVID-19 pandemic.\n\nFamilies First Coronavirus Response Act (HR 6201). Request for funding support and regulatory relief for hospitals responding to the COVID-19 pandemic. Request a withdrawal of a provision in Division C related to the use of N-95 masks.\n\nCoronavirus Aid, Relief, and Economic Security Act or the CARES Act (HR 748). Request for funding support and regulatory relief for hospitals responding to the COVID-19 pandemic. Request for delay/repeal of Medicaid Disproportionate Share Hospital program payment cuts set to take effect October 1, 2019, suspension of Medicare sequester cuts, and withdrawal of the pending Medicare Fiscal Accountability Regulation. \n\nLetter to the White House with a request that investor owned hospitals be allowed access to FEMA funds during the COVID-19 pandemic.","Discuss the Medicaid Fiscal Accountability Rule (CMS-2393-P) as proposed by the Centers for Medicare and Medicaid Services; specifically, the rule's impact on Texas hospitals and state financing schemes. Request support for a letter from the Texas Congressional Delegation to CMS expressing concern about the rule's impact on the state. \n\nSave Rural Communities Act of 2020 (HR 5808), a bill that allows new licensing categories and payment for rural hospitals. Provided suggested revisions so that federal law would recognize state law. \n\nSupporting Organizations for the Improving Seniors Timely Access to Care Act (H.R. 3107), endorsing a bill that would improve prior authorization process for seniors' access to medical care.\n\nRequest to Centers for Medicare and Medicaid Service to grant a Section 1135 waiver giving Texas hospitals regulatory relief to address the COVID-19 pandemic."],"years":[2018,2019,2020,2021,2022,2024,2025]}