{"id":129683,"name":"TEXAS TECH UNIVERSITY SYSTEM","slug":"texas-tech-university-system","state":"TX","description":"Higher Education","totalSpending":1150000,"filings":27,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":200000},{"year":2020,"income":160000},{"year":2021,"income":160000},{"year":2022,"income":160000},{"year":2024,"income":150000},{"year":2025,"income":200000}],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"lobbyists":["APRIL BURKE","MICHAEL LEDFORD","JULIE JOLLY ROSE","LAUREN BROCCOLI","KARI MCCARRON","ERICA FROYD","ALISON EVANS","NICK SAAB","PAULA TRIMBLE","BRIDGET KRIEGER","ERIN CADWALADER","AARON KIESLER","LELAND COGLIANI","EVE GRANATOSKY","SRINIVAS SONTI","REYNOLDS SKAGGS","SHARON ESHELMAN","OSCAR CARBALLO","ISABELLA IZQUIERDO"],"issues":["BUD","DEF","AGR","HCR","VET","MMM","EDU","SCI","TRA"],"sampleDescriptions":["H.R. 3358, S.1771, FY 2018 Labor/HHS/Education Appropriations, Issues pertaining to NIH, Title VII and VIII, telehealth, mental health, veterans to BSN program, and support for Hispanic Serving Institutions.\nH.R. 3266, H.R. 3266, FY 2018 Energy/Water Appropriations, Issues pertaining to research, development, and education at DOE, funding for Fossil Energy, and water quality research and technology demonstration.\nH.R. 695, FY 2018 Defense Appropriations, Issues pertaining research and development at the Department of Defense including the Army Research Laboratory Open Campus initiative.\nH.R. 3355, FY 2018 Homeland Security Appropriations, Issues pertaining to water quality research and technology demonstration.\nH.R. 3354, FY 2018 Interior, Environment and Related Agencies Appropriations, Issues pertaining to water research.\nH.R. 3268, S. 1603, FY 2018 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs. \nP.L. 115-141, Consolidated Appropriations Act, 2018, Issues pertaining to funding of federal research, development, health, veterans to BSN program and education.\nFY 2019 Labor/HHS/Education Appropriations, Issues pertaining to mental and behavioral health, addressing disparities amount Hispanic populations, telehealth, rural health, veterans to BSN, AHECs, BHWET, support for Hispanic Serving Institutions.\nFY 2019 Energy/Water Appropriations, Issues pertaining to research, development, and education at DOE, funding for Fossil Energy, and wind energy.\nFY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to water research.\nFY 2019 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs.","National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to DOD Telehealth.","Reauthorization of Farm Bill for Fiscal Year 2018, Issues pertaining to the research, conservation, nutrition, and rural development titles for the upcoming reauthorization of the 2014 farm bill.","Issues pertaining to rural health and access to healthcare.\nIssues pertaining to telemedicine.\nIssues pertaining to mental health.","Issues pertaining to student veterans.","Issues pertaining to Graduate Medical Education.","H.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to student aid, Hispanic-Serving institutions, and graduate students.","Issues pertaining to water research. \nIssues pertaining to applied energy programs at the Department of Energy.","Issues pertaining to water research. \nIssues pertaining to smart cities programs and policies.\nIssues pertaining to energy and wind research.","Public Law No. 115-232, National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to DOD health and Telehealth.","Issues pertaining to rural health and access to healthcare.\nIssues pertaining to telemedicine.\nIssues pertaining to mental health and access to screening and interventions for adolescents.","H.R. 2, S. 3042, Agriculture and Nutrition Act of 2018; Agriculture Improvement Act of 2018, Issues pertaining to the research title, Title VII.\nIssues pertaining to agriculture research.","Public Law No: 115-245, FY 2019 Labor/HHS/Education Appropriations,Issues pertaining to mental and behavioral health, telehealth, rural health, veterans to BSN program, and graduate medical education.\nPublic Law No: 115-244, FY 2019 Energy/Water Appropriations, Issues pertaining to wind energy, and water quality research and technology demonstration.\nPublic Law No: 115-245, FY 2019 Defense Appropriations, Issues pertaining to research and development at the Department of Defense.\nH.R. 5961, S. 2976, FY 2019 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs.\nPublic Law No: 115-244, FY 2019 Milcon/VA Appropriations, Issues pertaining to the Veterans Success on Campus Program.","H.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to student aid, Hispanic-Serving institutions, and graduate students.\nH.R. 1635, Empowering Students through Enhanced Financial Counseling Act, Issues pertaining to student loan counseling.\nIssues relating to the Telemedicine Wellness Instrumentation Triage and Referral project in schools.","Issues Pertaining to Telehealth and DOD.","Issues pertaining to agriculture research.\nPublic Law No. 115-334, Agriculture and Nutrition Act of 2018; Agriculture Improvement Act of 2018, Issues pertaining to the research title, Title VII.","Issues pertaining to rural health and access to healthcare.\nIssues pertaining to telemedicine.\nIssues pertaining to mental health and access to screening and interventions for adolescents. \nIssues pertaining to veterans and health professions training.","Public Law No: 115-245, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to the implementation of Labor/HHS/Education bill including mental and behavioral health, telehealth, rural health, and the veterans to BSN program.\nPublic Law No: 115-244, FY 2019 Energy/Water Appropriations, Issues pertaining to implementation of wind energy, and water quality research and technology demonstration.\nH.R. 5961, S. 2976, FY 2019 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs.","Issues pertaining to infrastructure research, workforce development, and research infrastructure.\nIssues pertaining to water research. \nIssues pertaining to energy and wind research.\nIssues pertaining to DOE Water Technologies Hub.","Issues pertaining to USDA research and related programs."],"years":[2018,2019,2020,2021,2022,2024,2025]}