{"id":199479,"name":"THE GREENBRIER COMPANIES","slug":"the-greenbrier-companies","state":"OR","description":"Supplier of transportation equipment and services to the railroad industry.","totalSpending":2160000,"filings":31,"yearlySpending":[{"year":2018,"income":500000},{"year":2019,"income":290000},{"year":2020,"income":240000},{"year":2021,"income":180000},{"year":2022,"income":240000},{"year":2023,"income":300000},{"year":2024,"income":120000},{"year":2025,"income":290000}],"firms":["SUMMIT STRATEGIES GOVERNMENT AFFAIRS LLC"],"lobbyists":["JAMES BEALL"],"issues":["TAX","RRR","TRA","TRD",null],"sampleDescriptions":["Monitoring of bonus depreciation. Tax reform legislation - opposition to the Border Adjustment Tax.","Railroad tankcar safety requirements; lobby against legislation relating to large truck proposals.","Monitor legislation regarding the expansion of the use of longer and heavier trucks; lobby against legislation relating to large truck proposals.","Monitoring developments relating to the NAFTA renegotiation and legislation relating to trade with China.","Monitoring of bonus depreciation, implementation of tax reform legislation.","Monitor developments relating to and advocate for congressional approval of USMCA. Monitor developments regarding legislation relating to trade with China.","Railroad tankcar safety requirements; lobby against legislation relating to large truck proposals. Monitored COVID-19 relief legislation.","Monitor legislation regarding the expansion of the use of longer and heavier trucks; lobby against legislation relating to large truck proposals. Monitored COVID-19 relief legislation.","Monitor developments relating to and advocate for congressional approval of USMCA. Monitor developments regarding legislation relating to trade with China. Monitored COVID-19 relief legislation.","Monitoring of bonus depreciation, implementation of tax reform legislation. Monitored COVID-19 relief legislation.","Railroad tankcar safety requirements; lobby against legislation relating to large truck proposals. Advocated for S.2062: The SAFE TRAINS Act as part of surface transportation reauthorization.","Monitor legislation regarding the expansion of the use of longer and heavier trucks; lobby against legislation relating to large truck proposals. Supported Buy America reforms as a part of surface transportation reauthorization.","Monitoring of bonus depreciation, implementation of tax reform legislation. Advocate for and monitor H.R. 2289: The Freight RAILCAR Act of 2021.","Monitor developments relating to the implementation of USMCA. Monitor developments regarding legislation relating to trade with China.","Monitor the implementation of H.R. 3684: The Infrastructure Investment and Jobs Act.","Monitor railroad tankcar safety requirements.","Advocate for and monitor H.R. 2289: The Freight RAILCAR Act of 2021.","Monitor developments relating to the implementation of USMCA. Monitor developments regarding legislation relating to trade with China. Monitor developments relating to Section 232 and 301 tariffs.","Monitor the implementation of H.R. 3684: The Infrastructure Investment and Jobs Act. Monitor all legislative proposals advocating for larger truck size and weight on the federal highways, including HR 471","Monitor railroad tankcar safety requirements. Monitoring and advocating on the numerous rail safety act proposals"],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}