{"id":129691,"name":"THE REGENTS OF THE UNIVERSITY OF COLORADO","slug":"the-regents-of-the-university-of-colorado","state":"CO","description":"University","totalSpending":1400000,"filings":27,"yearlySpending":[{"year":2018,"income":80000},{"year":2019,"income":120000},{"year":2020,"income":120000},{"year":2021,"income":180000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":180000}],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"lobbyists":["MICHAEL LEDFORD","LAUREN BROCCOLI","REYNOLDS SKAGGS","NICK SAAB","ELIANA PERLMUTTER","MIRIAM QUINTAL","ELIZABETH O'HARE","BENJAMIN KALLEN","LELAND COGLIANI","REBECCA ADLER MISERENDINO","CHRISTINA LARIDAEN","AMBER CASSADY","GRIFFIN REINECKE","KARI MCCARRON","JOANNA RATIGAN","ALLISON REED","JACK GOODMAN-CHENG","DEVIN BRYANT","REBECCA ADLER MISRENDINO"],"issues":["SCI","BUD","TRA","HCR","EDU",null,"DEF","DIS"],"sampleDescriptions":["National Aeronautics and Space Administration Authorization Act of 2018, Issues pertaining to NASA science and space technology priorities.","H.R. 5503, National Aeronautics and Space Administration Authorization Act of 2018, Issues pertaining to NASA science and space technology priorities.","H.R. 5503, S. 3799. National Aeronautics and Space Administration Authorization Act of 2018, Issues pertaining to NASA science and space technology priorities.\nIssues pertaining to microgravity research and development.","Issues pertaining to NASA science priorities and mission and research support.\nIssues pertaining to NASA authorization and space technology priorities.\nIssues pertaining to DOE Office of Science research priorities","Issues pertaining to research infrastructure and workforce development.\nNational Aeronautics and Space Administration Authorization Act of 2019, Issues pertaining to NASA science and space technology priorities.","H.R. 3055, S. 2584, Commerce, Justice, Science, and Related Agencies Appropriations Act, 2020, Issues pertaining to NSF, NIST, and NASA.","NIST Reauthorization, All provisions.\nNational Aeronautics and Space Administration Authorization Act of 2019, Issues pertaining to NASA science and space technology priorities.","Issues pertaining to DOT research and development programs.","FY 2021 Labor/HHS/Education Appropriations, Issues pertaining to NIH funding, including for research on artificial intelligence and platform technologies.\nFY 2021 Commerce/Justice/Science Appropriations, Issues pertaining to NIST, NOAA, NASA, and NSF.\nFY 2021 Defense Appropriations, Issues pertaining to hypersonics research and development.\nFY 2021 Interior-Environment Appropriations, Issues pertaining to funding for the DOI and Forest Service Joint Fire Science Program.","NIST Reauthorization, Issues pertaining to NIST construction and authorization re: quantum and centers of excellence.\nS. 881, Space Weather Research and Forecasting Act, Issues pertaining to space weather research.\nH.R. 5260, Promoting Research and Observations of Space Weather to Improve the Forecasting of Tomorrow Act, Issues pertaining to space weather research.\nH.R. 6216, The National Artificial Intelligence Initiative Act of 2020, Issues pertaining to Artificial Intelligence research and development and workforce training programs.\nH.R. 5685, The Securing American Leadership in Science and Technology Act, All issues.\nNSF Reauthorization, Issues pertaining to NSF research and education.","NIST Reauthorization, Issues pertaining to NIST construction and authorization re: quantum and centers of excellence.\nNSF Director Nomination, Issues pertaining to the president's nomination to lead the National Science Foundation.","Issues pertaining to COVID-19 and impacts to the research enterprise.\nIssues pertaining to infrastructure and COVID-19 stimulus.\nFY 2021 Commerce/Justice/Science Appropriations, Issues pertaining to NIST, NOAA, NASA, and NSF.\nFY 2021 Defense Appropriations, Issues pertaining to research and development and education at the Department of Defense.\nFY 2021 Interior-Environment Appropriations, Issues pertaining to funding for EPA.","Issues pertaining to wildfire research and research on resilience.","P.L. 116-260, FY 2021 Commerce/Justice/Science Appropriations, Issues pertaining to NIST, NOAA, NASA, and NSF.\nP.L. 116-260, FY 2021 Defense Appropriations, Issues pertaining to Smart Bases.","Endless Frontier Act, All provisions. \nIssues pertaining to research and infrastructure investments for economic recovery.","FY 2022 Energy-Water Appropriations, Issues pertaining to research and development at DOE.\nFY 2022 Commerce/Justice/Science Appropriations, Issues pertaining to NIST, NOAA, NASA, and NSF.\nFY 2022 Defense Appropriations, Issues pertaining to research, development, and education at the Department of Defense, including basic research, Basic Research Initiatives, hypersonics research and development, science and technology, and space.\nFY 2022 Interior-Environment Appropriations, Issues pertaining to wildfire research.\nFY 2022 Agriculture Appropriations, Issues pertaining to wildfire research.","Issues pertaining to academic and research infrastructure including competitiveness funding in an infrastructure package.\nFY 2022 Commerce/Justice/Science Appropriations, Issues pertaining to NIST, NOAA, NASA, and NSF.\nH.R. 4432, FY 2022 Defense Appropriations, Issues pertaining to research, development, and education at the Department of Defense, including basic research, Basic Research Initiatives, hypersonics research and development, science and technology, and space.\nH.R. 4372, FY 2022 Interior-Environment Appropriations, Issues pertaining to wildfire research.","S. 1260, U.S. Innovation and Competition Act of 2021 (Endless Frontier Act), Issues pertaining to the Endless Frontier Act.\nNIST Reauthorization, Issues pertaining to academic infrastructure.\nH.R. 2225, NSF for the Future Act, All provisions.","H.R. 5376, Build Back Better Act, Issues pertaining to NSF, NASA, NOAA, NIST, and regional innovation funding.\nH.R. 4505, FY 2022 Commerce/Justice/Science Appropriations, Issues pertaining to NIST, NOAA, NASA, and NSF.\nH.R. 4502, FY 2022 Interior-Environment Appropriations, Issues pertaining to wildfire research.","H.R. 4609, NIST for the Future Act of 2021, Issues pertaining to academic infrastructure.\nH.R. 2225, NSF for the Future Act, All provisions. \nS. 1260, U.S. Innovation and Competition Act of 2021 (Endless Frontier Act), Issues pertaining to the Endless Frontier Act."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}