{"id":172735,"name":"THE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES","slug":"the-travelers-companies-inc-and-subsidiaries","state":"CT","description":"Insurance","totalSpending":1240000,"filings":26,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":240000},{"year":2020,"income":160000},{"year":2021,"income":160000},{"year":2022,"income":160000},{"year":2024,"income":160000},{"year":2025,"income":240000}],"firms":["NAVIGATORS GLOBAL LLC (FORMERLY DC NAVIGATORS, LLC)"],"lobbyists":["PHILMORE ANDERSON","CHRISTOPHER COX","ADO MACHIDA","RYAN BERGER","SARAH (BEATTY) ROGERS","ANDY KEISER","CESAR CONDA","JIM CARTER"],"issues":["BUD","INS"],"sampleDescriptions":["General issues relating to the Insurance industry","General issues relating to the Insurance industry\nIssues related to minimal diversity (H.R.3487)","General issues relating to the insurance industry.\nIssues relating to minimal diversity standards.\nIssues relating to the air medical service industry.","General issues relating to the insurance industry.","General issues relating to the insurance industry.\nIssues relating to minimal diversity standards.\nIssues relating to the air medical service industry.\nIssues relating to COVID-19 Global Pandemic Response and Recovery Efforts.\nIssues relating to autonomous vehicles.","General issues related to the insurance industry.","General issues related to the insurance industry.\nIssued related to minimal diversity standards.\nIssues related to COVID-19 global pandemic response and recovery efforts, including the implementation of relief legislation.","General issues related to the insurance industry.\nIssues related to the FY22 budget and appropriations process.","General issues related to the insurance industry.\nIssued related to minimal diversity standards.","General issues related to the insurance industry. Issued related to minimal diversity standards.","General issues related to the insurance industry. Issues related to the FY22 and FY23 budget and appropriations process.","General issues related to the insurance industry. Issues related to the FY23 budget and appropriations process.","General issues related to the insurance industry. Issues related to the FY23 budget and appropriations process, including H.R.6833.","General issues related to the insurance industry. Issued related to minimal diversity standards. Issues related to cyber security and insurance.","General issues related to the insurance industry. Issues related to the FY23 budget and appropriations process, including H.R.2617, Consolidated Appropriations Act, 2023.","General issues related to the insurance industry. Issues related to the FY24 budget and appropriations process. Issues related to the FY25 budget and appropriations process.","General issues related to the insurance industry. Issues related to the FY25 budget and appropriations process.","General issues related to the insurance industry. Issues related to the FY25 budget and appropriations process, including H.R. 10445, the Further Continuing Appropriations and Disaster Relief Supplemental Appropriations Act, 2025, and H.R.10545, the American Relief Act, 2025.","General issues related to the insurance industry. Issues related to corporate governance. Cyber security issues as related tot he insurance industry.","General issues related to the insurance industry. Issues related to the FY25 appropriations process, including H.R.1968 - Full-Year Continuing Appropriations and Extensions Act, 2025. Issues related to the FY26 appropriations process."],"years":[2018,2019,2020,2021,2022,2024,2025]}