{
  "id": 168040,
  "name": "THE CHEROKEE NATION",
  "slug": "the-cherokee-nation",
  "state": "OK",
  "description": "Government Relations",
  "totalSpending": 2180000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 240000
    },
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 240000
    },
    {
      "year": 2022,
      "income": 320000
    },
    {
      "year": 2023,
      "income": 360000
    },
    {
      "year": 2024,
      "income": 360000
    },
    {
      "year": 2025,
      "income": 180000
    }
  ],
  "firms": [
    "CORNERSTONE GOVERNMENT AFFAIRS, INC."
  ],
  "lobbyists": [
    "MICHAEL SMITH",
    "JAMES RICHARDS",
    "TIMOTHY WOLFMEYER",
    "ANTHONY LAZARSKI",
    "JOHN LEGGIERI",
    "WILLIAM SMITH",
    "JOHN KEAST"
  ],
  "issues": [
    "IND",
    "BUD",
    "DEF",
    null
  ],
  "sampleDescriptions": [
    "Stigler Act Amendments of 2017; SDPI; 2020 census, Tribal HUD-VASH program",
    "FY2018 Appropriations; FY 2019 Budget Request",
    "Stigler Act Amendments of 2017; Tribal HUD-VASH program; Tribal Labor Sovereignty Act; Medicaid work requirements; Indian Child Welfare Act",
    "National Defense Authorization Act",
    "FY 2019 Interior Appropriations; IHS New Facilities funding; IHS New Tribes funding",
    "Stigler Act Amendments of 2017; Medicaid work requirements; Indian Child Welfare Act; Section 184 Indian Home Loan Guarantee Program",
    "Stigler Act Amendments of 2017; Medicaid work requirements; Indian Child Welfare Act; Johnson-O'Malley Supplemental, Indian Education Program Modernization Act",
    "Advanced Appropriations for the Indian Health Service/Bureau of Indian Affairs, Staffing and Operations Costs for Newly-Constructed Indian Health Service Facilities, Expanding Contracting Opportunities for Small Businesses Act, Indian Arts and Crafts Act",
    "Advanced Appropriations for the Indian Health Service/Bureau of Indian Affairs, Staffing and Operations Costs for Newly-Constructed Indian Health Service Facilities, Expanding Contracting Opportunities for Small Businesses Act, NDAA",
    "Small Business Administration Reauthorization Act, Safeguard Tribal Objects of Patrimony Act, PACED Act, FY 2020 National Defense Authorization Act, Staffing and Operations Costs for Newly-Constructed Indian Health Service Facilities, Seating a Cherokee Nation delegate in the House of Representatives",
    "HR 6201, HR 748, Stolen Heritage Prevention Act, NAHASDA reauthorization, FY21 appropriations, P.L. 105-277",
    "HR 6800, FY21 appropriations, NAHASDA reauthorization, HR 7263",
    "CARES Act, HEROES Act, HEALS Act, FY21 appropriations, Census Deadline Extensions Act, HR 8162, HR 8255",
    "HR 133, S. 3044, Durbin Feeling Native American Language Act of 2020, S. 1790",
    "H.R. 1319, seating of Cherokee Nation delegate, CARES Act, NAHASDA",
    "Cherokee Nation and Chickasaw Nation Criminal Jurisdiction Compacting Act, American Rescue Plan Act, seating of Cherokee Nation delegate, NAHASDA, National Defense Authorization Act of 2021, CARES Act, Durbin Feeling Native American Languages Act",
    "Cherokee Nation and Chickasaw Nation Criminal Jurisdiction Compacting Act, American Rescue Plan Act, seating of Cherokee Nation delegate in U.S. House of Representatives, Native American Housing and Self-Determination Act, Durbin Feeling Native American Languages Act, HR 3684, Indian Child Welfare Act, Native American provisions within the Build Back Better Act",
    "Cherokee Nation and Chickasaw Nation Criminal Jurisdiction Compacting Act, Indigenous Peoples Day Act, Infrastructure Investment and Jobs Act, Indian Buffalo Management Act, seating of the Cherokee Nation delegate in the U.S. House of Representatives, Native American Housing and Self-Determination Act, Durbin Feeling Native American Languages Act, FY 2022 Interior Appropriations, Indian Child Welfare Act, FY 2022 National Defense Authorization Act",
    "Seating of Cherokee Nations delegate in the U.S. House of Representatives, FY 2022 Interior Appropriations, RESPECT Act, Indian Child Welfare Act, Durbin Feeling Native American Languages Act, IHS Contract Support Cost Amendment Act, IHS advanced appropriations, VAWA reauthorization, Infrastructure Investment and Jobs Act",
    "Seating of Cherokee Nations delegate in the U.S. House of Representatives, FY 2023 Interior Appropriations, Bipartisan Safer Communities Act, Indian Child Welfare Act, Durbin Feeling Native American Languages Act"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -25,
  "trajectory": "reducing",
  "yearsActive": 8,
  "avgAnnualSpending": 272500,
  "peakYear": 2023,
  "lobbyistCount": 7,
  "firmCount": 1,
  "issueCount": 3
}