{"id":123128,"name":"THE AMERICAN INSTITUTE OF ARCHITECTS","slug":"the-american-institute-of-architects","state":"DC","description":"Architect Advocacy","totalSpending":1460000,"filings":25,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":120000},{"year":2022,"income":240000},{"year":2024,"income":120000},{"year":2025,"income":300000}],"firms":["HANCE SCARBOROUGH"],"lobbyists":["MICHAEL TOMBERLIN","JIM TURNER","ROBERT PORE","KENT HANCE","THERESA REED","TAYLOR SEYL"],"issues":["TAX","BUD","ENG","AVI","GOV","HOU","URB","DIS","EDU","ECN"],"sampleDescriptions":["Legislation affecting AIA in tax, energy, student lending, and appropriations.","Lobbied on the inclusion of qualifications based selection.","Legislation affecting AIA in tax, energy, student lending, and appropriations.\n\nLobbied on Section 179D, the Energy Efficient Commercial Building Tax Deduction.  No bill number.\n\nLobbied on full repeal of the Foreign Investment in Real Property Tax Act. H.r. 2210 Invest in America Act.\n\nLobbied on the low income housing tax credit.  No bill number.\n\nLobbied on the middle income housing tax credit.  Middle-Income Housing Tax Credit Act of 2018.\n\nResearched the qualified improvement property of the Tax Cuts and Jobs Act of 2017, H.R.1, and potential expansion to include energy efficiency qualified improvement property.\n\nLobbied on Section 25C, the Nonbusiness Energy Property Credit.\n\nLobbied on Section 45L, the Energy Efficient Home Credit.","Legislation affecting AIA in tax, energy, student lending, and appropriations.\n\nLobbied fro inclusion of a provision in H.R. 3055, the Departments of Commerce, Justice, Science, and Related Agencies Appropriations Act of 2019, to recognize the role of architects in the design of safe schools.","Lobbied the appointment process of the Architect of the Capitol.\n\nResearched issued and lobbied on appointment process regarding the US Commission on Fine Arts.\n\nLobbied GSA regarding architecture and public buildings.","Legislation affecting AIA in tax, energy, student lending, and appropriations.\n\nLobbied on the energy efficiency tax extenders; Sec 25C Nonbusiness Energy Property Credit, Sec. 179D Commercial Building Tax Deduction, 45L Energy Efficient Home Credit.","Lobbied on the importance of building codes in affordable housing.  No bill number.","Lobbied the House and Senate Appropriations subcommittee on Financial Services and General Government to prevent the establishment of a federal design preference for public buildings.","Lobbied for the inclusion of building in a federal infrastructure policy bill. No bill number.","Lobbied on Section 179D, the Energy Efficient Commercial Building Tax Deduction.  No bill number.\n\nResearched the qualified improvement property of the Tax Cuts and Jobs Act of 2017, H.R.1, and potential expansion to include energy efficiency qualified improvement property.\n\nLobbied on Section 25C, the Nonbusiness Energy Property Credit.\n\nLobbied on Section 45L, the Energy Efficient Home Credit.\n\nLobbied on the research and development tax credit.  No bill number.\n\nLobbied HR 2825.  Historic Tax Credit Growth and Opportunity Act of 2019.  The bill would amend the Internal Revenue Code of 1986 to modify the rehabilitation credit for certain small projects, to eliminate the requirement that the taxpayer's basis in a building be reduced by amount of the rehabilitation credit determined with respect to such building, and for other purposes.\n\nLobbied S 1428.  Retirement Parity for Student Loans Act.  The bill would amend the Internal Revenue Code of 1986 to permit treatment of student loan payments as elective deferrals for purposes of employer matching contributions, and for other purposes.\n\nLobbied on the Stronger, Healthier Environment for Low-Income Tenants and Economic Renewal (SHELTER) Act.S. 1958, H.R. 3462.","Lobbied FEMA on the implementation of the H.R. 4460/S. 3041 the Disaster Relief and Recovery Act regarding architects' role in the post disaster relief effort.\n\nLobbied on the Stronger, Healthier Environment for Low-Income Tenants and Economic Renewal (SHELTER) Act. S. 1958, H.R. 3462.","Lobbied on appointment process regarding the US Commission on Fine Arts.\n\nLobbied GSA and White House regarding architecture and public buildings.\n\nLobbied the House Transportation and Infrastructure Committee and the Senate Environment and Public Work Committee to prevent the establishment of a federal design preference for federal buildings.","Lobbied on energy efficiency tax extenders; Sec 25C Nonbusiness Energy Property Credit, Sec. 179D Commercial Building Tax Deduction, 45L Energy Efficient Home Credit.\n\nLobbied against the adoption of the proposed withdrawal to final rule on Energy Conservative Program entitled: Energy Conservation Standards for General Service Incandescent Lamps: 82 FR 7276 and 82 FR 7322, amending 10 CFR 430.2.\n\nLobbied on the energy use intensity targets, building code provisions, and the energy sourcing requirements of the Energy Savings and Industrial Competitiveness Act, S. 2137, H.R. 3962.","Lobbied for S 2530, The School Safety Clearinghouse Act, a bill to establish a federal clearinghouse of school design best practices.  \n\nLobbied updating federal design guidelines for schools.  No bill number.","Lobbied on energy efficiency tax extenders; Sec 25C Nonbusiness Energy Property Credit, Sec. 179D Commercial Building Tax Deduction, 45L Energy Efficient Home Credit.\n\nLobbied on the energy use intensity targets, building code provisions, and the energy sourcing requirements of the Energy Savings and Industrial Competitiveness Act, S. 2137, H.R. 3962.","Lobbied updating federal design guidelines for schools through the School Safety Clearinghouse.","Lobbied on Section 179D, the Energy Efficient Commercial Building Tax Deduction. \n\nResearched the qualified improvement property of the Tax Cuts and Jobs Act of 2017, H.R.1, and potential expansion to include energy efficiency qualified improvement property.\n\nLobbied on Section 25C, the Nonbusiness Energy Property Credit.\n\nLobbied on Section 45L, the Energy Efficient Home Credit.\n\nLobbied on the research and development tax credit.  No bill number.\n\nLobbied HR 2825.  Historic Tax Credit Growth and Opportunity Act of 2019.  The bill would amend the Internal Revenue Code of 1986 to modify the rehabilitation credit for certain small projects, to eliminate the requirement that the taxpayer's basis in a building be reduced by amount of the rehabilitation credit determined with respect to such building, and for other purposes.\n\nLobbied S 1428.  Retirement Parity for Student Loans Act.  The bill would amend the Internal Revenue Code of 1986 to permit treatment of student loan payments as elective deferrals for purposes of employer matching contributions, and for other purposes.\n\nLobbied on the Stronger, Healthier Environment for Low-Income Tenants and Economic Renewal (SHELTER) Act.S. 1958, H.R. 3462.\n\nH.R. 2 The Moving Forward Act\n\nThe Growing Renewable Energy and Efficiency Now (GREEN) Act, No bill number.","Lobbied FEMA on the implementation of the H.R. 4460/S. 3041 the Disaster Relief and Recovery Act regarding architects' role in the post disaster relief effort.\n\nLobbied on the Stronger, Healthier Environment for Low-Income Tenants and Economic Renewal (SHELTER) Act. S. 1958, H.R. 3462.\n\nLobbied FEMA to share the AIA's Re-occupancy Assessment Tool with shareholders.\n\nAIA submitted formal comments in response to the FEMA Proposed Policy: Hazard Mitigation Assistance: Building Resilient Infrastructure and Communities, Docket No. FEMA-2019-0018.","Lobbied for the inclusion of buildings in a federal infrastructure policy bill.  \n\nH.R. 2, The Moving Forward Act, S. 3548, The Coronavirus Aid Relief, and Economy Security (CARES) Act.\n\nLobbied for the inclusion of 501(c)6 organizations in the Paycheck Protection Program (PPP). H.R. 7010 the Paycheck Protection Program Flexibility Act of 2020. S. 3548 the Coronavirus Aid, Relief, and Economic Security Act (CARES).","Lobbied GSA and White House regarding architecture and public buildings.\n\nLobbied the House Transportation and Infrastructure Committee and the Senate Environment and Public Work Committee to prevent the establishment of a federal design preference for federal buildings."],"years":[2018,2019,2020,2021,2022,2024,2025]}