{"id":151446,"name":"THE VANGUARD GROUP, INC.","slug":"the-vanguard-group-inc","state":"PA","description":"Mutual Funds","totalSpending":1860000,"filings":31,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["WILLIAMS AND JENSEN, PLLC"],"lobbyists":["JOEL OSWALD","JOHN MCMACKIN","CHRISTOPHER HATCHER","DAVID FRANASIAK","DAVID STARR","SUSAN HIRSCHMANN","MELINDA MAXFIELD","FRANK VLOSSAK","ANDREW JONES","JENNIFER WANANDI","ERIN MULLEN","NICHOLAS KARELLAS","CHRISTOPHER WILCOX","MAHLET MAKONNEN","MARTI THOMAS","DANIEL ZIEGLER","JOSHUA FENDRICK"],"issues":["FIN","TAX","RET",null],"sampleDescriptions":["Dodd-Frank regulations - systemic risk, FSOC, SIFI issues;  Mutual Fund, ETF, Money Market Fund, and securities issues; Financial Choice Act; electronic delivery of shareholder reports; H.R. 4061, FSOC Improvement Act; H.R. 4566, Alleviating Stress Test Burdens to Help Investors Act.  Equity Market Structure; H.R. 2319 and S. 1117, Consumer Financial Choice and Capital markets Protection Act.","General tax issues related to mutual funds; commodity related investments, savings; capital gains and dividend tax rates as they relate to mutual funds; security transaction tax proposals.","General tax issues related to mutual funds; commodity related investments, savings and retirement; capital gains and dividend tax rates as they relate to mutual funds; security transaction tax proposals.","H.R.1994 SECURE Act.","Mutual fund, ETF, money market mutual fund, securities, and systemic risk issues; S.603, the Financial Stability Oversight Council Improvement Act; S.733, Consumer Financial Choice and Capital Markets Protection Act; equity market structure.","General tax issues related to mutual funds; commodity related investments, savings and retirement; capital gains and dividend tax rates as they relate to mutual funds; securities transaction tax proposals.  H.R. 1974 (SECURE Act).","H.R. 1994 SECURE Act. Division O of H.R. 1865.","General tax issues related to mutual funds; commodity related investments, savings and retirement; capital gains and dividend tax rates as they relate to mutual funds; securities transaction tax proposals.  H.R. 1974 (SECURE Act).  Division O of H.R. 1865.","Electronic delivery.  Retirement and savings issues, generally.","Mutual fund, ETF, money market mutual fund, securities, and systemic risk issues; S.603 and H.R. 3561, the Financial Stability Oversight Council Improvement Act; S.733, Consumer Financial Choice and Capital Markets Protection Act; equity market structure.","General tax issues related to mutual funds; commodity related investments, savings and retirement; capital gains and dividend tax rates as they relate to mutual funds; securities transaction tax proposals.","Electronic delivery.  Retirement and savings issues, generally.  H.R. 8696, Securing a Strong Retirement Act of 2020; S.1431, Retirement Security and Savings Act","Retirement and savings issues, generally; Securing a Strong Retirement Act.","Mutual fund, ETF, money market mutual fund, securities, and systemic risk issues; equity market structure.","General tax issues related to mutual funds; securities transaction tax proposals.","Retirement and savings issues, generally; Securing a Strong Retirement Act of 2021 (H.R. 2954).  Retirement Security & Savings Act (S. 1770).","General tax issues related to mutual funds; securities transaction tax proposals.   Pass-through reform Discussion Draft legislation regarding in-kind redemptions.","General tax issues related to mutual funds; securities transaction tax proposals. Passthrough reform Discussion Draft legislation regarding in-kind redemptions.","Retirement and savings issues, generally; Securing a Strong Retirement Act of 2021 (H.R. 2954). Retirement Security & Savings Act (S. 1770).","Mutual fund, ETF, money market mutual fund, securities, and systemic risk issues; equity market structure; S.4241 (INDEX Act)."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}