{
  "id": 169808,
  "name": "THE INTERSTATE NATURAL GAS ASSOCIATION OF AMERICA",
  "slug": "the-interstate-natural-gas-association-of-america",
  "state": "DC",
  "description": "Natural gas pipeline industry trade organization",
  "totalSpending": 1460000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 60000
    },
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 240000
    },
    {
      "year": 2021,
      "income": 180000
    },
    {
      "year": 2022,
      "income": 180000
    },
    {
      "year": 2023,
      "income": 180000
    },
    {
      "year": 2024,
      "income": 140000
    },
    {
      "year": 2025,
      "income": 240000
    }
  ],
  "firms": [
    "CGCN GROUP, LLC"
  ],
  "lobbyists": [
    "STEVE CLARK",
    "SAM GEDULDIG",
    "JAY CRANFORD",
    "MIKE NIELSEN",
    "DOUGLAS SCHWARTZ",
    "JOHN STIPICEVIC",
    "KATIE MITCHELL",
    "MICHAEL FREEMAN",
    "JULIANE SULLIVAN",
    "AARON SZABO",
    "ALEX RENJEL",
    "SCOTT RIPLINGER",
    "AMBER KIRCHHOEFER",
    "TIM PATAKI",
    "MARTHA MILLER",
    "JILL HAMAKER",
    "SUSAN GRIFFITHS",
    "TRAVIS CONE"
  ],
  "issues": [
    "TRA",
    "ENV",
    "ENG",
    "NAT",
    "TRD",
    "FUE",
    "CAW",
    "TAX",
    "HOM",
    null
  ],
  "sampleDescriptions": [
    "Issues associated with the siting, permitting, safety, security and construction of interstate natural gas pipelines.",
    "PHMSA reauthorization and other related pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; CEQs National Environmental Policy Act regulations; Issues related to COVID-19 with respect to the natural gas pipeline industry, including PPE; EPA Clean Water Act and Clean Air Act regulations and actions.",
    "PHMSA reauthorization and other related pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Bills and regulations related to the Natural Gas Act.",
    "EPA Clean Water Act and Clean Air Act regulations and actions.",
    "CEQs National Environmental Policy Act regulations.",
    "Issues related to the use of Nationwide Permits for the natural gas industry.",
    "PHMSA reauthorization and other related pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; Issues related to COVID-19 with respect to the natural gas pipeline industry, including PPE; EPA Clean Water Act and Clean Air Act regulations and actions.",
    "Pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Bills and regulations related to the Natural Gas Act.",
    "Pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; Issues related to COVID-19 with respect to the natural gas pipeline industry, including PPE; EPA Clean Water Act and Clean Air Act regulations and actions.",
    "Issues related to taxation of methane.",
    "Pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; EPA Clean Water Act and Clean Air Act regulations and actions.",
    "Critical infrastructure cybersecurity issues related to National Defense Authorization Act.",
    "Issues related to pipeline methane emissions in the Build Back Better Act.",
    "Pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; EPA Clean Water Act and Clean Air Act regulations and actions. Lobbied on new FERC natural gas certificate and greenhouse gas policy statements (Docket No. PL18-1 & Docket No. PL21-3).",
    "Lobbied generally on critical infrastructure cybersecurity issues.",
    "Pipeline safety and security bills; PHMSA regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; EPA Clean Water Act and Clean Air Act regulations and actions. Lobbied on new FERC natural gas certificate and greenhouse gas policy statements (Docket No. PL18-1 & Docket No. PL21-3) Lobbied on S.3714, Energy Independence and Security Act of 2022, all provisions. Lobbied on behalf of the Continuing Resolution due to potential permitting reform provisions.",
    "Pipeline safety and security bills; PHMSA reauthorization regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act; EPA Clean Water Act and Clean Air Act regulations and actions.",
    "Issues related to the use of Nationwide Permits for the natural gas industry; EPA Regulations generally.",
    "Pipeline safety and security bills; PHMSA reauthorization and actions related to the natural gas pipeline industry; Bills and regulations related to the Natural Gas Act.",
    "Pipeline safety and security bills; PHMSA reauthorization regulations and actions related to the natural gas pipeline industry; Nationwide permit issues and regulations; Bills and regulations related to the Natural Gas Act, including S. 4171, Making Pipelines Accountable to Consumers and Taxpayers (MPACT) Act (provisions relating to the interstate natural gas pipeline infrastructure sector); EPA Clean Water Act and Clean Air Act regulations and actions."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 300,
  "trajectory": "exploding",
  "yearsActive": 8,
  "avgAnnualSpending": 182500,
  "peakYear": 2019,
  "lobbyistCount": 18,
  "firmCount": 1,
  "issueCount": 9,
  "industry": "energy"
}