{"id":124807,"name":"THOMSON REUTERS","slug":"thomson-reuters","state":"NY","description":null,"totalSpending":1840000,"filings":24,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":320000},{"year":2020,"income":160000},{"year":2021,"income":320000},{"year":2022,"income":320000},{"year":2024,"income":280000},{"year":2025,"income":280000}],"firms":["HOLLAND & KNIGHT LLP"],"lobbyists":["GERRY SIKORSKI","KATHRYN LEHMAN","JOEL ROBERSON","MARISSA SERAFINO","ETHAN JORGENSEN-EARP","KAYLA GEBECK","SARA PETERS"],"issues":["MIA","GOV"],"sampleDescriptions":["Issues of interest to the information industries; access to public record information; general data policy, privacy, government security and data security; development of federal data privacy legislation.","Issues of interest to the information industries; access to public record information; general data policy, privacy, government security and data security; development of federal data privacy legislation; H.R. 6714, the Electronic Court Records Reform Act of 2018.","Issues of interest to the information industries; access to public record information; general data policy, privacy, government security and data security; development of federal data privacy legislation; H.R. 1164, the Electronic Court Records Reform Act of 2019.","Issues of interest to the information industries; access to public record information; general data, privacy, government security and data security policy issues; development of federal data privacy legislation; H.R. 1164, the Electronic Court Records Reform Act of 2019.","Issues of interest to the information industries; access to public record information; general data, privacy, government security and data security policy issues; development of federal data privacy legislation; H.R. 1164, the Electronic Court Records Reform Act of 2019; copyright modernization.","Identification and prevention of waste, fraud and abuse in government aid related to the COVID-19 pandemic.","Issues of interest to the information industries; access to public record information; general data, privacy, government security and data security policy issues; development of federal data privacy legislation; copyright modernization; media access to the Department of Labor lock-up prior to economic data releases","Identification and prevention of waste, fraud and abuse in government aid related to the COVID-19 pandemic; H.R. 925, The Heroes Act and Senate COVID relief package.","Issues of interest to the information industries; access to public record information; general data, privacy, government security and data security policy issues; development of federal data privacy legislation.","Issues of interest to the information industries; access to public record information; general data, privacy, government security and data security policy issues; development of federal data privacy legislation; legislation to reform the federal court records management system.","Identification and prevention of waste, fraud and abuse in government aid related to the COVID-19 pandemic; the American Rescue Plan (Public Law 117-2).","Identification and prevention of waste, fraud and abuse in government aid related to the COVID-19 pandemic; implementation of the American Rescue Plan (Public Law 117-2); federal funding for access to justice by addressing court hearing backlogs.","Issues of interest to the information industries; access to public record information; general data, privacy, government security and data security policy issues; development of federal data privacy legislation; legislation to reform the federal court records management PACER system.","Issues of interest to the information industries; access to public record information; issues related to data privacy, government security and data security policy; development of federal data privacy legislation; legislation to reform the federal court records management PACER system.","Issues of interest to the information industries; access to public record information; issues related to data privacy and cybersecurity; development of federal data privacy legislation; legislation to reform the federal court records management PACER system (S. 2614 and H.R. 5844); news media access to Russia and Ukraine to gather and distribute independent journalism (H.R. 7185).","Identification and prevention of waste, fraud and abuse in government aid related to the COVID-19 pandemic; implementation of the American Rescue Plan (Public Law 117-2).","Issues of interest to the information industries; access to public record information; issues related to data privacy and cybersecurity; federal data privacy legislation (H.R. 8152); Open Courts Act to reform the federal court records management PACER system (S. 2614 and H.R. 5844); news media access to Russia and Ukraine to gather and distribute independent journalism in the Federal Contracting for Peace and Security Act (H.R. 7185).","Identification and prevention of waste, fraud and abuse in government aid related to the COVID-19 pandemic; implementation of the American Rescue Plan (Public Law 117-2); Stop Fraud Act (H.R. 8322); Chase COVID Unemployment Fraud Act of 2022 (H.R. 8000 and S. 4507).","Issues of interest to the information industries; access to public record information; issues related to data privacy and cybersecurity; federal data privacy legislation (H.R. 8152); Federal Trade Commission rulemaking on commercial surveillance and data security; Open Courts Act to reform the federal court records management PACER system (S. 2614 and H.R. 5844); news media access to Russia and Ukraine to gather and distribute independent journalism in the Federal Contracting for Peace and Security Act (H.R. 7185).","Issues of interest to the information industries; access to public record information; issues related to data privacy and cybersecurity; federal data privacy legislation (H.R. 8152); Federal Trade Commission rulemaking on commercial surveillance and data security; Open Courts Act to reform the federal court records management PACER system (S. 2614 and H.R. 5844); news media access to Russia and Ukraine to gather and distribute independent journalism in the Federal Contracting for Peace and Security Act (H.R. 7185); federal government funding."],"years":[2018,2019,2020,2021,2022,2024,2025]}