{"id":162725,"name":"THRIVENT FINANCIAL FOR LUTHERANS","slug":"thrivent-financial-for-lutherans","state":"WI","description":null,"totalSpending":3040000,"filings":23,"yearlySpending":[{"year":2018,"income":330000},{"year":2019,"income":330000},{"year":2020,"income":370000},{"year":2021,"income":560000},{"year":2022,"income":600000},{"year":2024,"income":520000},{"year":2025,"income":330000}],"firms":["VENN STRATEGIES"],"lobbyists":["STEPHANIE SILVERMAN","MELISSA FRANCIS (FORMERLY BONICELLI)","TIM CAREY","MICHAEL LANZA","SKYLAR BORCHARDT","KEVIN DOWLING","JUSTIN LIVESEY","NOAH SCHLOEGEL","SAMUEL GOODSTEIN","JENNIFER TAFT"],"issues":["FIN","TAX","RET","LAW","CSP","BAN","INS"],"sampleDescriptions":["Financial services issues impacting fraternal benefit societies.","Tax issues concerning financial services, retirement policy, tax-exempt organizations, and fraternal benefit societies.","Retirement security issues concerning fraternal benefit societies.","Financial services issues impacting fraternal benefit societies including arbitration policy.","Tax issues concerning financial services, life insurance, retirement policy, tax-exempt organizations, and fraternal benefit societies.","Retirement security issues concerning fraternal benefit societies, including long-term care insurance.","Financial services issues concerning financial services, life insurance, retirement policy, tax-exempt organizations, and fraternal benefit societies.","Financial Services issues impacting fraternal benefit societies, including arbitration policy, as well as independent contractor status and bank charters.","tax issues concerning financial services and products, retirement policy, tax-exempt organizations, and fraternal benefit societies.","Tax issues concerning financial services and products, retirement policy, tax-exempt organizations, and fraternal benefit societies.","Financial Services issues impacting fraternal benefit societies, including arbitration policy, as well as independent contractor status and financial institution charters.","Financial Services issues impacting fraternal benefit societies, including arbitration policy and financial institution charters.","Arbitration/joint action policy under the FAIR Act (HR 963) and data privacy legislation HR.8152.","Tax issues concerning financial services and products, long-term care, retirement policy, tax-exempt organizations, and fraternal benefit societies.","Arbitration/joint action policy under the data privacy legislation HR.8152.","Tax issues concerning financial services and products, long-term care, retirement policy, tax-exempt organizations, and fraternal benefit societies, including H.Con.Res. 65/S.Con.Res. 10, and Securing a Strong Retirement Act, HR 2954/Enhancing American Retirement Now Act, S. 4808.","Retirement security issues concerning fraternal benefit societies, including Securing a Strong Retirement Act, HR 2954/Enhancing American Retirement Now Act, S. 4808.","Arbitration/joint action policy under the data privacy legislation HR.8152/S. 3195.","Financial services issues impacting fraternal benefit societies including the Department of Labor Retirement Security proposed rule (RIN: 1210-AC02), the Investor Choice Act (H.R. 2620/ S. 1171), and industrial loan company legislation (S. 5189).","Tax issues concerning fraternal benefit societies including the resolution H.Con.Res. 28 and S.Con.Res. 8."],"years":[2018,2019,2020,2021,2022,2024,2025]}