{"id":144973,"name":"TOHONO O'ODHAM NATION","slug":"tohono-o-odham-nation","state":"AZ","description":"Tribal Nation","totalSpending":2490000,"filings":31,"yearlySpending":[{"year":2018,"income":190000},{"year":2019,"income":310000},{"year":2020,"income":360000},{"year":2021,"income":350000},{"year":2022,"income":260000},{"year":2023,"income":250000},{"year":2024,"income":370000},{"year":2025,"income":400000}],"firms":["DENTONS US LLP"],"lobbyists":["HEATHER SIBBISON","ALEXANDER LURIE","SAMUEL DAUGHETY","SUZANNE SCHAEFFER","JOHN RUSSELL","VALERIE NELSON","ROSE PETOSKEY","NATASHA JOHN","MAURISA BELL","STEPHANIE SFIRIDIS","CATELIN AIWOHI"],"issues":["BUD","IND",null],"sampleDescriptions":["Grant funding and appropriations for federal Indian programs; Funding for the Southern AZ Water Rights Settlement Act; infrastructure funding","West Valley Resort Gaming facility issues","General legislation regarding tribal matters, tribal programs, and border security issues.","Federal grant funding and appropriations for federal Indian programs; funding for the Southern AZ Water Rights Settlement Act; infrastructure funding.","Federal grant funding and appropriations for federal Indian programs; funding for the Southern AZ Water Rights Settlement Act; infrastructure funding.  Response to COVID 19, CARES Act programs.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief. CARES Act;","Federal grant funding and appropriations for federal Indian programs; funding for the Southern AZ Water Rights Settlement Act; infrastructure funding.  Response to COVID 19, CARES Act programs; COVID-19 relief.","Federal grant funding and appropriations for federal Indian programs; funding for the Southern AZ Water Rights Settlement Act; infrastructure funding.  Response to COVID 19;","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief legislation.","Federal grant funding and appropriations for federal Indian programs; funding for the Southern AZ Water Rights Settlement Act; infrastructure funding.  COVID Relief Package;","Federal grant funding and appropriations for federal Indian programs; funding for the Southern AZ Water Rights Settlement Act;  Funding from COVID Relief Package; American Recovery Act of 2021 funding programs; FY 22 Appropriations; Infrastructure Package.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief legislation. American Recovery Act of 2021.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief legislation. American Recovery Act of 2021. Infrastructure proposals. Community Projects in FY 22 Appropriations.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief funding. American Recovery Act of 2021. Implementation of Infrastructure legislation; Final Omnibus Appropriations for FY 22; Community Projects in FY 23 Appropriations.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief funding. Implementation of American Recovery Act of 2021. Implementation of Infrastructure legislation; FY 23 appropriations bills and Community Projects.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief funding. Implementation of Infrastructure legislation; Community Project funding in FY 23 Appropriations.","General legislation regarding tribal matters, tribal programs, and border security issues; COVID-19 relief funding. Implementation of American Recovery Act; Implementation of Infrastructure legislation; FY 23 appropriations bills and Community Projects.","General legislation regarding tribal matters, tribal programs, and border security issues; Implementation of American Recovery Act; Implementation of Infrastructure legislation; FY 23 appropriations bills and Community Projects.","General legislation regarding tribal matters, tribal programs, and border security issues; Implementation of Infrastructure legislation; Community Project funding in FY 23 Appropriations.","General legislation regarding tribal programs and border security;"],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}