{"id":169791,"name":"TRANSCANADA PIPELINES USA LTD","slug":"transcanada-pipelines-usa-ltd","state":null,"description":"Energy Infrastructure","totalSpending":2250000,"filings":25,"yearlySpending":[{"year":2018,"income":180000},{"year":2019,"income":270000},{"year":2020,"income":360000},{"year":2021,"income":360000},{"year":2022,"income":360000},{"year":2024,"income":360000},{"year":2025,"income":360000}],"firms":["CGCN GROUP, LLC"],"lobbyists":["JAY CRANFORD","MICHAEL FREEMAN","AARON SZABO","ALEX RENJEL","SUSAN GRIFFITHS","TRAVIS CONE"],"issues":["ENG","ENV"],"sampleDescriptions":["Natural Gas policies in the United States and between the U.S. and Canada&#205;&#190; Any energy legislation impacting cross border and domestic transmission of natural gas&#205;&#190; Policy issues and executive branch permitting of the Keystone XL and other pipelines; cybersecurity policy; and, Federal and tribal land.\nGeneral issues related to energy infrastructure.\nNatural Gas pipeline projects.\nOil pipeline safety performance.","Natural Gas policies in the United States and between the U.S. and Canada&#205;&#190; Any energy legislation impacting cross border and domestic transmission of natural gas&#205;&#190; Policy issues and executive branch permitting of the Keystone XL and other pipelines; cybersecurity policy; and, Federal and tribal land;\nGeneral issues related to energy infrastructure;\nNatural Gas pipeline projects;\nOil pipeline safety performance.","Natural Gas policies in the United States and between the U.S., Mexico and Canada&#205;&#190; Policy issues and executive branch permitting of the Keystone XL and other pipelines; cybersecurity policy; and, Federal and tribal land;\nGeneral issues related to energy infrastructure;\nNatural Gas pipeline projects;\nOil pipeline safety performance.","Natural Gas policies in the United States and between the U.S. Mexico and Canada&#205;&#190; Policy issues and executive branch permitting of the Keystone XL and other pipelines; cybersecurity policy; and, Federal and tribal land;\nGeneral issues related to energy infrastructure;\nNatural Gas pipeline projects;\nOil pipeline safety performance.","Policy issues and executive branch permitting on federal and tribal land of the Keystone XL and other pipelines.","Policy issues and executive branch permitting on federal and tribal land of liquids and natural gas pipelines.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines; H.R.5376; issues concerning energy usage and taxation; development of clean energy and emissions mitigation technology.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas and liquid energy pipelines, renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas and liquid energy pipelines, renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen; Issues related to the Manchin Permitting Bill and Continuing Resolution.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas and liquid energy pipelines; permitting approval of pending natural gas infrastructure projects; renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen; PHMSA reauthorization and actions related to the natural gas pipeline industry.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas and liquid energy pipelines, permitting approval of pending natural gas infrastructure projects; renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen; PHMSA reauthorization and actions related to the natural gas pipeline industry; EPA Regulations generally.","Policy issues and permitting on federal and tribal land of liquids and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas and liquid energy pipelines; permitting approval of pending natural gas infrastructure projects; renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen; PHMSA reauthorization and actions related to the natural gas pipeline industry; GPAC nominees.","Policy issues and permitting on federal and tribal land and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas pipelines; permitting approval of pending natural gas infrastructure projects; renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen; PHMSA reauthorization and actions related to the natural gas pipeline industry.","Policy issues and permitting on federal and tribal land and natural gas pipelines; Legislation and policy proposals impacting the transmission, permitting, and construction of natural gas pipelines, permitting approval of pending natural gas infrastructure projects; renewable electricity policy, CCUS, and alternative fuel sources like renewable natural gas and hydrogen; PHMSA reauthorization and actions related to the natural gas pipeline industry; EPA Regulations generally."],"years":[2018,2019,2020,2021,2022,2024,2025]}