{"id":187902,"name":"TRANSPORTATION INSTITUTE","slug":"transportation-institute","state":"MD","description":"A non-profit organization dedicated to maritime research education and promotion","totalSpending":1200000,"filings":10,"yearlySpending":[{"year":2018,"income":480000},{"year":2019,"income":360000},{"year":2020,"income":360000}],"firms":["BREAUX LOTT LEADERSHIP GROUP"],"lobbyists":["JOHN FLYNN","JOHN BREAUX","MATTHEW CUTTS","CHESTER LOTT","DAVID SCHNITTGER","BRET BOYLES","DAVID LESSTRANG"],"issues":["BAN","MAR","ENV"],"sampleDescriptions":["Issues related to Export-Import Bank of the United States.","Funding issues in support of P.L. 480, Food for Peace program; Maritime Security Program (MSP) and Cargo Preference.  Support Vessel Incidental Discharge Act (VIDA) as part of S. 1129, Coast Guard Authorization Act.\nIssues related to Puerto Rico Oversight, Management and Economic Stability Act.\nContinued support and protection of the Jones Act.  \nIssues related to conversion of merchant vessels from diesel to liquefied natural gas (LNG).","Permit issues related to conversion of merchant vessels from diesel fuel to Liquefied Natural Gas.","Funding issues in support of P.L. 480, Food for Peace program, Maritime Security Program (MSP) and Cargo Preference.  Oppose efforts to strip provisions of Cargo Preference requirements in the House, National Defense Authorization Act and Senate, Farm Bill.  Support inclusion of Vessel Incidental Discharge Act (VIDA) as part S. 1129, Coast Guard Authorization Act of 2017 or Omnibus Appropriations Act.  Issues related to Puerto Rico Oversight, Management, and Economic Stability Act.  Continued support and protection of the Jones Act.","Funding issues in support of P.L. 480, Food for Peace program, Maritime Security Program (MSP) and Cargo Preference.  Support inclusion of Vessel Incidental Discharge Act (VIDA) as part S. 1129, Coast Guard Authorization Act of 2017 or appropriations measures.  Issues related to Puerto Rico Oversight, Management, and Economic Stability Act.  Continued support and protection of the Jones Act.","Funding issues in support of P.L. 480, Food for Peace program, Maritime Security Program (MSP) and Cargo Preference.  Support inclusion of Vessel Incidental Discharge Act (VIDA) as part of Frank Lobiondo, Coast Guard Authorization Act of 2018 (P.L. 115-282).  Issues related to Puerto Rico Oversight, Management, and Economic Stability Act.  Continued support and protection of the Jones Act.","Funding issues in support of P.L. 480, Food for Peace program; Maritime Security Program (MSP) and Cargo Preference. \nContinue to advocate and advance support of the Jones Act.","Support extension and/or reauthorization of the Export-Import Bank of the United States.","Funding issues in support of P.L. 480, Food for Peace program, Maritime Security Program (MSP) and Cargo Preference.  Continued support and protection of the Jones Act.","Funding issues in support of P.L. 480, Food for Peace program, Maritime Security Program (MSP) and Cargo Preference.  Continued support and protection of the Jones Act.  \nAdvance and support efforts for ongoing tug engine replacement project.","Funding issues in support of the Maritime Security Program (MSP) related to COVID-19.  Continued support and protection of the Jones Act.  Issues related to waterborne transportation grant programs other relief measures in the Coronavirus Aid, Relief, and Economic Security Act and subsequent legislative relief measures.\nAdvance and support efforts for ongoing tug engine replacement project."],"years":[2018,2019,2020]}