{
  "id": 102518,
  "name": "TRAVERE THERAPEUTICS",
  "slug": "travere-therapeutics",
  "state": "CA",
  "description": "Prescription pharmaceutical manufacturer of medications.",
  "totalSpending": 1840000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 240000
    },
    {
      "year": 2020,
      "income": 180000
    },
    {
      "year": 2021,
      "income": 230000
    },
    {
      "year": 2022,
      "income": 240000
    },
    {
      "year": 2023,
      "income": 240000
    },
    {
      "year": 2024,
      "income": 240000
    },
    {
      "year": 2025,
      "income": 270000
    }
  ],
  "firms": [
    "ALSTON & BIRD LLP"
  ],
  "lobbyists": [
    "MARK RAYDER",
    "ROBERT SIGGINS",
    "MARILYN YAGER",
    "STEPHANIE CURTIS",
    "PETER ECKRICH",
    "Y. BRIAN LEE",
    "EMILY SHAW",
    "ELINOR HILLER",
    "CAROLYN SMITH",
    "JAMES PALUSKIEWICZ",
    "NIKITA VARMAN",
    "ZOE ATCHINSON",
    "JONATHAN JAGODA",
    "ADAM NAVARA"
  ],
  "issues": [
    "MMM",
    "MED",
    "TAX",
    "CPT",
    "HCR",
    "PHA",
    null
  ],
  "sampleDescriptions": [
    "Issues related to Section 53116 of Pub. L. 115-123 concerning Medicare Part D coverage gap; issues related to FY 2019 budget proposals with respect to Medicare and Medicaid reform provisions.",
    "Medical research, NIH funding, and related appropriations issues.",
    "Issues related to Tax Cuts and Jobs Act's provisions relating to Orphan Drug Tax Credit, development, and rare disease patient issues.",
    "Intellectual property issues and commercial litigation.",
    "Rare disease patient care and screening and coverage issues in authorization and appropriations legislation including Omnibus Appropriations Act of 2018.",
    "Issues related to Orphan Drug Act, Drug Quality and Security Act, drug pricing, Prescription Drug User Fee Act implementations; H.R. 2051, Fast Generics Act; S.3056, CREATES Act; FDA issues.",
    "Tax legislation relating to the Orphan Drug Tax Credit, development, and rare disease patient issues; implementation of HR 1, the Tax Cuts and Jobs Act.",
    "Rare disease patient care and screening and coverage issues in authorization and appropriations legislation; S. 1151 Credit for Caring Act.",
    "Issues related to FY 2019 budget proposals with respect to Medicare and Medicaid reform provisions.",
    "Issues related to Orphan Drug Act, Drug Quality and Security Act, drug pricing, Opioid legislation; H.R. 2051, Fast Generics Act; S. 974, CREATES Act; FDA issues.",
    "Issues related to Orphan Drug Act, Drug Quality and Security Act, drug pricing, H.R. 6, Opioid legislation and provisions concerning opioid-sparing; H.R. 2051, Fast Generics Act; S. 974, CREATES Act; FDA issues.",
    "Rare disease patient care and screening and coverage issues in authorization and appropriations legislation; S. 1151/H.R. 2505, Credit for Caring Act; H.R. Res. 1154/S. Res. 690, Affirming the importance of the Orphan Drug Act, et al.",
    "Issues related to the Orphan Drug Tax Credit.",
    "Rare disease patient care, screening, and coverage issues in authorization and appropriations legislation; Orphan Drug Act; HRes 242, Affirming importance of Orphan Drug Act.",
    "H.R. 1046, Medicare Price Negotiation and Competitive Licensing Act; FY 2020 Medicare and Medicaid proposals, including proposed International Pricing Index.",
    "H.R. 1781, Payment Commission Data Act; H.R. 1503, Orange Book Transparency Act of 2019; H.R. 1520, Purple Book Continuity Act of 2019; H.R. 965 and S. 340, the CREATES Act.",
    "Medical research, NIH funding, related appropriations issues.",
    "Issues related to the Orphan Drug Tax Credit; H.R. 2730/S. 1443, Credit for Caring Act of 2019.",
    "Rare disease patient care, screening, and coverage issues in authorization and appropriations legislation; Orphan Drug Act; HRes 242, Affirming importance of Orphan Drug Act; Newborn Screening legislation in general; Newborn Screening Saves Lives Reauthorization Act of 2019, H.R. 2507; Lower Health Care Costs Act, S. 1895.",
    "H.R. 1781, Payment Commission Data Act; H.R. 1503, Orange Book Transparency Act of 2019; H.R. 1520, Purple Book Continuity Act of 2019; H.R. 965 and S. 340, the CREATES Act; H.R. 2113, Prescription Drug STAR Act of 2019; H.R. 2069/S. 474, Stopping the Pharmaceutical Industry from Keeping Drugs Expensive (SPIKE) Act of 2019; H.R. 2296/S. 1391, FAIR Drug Pricing Act of 2019; S. 1895, Lower Health Care Costs Act of 2019; H.R. 2296, More Efficient Tools to Realize Information for Consumers (METRIC) Act of 2019."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 35,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 230000,
  "peakYear": 2025,
  "lobbyistCount": 14,
  "firmCount": 1,
  "issueCount": 6
}