{"id":206619,"name":"TRINET USA, INC.","slug":"trinet-usa-inc","state":"CA","description":"Provider of full-service human resources solutions to small- and medium-size businesses.","totalSpending":1470000,"filings":21,"yearlySpending":[{"year":2020,"income":150000},{"year":2021,"income":320000},{"year":2022,"income":320000},{"year":2023,"income":260000},{"year":2024,"income":180000},{"year":2025,"income":240000}],"firms":["INVARIANT LLC"],"lobbyists":["BENJAMIN KLEIN","ANNE PALISI","NICOLE VENABLE","JOEY SMITH","ANNABELL STOKES","CHRISTOPHER GILLOTT","AMY SWONGER","CAROLYN CODA","KATHRYN WISE","EVAN SMITH","STEPHEN WEYLER","HEATHER PODESTA","MATTHEW FERY"],"issues":["LBR","TAX",null],"sampleDescriptions":["Educate Members of Congress on the role professional employer organizations (PEO) play in delivering essential benefits.","Educate Members and the Administration on professional employee organizations (PEOs); advocate for PEOs to continue to provide human resource benefits to small- and medium-size business.","Educate Members of Congress to clarify compliance regarding research and development tax credits.","Educate Members of Congress on professional employee organizations (PEOs); advocate for PEOs to continue to provide human resource benefits to small- and medium-size businesses.","Educate Members of Congress on professional employee organizations (PEOs); advocate for PEOs to continue to provide human resource benefits to small - and medium-size businesses.","Educate Members of Congress on professional employee organizations (PEOs); advocate for PEOs to continue to provide human resource benefits to small- and medium-sized businesses.","Educate Members of Congress to clarify compliance regarding research and development tax credits. Discussed efforts to reduce the employee retention tax credit (ERTC) payroll processing backlog.","Educate Members of Congress to clarify compliance regarding research and development tax credits and about H.R. 3223, to amend the Internal Revenue Code of 1986 to establish procedures relating to the attribution of errors in the case of third party payors of payroll taxes, and for other purposes."],"years":[2020,2021,2022,2023,2024,2025]}