{"id":139734,"name":"TRUEBLUE INC","slug":"trueblue-inc","state":"WA","description":null,"totalSpending":1140000,"filings":25,"yearlySpending":[{"year":2018,"income":160000},{"year":2019,"income":160000},{"year":2020,"income":120000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":150000},{"year":2025,"income":200000}],"firms":["K&L GATES, LLP"],"lobbyists":["TIM PECKINPAUGH","AMY CARNEVALE","W STEPHENS","PAMELA GARVIE","MARY BAKER","KARISHMA PAGE","STEVEN VALENTINE","DENNIS POTTER","SLADE GORTON","WILLIAM KIRK","LAUREN FLYNN","BART GORDON","SCOTT NELSON","BRENDEN CHAINEY","RODERICK HALL","BRUCE HEIMAN","RYAN CARNEY","SCOTT GELBMAN"],"issues":["LBR","TAX","TEC","BAN"],"sampleDescriptions":["Executive agency and Congressional support for temporary blue collar labor.","H.R. 1, Tax Cut and Jobs Act, provisions related to opportunity tax credit work.","Yet to be introduced legislation to reform the Telephone Consumer Protection Act.","Yet to be introduced tax extenders legislation - provisions related to opportunity tax credit work.","Yet to be introduced tax extenders legislation - provisions related to work opportunity tax credit.","Yet to be introduced legislation to retain the Telephone Consumer Protection Act.","Temporary worker pay, benefits and training (no specific legislation).","S.978, Work Opportunity Tax Credit Jobs Act, entire bill.","S.978, Work Opportunity Tax Credit Jobs Act, entire bill.\nH.R. 1865, Division Q, Section 143 on Extension of Work Opportunity Tax Credit.","S.978, Work Opportunity Tax Credit Jobs Act, entire bill.\n(Yet to be introduced) Phase Four COVID-19 relief legislation.  Employee retention tax credit, loan assistance programs.","S. 978, Work Opportunity Tax Credit Jobs Act, entire bill.\nH.R. 6800, Phase Four COVID-19 relief legislation.  Employee retention tax credit, loan assistance programs.","S. 978, Work Opportunity Tax Credit Jobs Act, entire bill.\nH.R. 133, COVID-19 relief legislation and Consolidated Appropriations, 2021.  Employee retention tax credit, loan assistance programs.","Executive and congressional actions related to the use of temporary workers for blue collar and skilled positions.","H.R. 1319, American Rescue Plan of 2021, tax and unemployment insurance provisions.","Executive and congressional actions related to the use of temporary workers for blue collar and skilled positions.\nExecutive agency action on vaccine mandates and impact on federal contractors and temporary workers.","Executive and congressional actions related to the use of temporary workers for blue collar and skilled positions. Executive agency action on vaccine mandates and impact on federal contractors and temporary workers.","Yet to be introduced legislation on the worker opportunity tax credit.","Yet to be introduced legislation on the worker opportunity tax credit. Implementation of tax credits for solar installation projects.","H.R.1996, S.910 - SAFE Banking Act of 2021; Issues related to banking regulations as they pertain to monies deposited by legitimate cannabis-related businesses.","SAFE Banking Act on monies deposited by legitimate cannabis-related businesses."],"years":[2018,2019,2020,2021,2022,2024,2025]}