{"id":168010,"name":"TUNICA BILOXI TRIBE OF LOUISIANA","slug":"tunica-biloxi-tribe-of-louisiana","state":"LA","description":"Government Relations","totalSpending":1790000,"filings":27,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2023,"income":320000},{"year":2024,"income":250000},{"year":2025,"income":80000}],"firms":["CORNERSTONE GOVERNMENT AFFAIRS, INC."],"lobbyists":["ERIC TOBER","JOHN KEAST","JAMES RICHARDS","MICHAEL SMITH","CHARLES CARITHERS","DAVID PLANNING"],"issues":["IND","FIN","TAX","BUD","EDU",null,"DEF"],"sampleDescriptions":["Trust status of tribal lands; Tribal Labor Sovereignty (HR 986, S.63); Interior Appropriations (HR 3354)","Consumer lending regulation","Taxation of tribal government enterprises and programs; Tribal Tax and Investment Reform Act (HR 3138)","Contract support costs, FY 2018 Dept. of Interior Appropriations (HR 3354)","Support for Native language preservation and education grants, U.S. Department of Health and Human Services, Administration for Native Americans","Trust status of tribal lands; Tribal Labor Sovereignty (HR 986, S.63); Interior Appropriations (HR 6147, S. 3073)","FY 2019, Dept. of Interior Appropriations (HR 6147, S. 3073)","Trust status of tribal lands; Tribal Labor Sovereignty (HR 779, S.226); Interior Appropriations, Trust Land Legislation (HR. 375)","Taxation of tribal government enterprises and programs; Tribal Tax and Investment Reform Act","FY 2020, Dept. of Interior Appropriations","Trust status of tribal lands; Tribal Labor Sovereignty (HR 779, S.226); Interior Appropriations, Trust Land Legislation (HR. 375), pandemic relief programs and funding for tribal communities","FY 2021, Dept. of Interior Appropriations, pandemic relief programs and funding for tribal communities","Trust status of tribal lands, pandemic relief programs and funding for tribal communities","FY 2022, Dept. of Interior Appropriations, pandemic relief programs and funding for tribal communities","FY 2022, Dept. of Interior Appropriations, pandemic relief programs and funding for tribal communities, The Infrastructure Investment and Jobs Act (HR 3684)","Trust status of tribal lands, pandemic relief programs and funding for tribal communities, The Infrastructure Investment and Jobs Act (HR 3684)","Trust status of tribal lands, pandemic relief programs and funding for tribal communities, including implementation of the Infrastructure Investment and Jobs Act.","FY 2023, Dept. of Interior Appropriations, pandemic relief programs and funding for tribal communities, The Infrastructure Investment and Jobs Act (HR 3684)","Consumer lending regulation.","Automated recycling systems to support the national stockpile for critical minerals."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}