{"id":100847,"name":"U.S. CHAMBER OF COMMERCE INSTITUTE FOR LEGAL REFORM","slug":"u-s-chamber-of-commerce-institute-for-legal-reform","state":"DC","description":null,"totalSpending":3360000,"filings":28,"yearlySpending":[{"year":2018,"income":650000},{"year":2019,"income":700000},{"year":2020,"income":330000},{"year":2021,"income":480000},{"year":2022,"income":480000},{"year":2024,"income":480000},{"year":2025,"income":240000}],"firms":["AKIN GUMP STRAUSS HAUER & FELD"],"lobbyists":["GORDON BATES","SMITH DAVIS","ED PAGANO","JAMES TUCKER","GEOFF VERHOFF","VALERIE WHITE","BARNEY SKLADANY","HANS RICKHOFF","JEFF MCMILLEN","CASEY HIGGINS","LAUREN O'BRIEN","BRENDAN DUNN","RYAN THOMPSON","GALEN ROEHL","ROBERT HUFFMAN","SAM OLSWANGER","LAMAR SMITH","ANNA ABRAM","DAVID SCHWIETERT"],"issues":["CSP","TOR","LAW","TEC","TRA"],"sampleDescriptions":["Support arbitration as alternative means of dispute resolution; arbitration; third party litigation and class action reform.","Background on federal civil and criminal enforcement against business, and over criminalization of federal law (no specific legislation); general background on the False Claims Act; general background on legal reform; and H.R. 985, the Fairness in Class Action Litigation Act, Furthering Asbestos Claim Transparency Act; and other asbestos reform policy.","Background on federal civil and criminal enforcement against business, and over criminalization of federal law (no specific legislation); general background on the False Claims Act; general background on legal reform; and H.R. 985, the Fairness in Class Action Litigation Act, Furthering Asbestos Claim Transparency Act; S. 2564, Protect Asbestos Victims Act of 2018; S. 2815, Litigation Funding Transparency Act of 2018, and other asbestos reform policy.","Background on federal civil and criminal enforcement against business, and over criminalization of federal laws (no specific legislation); general background on the False Claims Act; general background on legal reform; S. 766, Protect Asbestos Victims Trust Fund Act of 2019, and other asbestos reform policy; S.471, Litigation Funding Transparency Act of 2019; class action reform.","All legislation relating to arbitration including but not limited to H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR) and related arbitration reform policy; campaign finance reform.","All legislation relating to arbitration including but not limited to H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR), arbitration amendments to NDAA legislation and related arbitration reform policy; campaign finance reform.","Background on federal civil and criminal enforcement against business, and over criminalization of federal laws (no specific legislation); general background on the False Claims Act; general background on legal reform; S. 766, Protect Asbestos Victims Trust Fund Act of 2019, and other asbestos reform policy; S. 471, Litigation Funding Transparency Act of 2019; class action reform.","Issues related to data privacy.","Background on federal civil and criminal enforcement against business, and over criminalization of federal laws (no specific legisaltion); general background on the False Claims Act; general background on legal reform; S. 766, Protect Asbestos Victims Trust Fund Act of 2019, and other asbestos reform policy; S. 471, Litigation Funding Transparency Act of 2019; class action reform.","All legislation relating to arbitration including but not limited to H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR), arbitration provisions of the National Defense Authorization Act (H.R. 2500/S. 1790) and related arbitration reform policy.","Policies regarding Department of Justice enforcement of the civil False Claims Act and related statutes and regulations.","Legislation relating to arbitration including but not limited to H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR), arbitration provisions of the National Defense Authorization Act (H.R. 2500/S. 1790) and related arbitration reform policy; potential arbitration, False Claims Act and private right of action issues in the  CARES Act (H.R. 748).","Legislation relating to arbitration including but not limited to H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR), Blumenthal arbitration amendment to the National Defense Authorization Act (S. 4049) and related arbitration reform policy","legislation re COVID liability claims, S.4317; the HEROES Act (H.R. 6800), Delivering Immediate Relief to America's Families, Schools and Small Businesses Act (S. 4775), and Health, Economic Assistance, Liability Protection and Schools (HEALS) Act","Legislation relating to arbitration including but not limited to H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR), Blumenthal arbitration amendment to the National Defense Authorization Act (S. 4049) and related arbitration reform policy.","Legislation re COVID liability claims (S.4317); the HEROES Act (H.R. 6800), Delivering Immediate Relief to America's Families, Schools and Small Businesses Act (S. 4775), and Health, Economic Assistance, Liability Protection and Schools (HEALS) Act.","Legislation relating to arbitration H.R. 1423/S. 610, The Forced Arbitration Injustice Repeal Act (FAIR), Blumenthal arbitration amendment to the National Defense Authorization Act (S. 4049); related arbitration reform policy; and the False Claims Act.","Legislation relating to arbitration provisions of the National Defense Authorization Act (H.R. 2500/S. 1790).","Legislation relating to arbitration (H.R. 1423/S. 610), including servicemember arbitration (H.R. 2196), arbitration provisions of the National Defense Authorization Act (H.R. 2500/S. 1790), and potential arbitration, False Claims Act and private right of action issues in the CARES Act (H.R. 748). Issues relating to third-party litigation funding and diverting legal settlements to nonparties.","Legislation relating to arbitration (H.R. 1423/S. 610), including servicemember arbitration (H.R. 2196), and arbitration provisions of the National Defense Authorization Act (H.R. 2500/S. 1790); Issues related to the False Claims Act (S. 2428, S. 2429, amendment 2435 to H.R. 3684 (Infrastructure Investment and Jobs Act))"],"years":[2018,2019,2020,2021,2022,2024,2025]}