{"id":163115,"name":"UBER TECHNOLOGIES, INC.","slug":"uber-technologies-inc","state":"CA","description":"Technology company connecting passengers and drivers using innovative mobile application.","totalSpending":1860000,"filings":31,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":180000},{"year":2023,"income":240000},{"year":2024,"income":240000},{"year":2025,"income":240000}],"firms":["CAPITOL TAX PARTNERS, LLP"],"lobbyists":["LAWRENCE WILLCOX","RICHARD GRAFMEYER","JONATHAN TALISMAN","PATRICK HECK","RANDOLPH HERNDON","ANNABELLE CANNING","SARAH SHIVE","KATHERINE MONGE","THOMAS WEST"],"issues":["TAX",null],"sampleDescriptions":["Federal tax issues which impact transportation costs, worker classification issues, H.R. 2241, Commuter Access Reform Act, H.R. 4165 & S. 1549 New GIG Act of 2017,  H.R. 1, Bill to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018 (bill formerly known as the Tax Cuts and Jobs Act), H.R. 1625, Consolidated Appropriations Act 2018, and H.R. 1892, Bipartisan Budget Act of 2018.","Federal tax issues which impact commuter transportation costs, worker classification issues, H.R. 2241, Commuter Access Reform Act, H.R. 4165 & S. 1549 New GIG Act of 2017,  H.R. 4, FAA Reauthorization Act, and S. 3097, A bill to direct the Secretary of the Treasury to report on tax compliance with respect to non-employer business income, and for other purposes.","Federal tax issues which impact commuter transportation costs, worker classification issues, H.R. 2241, Commuter Access Reform Act, H.R. 4165 & S. 1549 New GIG Act of 2017,  S. 3097, A bill to direct the Secretary of the Treasury to report on tax compliance with respect to non-employer business income, and for other purposes, H.R. 6756, American Innovation Act of 2018, H.R. 6757, Family Savings Act of 2018, and H.R. 6760, Protecting Family and Small Business Tax Cuts Act of 2018.","Federal tax issues which impact commuter transportation costs, worker classification issues, H.R. 2241, Commuter Access Reform Act, H.R. 4165 & S. 1549 New GIG Act of 2017,  S. 3097, and H.R. 88, Bill serving as the vehicle for the Retirement, Savings, and Other Tax Relief Act of 2018 and the Taxpayer First Act of 2018.","Federal tax issues which impact commuter transportation costs, worker classification issues, and infrastructure: H.R. 1625 & S. 700, New GIG Act of 2019, and H.R.1507, Bicycle Commuter Act of 2019.","Federal tax issues which impact commuter transportation costs, worker classification issues, and infrastructure: H.R. 1625 & S. 700, New GIG Act of 2019, digital service tax, and H.R. 3300, Economic Mobility Act of 2019.","Federal tax issues which impact commuter transportation costs, worker classification issues, and infrastructure: H.R. 1625 & S. 700, New GIG Act of 2019, digital service tax.","Federal tax issues which impact commuter transportation costs, worker classification issues, and infrastructure: H.R. 1625 & S. 700, New GIG Act of 2019.","Federal tax issues which impact commuter transportation costs, worker classification issues, and infrastructure, H.R. 748, Coronavirus Aid, Relief, and Economic Security (CARES) Act, S. 3548, the Coronavirus Aid, Relief, and Economic Security (CARES) Act (bill enacted as H.R. 748), H.R. 6201, Families First Coronavirus Response Act, and H. Res. 904, Directing the Clerk of the House of Representatives to make corrections in the engrossment of H.R. 6201.","Federal tax issues which impact commuter transportation costs, worker classification issues, and infrastructure, H.R. 2, Moving Forward Act, H.R. 7095, INVEST in America Act or Move Forward Act, S. 3773, Helping Gig Economy Workers Act of 2020, digital tax, and seeking relief for employees working remotely.","Federal tax issues which impact commuter transportation costs and worker classification issues. H.R. 8406, the HEROES Act, Amendment to S. 178, Health, Economic Assistance, Liability Protection, and Schools (HEALS) Act, H.R.4686 and S. 1871, Sami's Law, and additional coronavirus-relief legislation.","Federal tax issues which impact commuter transportation costs and worker classification issues. H.R. 133, Consolidated Appropriations Act, 2021 and S. 1871, Sami's Law.","Federal tax issues which impact commuter transportation costs and worker classification issues, and H.R. 1319, American Rescue Plan Act.","Federal tax issues which impact commuter transportation costs and, worker classification issues, H.R. 2954, Securing a Strong Retirement Act or SECURE 2.0, and H.R. 3425, Bill to amend the Internal Revenue Code of 1986 to reinstate the exception for de minimis payments by third party settlement organizations with respect to returns relating to payments made in settlement of payment card and third party network transactions, as in effect prior to the enactment of the American Rescue Plan Act.","Federal tax issues related to unemployment insurance, worker classification issues, corporate and international tax issues, and H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14.","Federal tax issues related to unemployment insurance, worker classification issues, corporate and international tax issues, and H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14, H.R. 1082, Samis Law.","Federal tax issues related to worker classification issues, third party settlement organization information reporting requirements, corporate and international tax issues, and H.R. 5376, Bill to provide for reconciliation pursuant to title II of S. Con. Res. 14.","Federal tax issues related to worker classification issues, corporate and international tax issues, H.R. 2617, Consolidated Appropriations Act, 2023. and H.R. 1082, Bill to prohibit the unauthorized sale of ride-hailing signage and study the incidence.","Federal tax issues related to worker classification issues, corporate and international tax issues.","Federal tax issues related to worker classification issues, corporate and international tax issues, S.4621 No Tax on Tips."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}