{"id":197804,"name":"ULTRA MARITIME LLC (FORMERLY REPORTED AS ULTRA ELECTRONICS DEFENSE INC)","slug":"ultra-maritime-llc-formerly-reported-as-ultra-electronics-defense-inc","state":"CT","description":"Global provider of aerospace, defense, and law enforcement hardware and software solutions","totalSpending":2280000,"filings":19,"yearlySpending":[{"year":2018,"income":600000},{"year":2019,"income":240000},{"year":2020,"income":480000},{"year":2021,"income":480000},{"year":2022,"income":480000}],"firms":["ULTRA MARITIME LLC (FORMERLY REPORTED AS ULTRA ELECTRONICS DEFENSE INC)"],"lobbyists":["GREGORY THOM"],"issues":["DEF","LAW"],"sampleDescriptions":["FY2019 National Defense Authorization Act:  Sonobuoy funding, Surface Ship Torpedo Defense policy and funding, Health Usage Monitoring System, Torpedo, Ship procurement\nFY2019 Defense Appropriations:  Sonobuoy funding, Surface Ship Torpedo Defense funding, torpedo, ship procurement\nFY2019 Senate National Defense Authorization Act: Sonobuoy funding, Surface Ship Torpedo Defense policy and funding, Health usage Monitoring System, torpedo and ship procurement\nFY2019 Senate Defense Appropriations:  Sonobuoy funding, Surface Ship Torpedo Defense funding\nFY2019 Commerce State Justice Appropriations:  National Integrated Ballistic Information Network (NIBIN)","FY2018 Commerce Justice State Appropriations Bill:  FY2018 funding for the NIBIN program.","FY2019 Commerce Justice State Appropriations Bill:  FY2018 funding for the NIBIN program.","National Defense Authorization Act for Fiscal Year 2019, no bill numbers (issues related to sonobuoys, surface ship torpedo defense, Next Generation Surface Search Radar, Health Usage Monitoring System, torpedoes, ship procurement); Department of Defense Appropriations Act, 2019, no bill numbers (issues related to sonobuoy funding, surface ship torpedo defense funding, torpedoes, ship procurement); Consolidated Appropriations Act, 2018, H.R. 1625 / no Senate bill number (issues related to sonobuoy funding, surface ship torpedo defense funding).","Commerce, Justice, Science, and Related Agencies Appropriations Act, 2019, no bill numbers (issues related to National Integrated Ballistic Information Network program); Consolidated Appropriations Act, 2018, H.R. 1625 / no Senate bill number (issues related to National Integrated Ballistic Information Network program).","John S. McCain National Defense Authorization Act for Fiscal Year 2019, H.R. 5515 / no Senate bill number (issues related to sonobuoys, surface ship torpedo defense, Health Usage Monitoring System, torpedoes, ship procurement); Department of Defense Appropriations Act, 2019, no bill numbers (issues related to sonobuoy funding, surface ship torpedo defense funding, torpedoes, ship procurement).","Commerce, Justice, Science, and Related Agencies Appropriations Act, 2019, H.R. 5952 / no Senate bill number (issues related to National Integrated Ballistic Information Network program).","John S. McCain National Defense Authorization Act for Fiscal Year 2019, H.R. 5515 / S. 2987 (issues related to sonobuoys, surface ship torpedo defense, Health Usage Monitoring System, torpedoes, ship procurement); Department of Defense Appropriations Act, 2019, H.R. 6157 / S. 3159 (issues related to sonobuoy funding, surface ship torpedo defense funding, torpedoes, ship procurement).","Commerce, Justice, Science, and Related Agencies Appropriations Act, 2019, H.R. 5952 / S. 3072 (issues related to National Integrated Ballistic Information Network program).","National Defense Authorization Act for Fiscal Year 2020, no bill numbers (issues related to sonobuoy funding, surface ship torpedo defense policy and funding, health usage monitoring system, torpedo and ship procurement); Department of Defense Appropriations Act, 2020, no bill numbers (issues related to sonobuoy funding, surface ship torpedo defense funding, torpedoes, ship procurement).","Consolidated Appropriations Act, 2019 (no bill number) (issues related to National Integrated Ballistic Information Network program).","FY2020 U.S. Navy Sonobuoys Funding\nFY2020 U.S. Navy Next Generation Surface Search Radar\nFY2020 U.S. Navy Mk-54 \nFY2020 U.S. Navy Deguassing \nFY2020 U.S. Army Signal Modernization\nFY2019 U.S. Army Health Usage Monitoring Systems\nFY2020 U.S. Navy Micro-IFF (ZPX)\nFY2020 U.S. Army Ruggedized Data Link Core\nFY2020 U.S. Department of State NGHMS","FY2020 DoJ NIBIN","National Defense Authorization Act for Fiscal Year 2020, no bill numbers (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of Defense Appropriations Act for Fiscal Year 2020, no bill numbers (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of State, Foreign Operations, and Related Programs Appropriations Act, 2020, no bill numbers (issues related to helicopter health monitoring).","Commerce, Justice, Science, and Related Agencies Appropriations Act for Fiscal Year 2020, no bill numbers (issues related to National Integrated Ballistic Information Network program).","National Defense Authorization Act for Fiscal Year 2020, no bill numbers (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of Defense Appropriations Act for Fiscal Year 2020 H.R. 2968/no Senate bill number(issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of State, Foreign Operations, and Related Programs Appropriations Act, 2020, H.R. 2839 /no Senate bill number (issues related to helicopter health monitoring).","Commerce, Justice, Science, and Related Agencies Appropriations Act for Fiscal Year 2020, H.R. 3055 / no Senate bill number (issues related to National Integrated Ballistic Information Network program).","National Defense Authorization Act for Fiscal Year 2020, no bill numbers (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of Defense Appropriations Act for Fiscal Year 2020 H.R. 2968/S. 2474 (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of State, Foreign Operations, and Related Programs Appropriations Act, 2020, H.R. 2839/S. 2583(issues related to helicopter health monitoring).","Commerce, Justice, Science, and Related Agencies Appropriations Act for Fiscal Year 2020, H.R. 3055 / S. 2584 (issues related to National Integrated Ballistic Information Network program).","National Defense Authorization Act for Fiscal Year 2020, no bill numbers (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Consolidated Appropriations Act, 2020, H.R. 1158 / no Senate bill number (issues related to sonobuoys funding, next generation surface search radar, Mk-54 torpedoes, degaussing, signal modernization, health usage monitoring system, Micro-IFF (ZPX), ruggedized data link core); Department of State, Foreign Operations, and Related Programs Appropriations Act, 2020, H.R. 1865/S. 2583 (issues related to helicopter health monitoring)."],"years":[2018,2019,2020,2021,2022]}