{"id":202093,"name":"UNITEDHEALTH GROUP","slug":"unitedhealth-group","state":"MN","description":"UHG enhances the performance of the health system and improves the health of those served.","totalSpending":2200000,"filings":29,"yearlySpending":[{"year":2018,"income":320000},{"year":2019,"income":320000},{"year":2020,"income":320000},{"year":2021,"income":320000},{"year":2022,"income":320000},{"year":2023,"income":320000},{"year":2024,"income":280000}],"firms":["SPLITOAK STRATEGIES LLC"],"lobbyists":["AMY JENSEN","SARAH EGGE","KRISTEN SHATYNSKI"],"issues":["MMM","TAX","HCR","FIN",null],"sampleDescriptions":["Medicare Advantage program improvements. Improvements to federal programs to allow for prevention of addition and improved management of opioid addition.","Repeal/delay of the health insurance tax.","Improving the performance of the health care system through better patient management and coordinated care.","Ensure appropriate financial holding requirements.","Medicare Advantage program improvements. Improvements to federal programs to allow for prevention of addiction and improved management of opioid addiction.","Medicare Advantage program improvements. Improvements to federal programs to allow for prevention of addiction and improved management of opioid addiction. Improvements in federal programs to provide better management and coordination of patient care.","Repeal/delay of the health insurance tax. S 3063, S 1859, HR 4831, HR 4894","HR 1398 and S 172, Health Insurance Tax Relief Act of 2019","Medicare Advantage program improvements. Improvements in federal programs to provide better management and coordination of patient care and outcomes.","Improving the performance of the health care system through better patient management and coordinated care, S 1895","HR 1398 and S 172, HR 3439, Health Insurance Tax Relief Act of 2019","Medicare Advantage program improvements. Improvements in federal programs to provide better management and coordination of patient care and outcomes. S 1895","Improving the performance of the health care system through better patient management and coordinated care, S 1895, health care oversight","Improving the performance of the health care system through better patient management and coordinated care, S 1895 and HR 3630, reform for out of network  bills, health care oversight","HR 1398 and S 172, HR 3439, HR 1865 Health Insurance Tax Relief Act of 2019","Improving the performance of the health care system through better patient management and coordinated care, S 1895, HR 5826, HR5800 and HR 3630, reform for out of network  bills, health care oversight","Medicare Advantage program improvements and flexibilities. Improvements in federal programs to provide better management and coordination of patient care and outcomes, COVID 19, administration action on reducing health care costs","Improving the performance of the health care system through better patient management and coordinated care, reform for out of network  bills, administration action to reduce health care costs, COVID 19","Improving the performance of the health care system through better patient management and coordinated care, reform for out of network  bills, administration action to reduce health care costs, COVID 19 testing, CARES Act implementation, HEROES Act, HEALS Act","Medicare Advantage program improvements and flexibilities. Improvements in federal programs to provide better management and coordination of patient care and outcomes, COVID 19 health care policies, administration action on reducing health care costs"],"years":[2018,2019,2020,2021,2022,2023,2024]}