{
  "id": 118720,
  "name": "UNITED SPINAL ASSOCIATION",
  "slug": "united-spinal-association",
  "state": "NY",
  "description": null,
  "totalSpending": 2285000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 300000
    },
    {
      "year": 2019,
      "income": 300000
    },
    {
      "year": 2020,
      "income": 320000
    },
    {
      "year": 2021,
      "income": 325000
    },
    {
      "year": 2022,
      "income": 235000
    },
    {
      "year": 2023,
      "income": 325000
    },
    {
      "year": 2024,
      "income": 405000
    },
    {
      "year": 2025,
      "income": 75000
    }
  ],
  "firms": [
    "UNITED SPINAL ASSOCIATION"
  ],
  "lobbyists": [
    "ALEXANDRA BENNEWITH",
    "TIMOTHY KEYSER",
    "JASEY CARDENAS",
    "BETHANY KEIRANS",
    "DANIELLE APPLEGATE",
    "STEPHEN LIEBERMAN",
    "KENNETH GREENBERG",
    "REBECCA MACTAGGART",
    "ELIZABETH OSBORN"
  ],
  "issues": [
    "MMM",
    "HCR",
    "CIV",
    "TRA",
    "VET",
    "HOU",
    "BUD",
    "INS",
    "AVI",
    "EDU",
    "LBR",
    "FIN",
    "AGR",
    "AUT",
    "PHA",
    "TEC",
    "RRR",
    "CON",
    "TAX",
    "DIS",
    "DOC",
    "IMM",
    "SCI",
    "COM",
    "DEF",
    "HOM",
    "ENV",
    "CPI",
    "ROD",
    "POS",
    "GOV",
    null,
    "ECN",
    "MED",
    "TRD"
  ],
  "sampleDescriptions": [
    "United Spinal, along with numerous other disability organizations, signed on to a Consortium for Citizens with Disabilities (CCD) and a separate CCD letter to Congressional House and Senate leadership in support of H.R. 3730 to protect access to essential components of complex rehabilitation manual wheelchairs known as accessories for people with significant disabilities prior to the Federal governments funding agreements in January.  Complex Rehabilitation Technology (CRT) are medically necessary, individually configured products such as manual and power wheelchairs, adaptive seating systems and alternative positioning systems that keep people with significant disabilities such as Amyotrophic Lateral Sclerosis (ALS), spinal cord injury, multiple sclerosis (MS) and muscular dystrophy healthy and independent.\n\nUnited Spinal was actively engaged with Congress, as part of the Therapy Cap Coalition, (and signed onto several letters) in opposing any limits to therapy visits for speech-language, occupational or physical therapy.\n\nUnited Spinal signed onto a letter to the Centers for Medicare and Medicaid Services regarding the importance of balancing the goals of health plan flexibility with ensuring beneficiary protections. \n\nDepartment of Health and Human Services - Centers for Medicare and Medicaid Services (CMS) - Winter Outreach Call\nUnited Spinal attended a stakeholder meeting with CMS and a group of disability advocacy organizations who were invited by CMS and the Administration for Community Living (ACL) to participate in a Winter Outreach call to discuss competitive bidding complaints, the announcement of additional ombudsman positions and related updates, the issuance of new Medicare cards and other beneficiary issues.\n\nUnited Spinal signed onto a letter to CMS, facilitated by the American Urology Association, to eliminate the administrative barriers to patient access to medically necessary services that are imposed by Medicare Advantage plans increasing prior authorization requirements.\n\nUnited Spinal, as a member of the ITEM Coalition Steering Committee, signed on to and sent an ITEM letter to Congress in support of protecting CRT legislation and other device legislation to be included in Congress continual funding as they work to finalize FY 2018 budgets which have not yet been finalized from the supposed end of the fiscal year of September 30, 2017.\n\nUnited Spinal sent a letter to the Centers for Medicare and Medicaid Services (CMS) in support of an application for a unique Healthcare Common Procedure Coding System (HCPCS) code for the MyoPro device, created by the medical technology company, Myomo. The MyoPro, is a custom fabricated arm brace, the only one of its kind, that uses safe, noninvasive myoelectric technology to enable individuals living with spinal cord injuries and other neurological conditions to retain functional mobility in their arms.\n\nUnited Spinal signed on to an American Academy of Physical Medicine and Rehabilitation (AAPM&R) letter, to Congress, along with numerous rehabilitation and disability in strongly supporting H.R. 626, the Access to Inpatient Rehabilitation Therapy Act of 2017.\n\nUnited Spinal, along with numerous other disability organizations, signed on to a Consortium for Citizens with Disabilities (CCD) letter opposing taking health care/Medicaid away from people who are unemployed.  The letter expressed CCDs strong opposition to the Centers for Medicare and Medicaid Services (CMS) January 11, 2017 guidance authorizing states to implement unprecedented work requirements for the Medicaid program, and its subsequent approval of Kentuckys waiver application seeking to implement work requirements. \n\nITEM Coalition Steering Committee\nAs a member of the Steering Committee, United Spinal continues to advocate to protect access to medical devices and assistive technologies, in this changing healthcare landscape, through letters to both Congress and the Administration as well as meetings and conference calls. \nOn a related issue, United Spinal sent in joint comments to the Medicare Payment Advisory Commission (MedPAC) opposing any expansion of Medicares competitive bidding program on urology and ostomy supplies which restricts consumer access to medically necessary products and supplies.  \n \nCoalition to Preserve Rehabilitation Steering Committee\nAs a member of the Steering Committee, United Spinal continues to advocate for improved rehabilitation benefits for the disability community, in this changing healthcare landscape, through letters to both Congress and the Administration as well as meetings and conference calls; such as sending an opposition comment letter to the Department of Labor regarding Employer-Sponsored Association Health plans which can provide less comprehensive coverage and higher out-of-pocket costs.  We believe that insurance coverage, whether through an employer, a plan purchased on the exchange, or an association health plan (AHP), must ensure access to timely, affordable, high-quality health care that meets the needs of individuals with disabilities.",
    "The National Institutes of Health (NIH) All of Us Community Forum Ideascale is soliciting ideas from the research and stakeholders communities to help guide NIH research goals and priorities.  \n United Spinal policy submitted the following:  Idea #384: Why is there so very little research on the physical benefits of adaptive fitness on physiological functioning & health outcomes.",
    "Continued lobby efforts on HR 620 The ADA Education and Reform Act meetings to oppose this legislation. Met with Congressional staff in the House and Senate to voice our concerns with the bill.  \n\nShared United Spinal letter of opposition on H.R. 620 the ADA Education and Reform Act via email to all House staff voicing our concerns with this legislation.  \n\nUnited Spinal participated in NCD quarterly meeting to discuss potential new policy initiatives from autonomous vehicles to transitioning away from subminimum wage and 14(c) certificates.\n\nAttended, along with several other disability organizations, a meeting with Sen. Feinstein and Sen. Flake judiciary staffers to discuss our concerns with and opposition to H.R. 620 the ADA Education and Reform Act which was passed out of the House. \n\nH.R. 620, ADA Education and Reform Act:\nVetsFirst, a program of United Spinal Association, submitted a letter of opposition regarding this legislation. H.R. 620 restricts disabled patrons rights to accessible and accommodative facilities and services required by law through the Americans with Disabilities Act (ADA) by allowing businesses to delay meeting their obligations to make necessary changes to noncompliant facilities and services.\n\nUnited Spinal, along with numerous other disability organizations, signed on to a Consortium for Citizens with Disabilities (CCD) and the Collaboration to Promote Self Determination (CPSD) letter to express concern about the Justice Departments recent withdrawal of a number of guidance and technical assistance documents concerning the Americans with Disabilities Act (ADA). \n\nUnited Spinal met with Congressional staff in Rep. Langevin's office and Sen. Tammy Baldwin's office to thank them for their leadership on their bills, S, 1318 and HR 5004 and to discuss advocacy strategy together.",
    "United Spinal submitted various comments to the DOT including a response to a March 1, 2018, U.S. DOT hosted Public Listening Summit on Automated Vehicle Policy Stakeholders with senior leadership from USDOT, state and local partners, industry, academia, and safety advocates at USDOT Headquarters.  The event focused on key cross-modal issues that are important to the successful integration of automated vehicles into our nations surface transportation system. United Spinal policy staff submitted comments around the concept of universal design for the research, development and ultimate deployment of accessible autonomous vehicles (AV) tp DPT and various DOT sub-agencies including NHTSA, FHWA,and FTA.",
    "S. 2193, Caring for our Veterans Act:\nVetsFirst, a program of United Spinal Association, supports this bill which would establish a Community Care Program under the Department of Veterans Affairs to allow for timely and quality access to medical care for veterans across the nation. It would also provide clear access guidelines and quality care standards, as well as offer education programs for veterans and medical staff members regarding the program. \nS. 2184, Veterans Community Care and Access Act:\nThis bill would allow for adequate appropriations for VA Choice. VetsFirst supports Title I of this legislation as an amendment to S. 2193.",
    "Signed onto a Consortium for Citizens with Disabilities letter that was sent to HUD Sec. Carson that seeks to stop HUD from removing anti-discrimination language in its mission statement.",
    "United Spinal Policy staff continue to advocate for full funding for the Assistive Technology Act.  The Assistive Technology Act helps ensure services to people with disabilities that helps them access and acquire assistive technology.  \n\nUnited Spinal Policy staff continue to support continued federal funding for the Paralysis Resource Center (PRC).  In his proposed budgets for FY 2018 and FY 2019, President Trump zeroed out funding for the PRC. \n\nOppose reduced appropriations for National Institute on Disability, Independent Living and Rehabilitation Research ( NIDILRR) the Agency for Healthcare Research and Quality (AHRQ) and the National Institute for Occupational Safety And Health (NIOSH).",
    "United Spinal, along with several other disability organizations, signed on to a letter from the Consortium for Citizens with Disabilities Social Security Task Force (SSTF) and the Employment &Training Task Force (E&TTF) responding to the request for information regarding strategies to improve adult outcomes for youth receiving supplemental security income, 83 Fed. Reg. 411, published on January 3, 2018 [Docket No. SSA-2017-0049].\n\nThe letter stressed the basic point that the Task Forces were pleased that Social Security Administration (SSA) is interested in improving the outcomes for youth who receive SSI in adulthood, but that it is the position of the SSTF and the E&TTF that SSA does not and should not have responsibility for outcomes for SSI youth. Poor children rely on a number of systems that have a responsibility to ensure that children with disabilities are prepared to achieve good economic outcomes when they transition from school. The Department of Education and, to a lesser but very important extent the Department of Health and Human Services (HHS) through the provision of Early and Periodic Screening, Diagnostic and Treatment (EPSTD) services, are and should remain primarily responsible for identifying the needs of childhood SSI beneficiaries as they transition to adulthood and ensuring that SSI beneficiaries leave secondary education prepared for employment and/or post-secondary education. The Department of Labor should assist through youth training programs and apprenticeship opportunities.\n\nUnited Spinal Policy staff continue to monitor the implementation of the Compassionate and Responsive Service (CARES) plan to reduce the current wait time for a Social Security Disability claim hearing decision.",
    "Signed onto letter, led by the CCD Transportation Task Force, to Senator Tammy Baldwin, in support of the Air Carrier Access Amendments Act of 2017, her bill, S.1318. \n\nCongressional staff with U.S. Representative Jim Langevin's (D-RI-02) office discussed air travel for people with disabilities and related policy issues with United Spinal and other disability stakeholders. \n\nUnited Spinal, along with numerous disability organizations, signed on to an Air Carrier Access Act (ACAA) working group letter to the U.S. Department of Transportation expressing concern with the revised service animal policies announced by Delta Air Lines  \nand United Airlines (United) in January.  \nThe letter read in part: We believe that these policies, which are slated to go into effect on March 1, are inconsistent with the Department of Transportations regulations implementing the Air Carrier Access Act (ACAA) (14 C.F.R  382) and the Departments Guidance Concerning Service Animals in Air Transportation, [68 Fed. Reg. 24,874 (May 9, 2003)]. Consequently, the Department must deem these revised policies to be in violation of the ACAA and advise Delta and United accordingly.\n\n\n\nUnited Spinal, along with numerous other disability organizations, signed on to a Consortium for Citizens with Disabilities (CCD) letter to U.S. Senator Tammy Baldwin in support of the Air Carriers Access Amendments Act of 2017 (ACAAA).  Although the Air Carriers Access Act of 1986 (ACAA) prohibited discrimination based on disability in air travel and despite the ACAA has led to improved access for passengers with disabilities, significant disability-related problems persist in air travel. Travelers with disabilities still encounter damaged equipment, delayed assistance, lack of seating accommodations, and other challenges when traveling by air. Airlines reported receiving more than 30,000 passenger filed disability-related complaints in 2016.   \n\nUnited Spinal, along with numerous other disability organizations, signed on to a Consortium for Citizens with Disabilities (CCD) letter to U.S. Senator Tammy Baldwin in support of the Air Carriers Access Amendments Act of 2017 (ACAAA).  Although the Air Carriers Access Act of 1986 (ACAA) prohibited discrimination based on disability in air travel and despite the ACAA has led to improved access for passengers with disabilities, significant disability-related problems persist in air travel. Travelers with disabilities still encounter damaged equipment, delayed assistance, lack of seating accommodations, and other challenges when traveling by air. Airlines reported receiving more than 30,000 passenger filed disability-related complaints in 2016.",
    "H.R. 4508, Promoting Real Opportunity, Success, and Prosperity Through Education Reform Act (PROSPER):\nVetsFirst, a program of United Spinal Association,signed onto a Student Veterans of America opposition letter regarding this legislation. HR 4508 would enable proprietary institutions to use deceptive recruitment practices that emphasize enrollment numbers rather than positive student outcomes. In addition, the bill proposes eliminating the 90/10 rule-a requirement that proprietary schools receive no more than 90 percent of its revenue from the federal government.\n\nUnited Spinal wrote a letter to the Department of Education (DOE) regarding Section 5005 of the Every Student Succeeds Act (ESSA). Rural school districts can be isolated and as such may not have access to the services/resources provided by urban educational organizations and disability entities. These resource restrictions can include the lack of services provided by full-time nurses, school psychologists, counselors and social workers who are most knowledgeable regarding identifying complex neurological conditions. The result is an inability to provide free and appropriate public education (FAPE). \n\nUnited Spinal Association and other members of the Consortium for Citizens with Disabilities (CCD) Civil Rights, Education, and Technology & Telecommunications Task Forces wrote to Congress in reference to Section 735 of the Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, H.R. 4508. Section 735 encourages institutions of higher education to design and use accessible instructional materials.  We support the provisions of Section 735 of PROSPER Act and the Senate companion bill that would authorize the creation of a commission to develop voluntary accessibility guidelines for electronic instructional materials and related technologies used in postsecondary education. Our serious concern is with the inclusion of a safe harbor provision.",
    "Attended a stakeholder engagement meeting with the Director and staff of OFCCP at the Department of Labor.  The Director wanted to engage and bounce ideas off organizations to discuss Section 501; how to best incentivize employers from hiring minority and disabled employees who are eager to work and look at apprenticeship opportunities.",
    "Support S. 817 the ABLE Age Adjustment Act.",
    "Continued lobby efforts on HR 620 The ADA Education and Reform Act meetings to oppose this legislation. \n\nUnited Spinal continues to advocate for the Disability Integration Act (S. 910, H.R. 2472). The legislation builds on the Americans with Disabilities Act and the Supreme Courts Olmstead decision, and asserts that people with disabilities have a right to live in their own homes and communities and to receive the services and supports they need to do so.\n\nUnited Spinal signed onto a letter of support for the Disability Integration Act (S. 910, H.R. 2472)along with numerous other disability organizations as members of the Consortium for Citizens (CCD), signed onto a letter to congressional leaders, Majority Leader McConnell and Minority Leader Schumer, Speaker Ryan and Leader Pelosi reiterating support of the Disability Integration Act (S. 910, H.R. 2472).  This legislation, if passed, would ensure the rights of people with disabilities to live full and independent lives in their communities.\n\nWorking with the Department of Labor in Twitter chats in promoting accessible transportation for people with disabilities.\n\nUnited Spinal and other stakeholder groups met with Sen. Caseys office to discuss employment challenges and opportunities for people with disabilities.",
    "CCD letter opposing SNAP provisions in H.R. 2, the Agriculture and Nutrition Act of 2018 (Farm Bill)\nUnited Spinal, along with numerous other disability organizations, as members of the Consortium for Citizens with Disabilities (CCD) signed onto a letter to Congressional leaders, Speaker Ryan and Leader Pelosi, urging them to continue the longstanding bipartisan commitment to protect and strengthen the Supplemental Nutrition Assistance Program (SNAP) by rejecting proposals to restrict eligibility, reduce benefits, cap or reduce funding, or make harmful structural changes to SNAP in the Farm Bill.",
    "Sent a letter to telehealth caucus chairs urging the passage of H.R. 5603 the Access to Telehealth Services for Opioid Use Disorders Act.  The provisions in this bill would help to address the needs of Medicare beneficiaries in need of opioid treatment by expanding access to care using evidence-based telehealth.",
    "S. 2372, VA MISSION Act:\nAdvocated on and submitted letter of support to Senate Veterans Affairs Committee Chairman Johnny Isakson regarding this legislation.  S. 2372 would combine multiple existing programs to establish a permanent Community Care Program under the Department of Veterans Affair. This program is designed to allow for timely and quality access to medical care for veterans across the nation. It would also provide clear access guidelines and quality care standards, as well as offer education programs for veterans and medical staff members regarding the program. \n\nH.R. 4146, Disabled Veterans Life Insurance Act\nAdvocated on and submitted a letter of support to Representative Steve Pearce (R-NM) regarding this legislation. H.R. 4146 will provide congressional mandates to update mortality and annuity tables used by the VA to calculate insurance payouts for disabled veterans life insurance policies. This bill will also extend the application period from two (2) years to ten (10) years in order for all qualifying veterans to be afforded the opportunity to apply. Updating this program will allow disabled veterans to receive affordable and equitable life insurance policies that they may otherwise not qualify for in the civilian sector. \n\nH.R. 5536, Disabled Access Credit Expansion Act:\nSubmitted a letter of support regarding this legislation. H.R. 5536 offers incentives for small businesses to comply with landmark ADA requirements resulting in expanded access and job opportunities for disabled veterans. \n\nSupport of S. 2193 - Caring for our Veterans Act.",
    "Supports H.R. 750 The Ensuring Access to Quality Complex Rehabilitation Technology (CRT) Act.\n\nSupports S. 486 Protecting Beneficiary Access to Complex Rehab Technology Act of 2017 \n\nSupports H.R. 3730 (To amend title XVIII of the Social Security Act to provide for the non-application of Medicare competitive acquisition rates to complex rehabilitative manual wheelchairs and accessories) was introduced by Representatives Lee Zeldin (R-NY) and John Larson (D-CT) to stop CMS from using Competitive Bid pricing for accessories used with CRT manual wheelchairs. \n\nSupports H.R. 626, the Access to Inpatient Rehabilitation Therapy Act of 2017,  which would amend the Social Security Act to include recreational therapy among the therapy methods that can be considered part of an intensive rehabilitation therapy program in an inpatient rehabilitation hospital or unit.\n \nMyomos MyoPro support letter to CMS \nPolicy staff, as members of United Spinal Association, wrote the Centers for Medicare and Medicaid Services (CMS) in strong support of an application to CMS for a unique Healthcare Common Procedure Coding System (HCPCS) code for the MyoPro device, created by the medical technology company, Myomo.\n\nSupport of S. 2227/H.R.5306 Empower Care Act which reinstates the Money Follows the Person program and facilitates smooth transitions out of nursing facilities and into the community. \n\nSigned onto letters to Congress in support of including functional quality measures in rehabilitation metrics.\n\n\nUnited Spinal supports this letter but CCD Task Force co-chairs: The co-chairs of the Consortium for Citizens with Disabilities (CCD) Health, Long-Term Services and Supports, and Rights Task Forces write in opposition to proposals that expand coverage of institutional services in Medicaid without addressing gaps in Medicaid community services. CCD is the largest coalition of national organizations working together to advocate for Federal public policy that ensures the self-determination, independence, empowerment, integration and inclusion of children and adults with disabilities in all aspects of society.",
    "Urged Congress to fully fund affordable housing and community development programs at HUD.  Congress has been providing more funding to many programs at HUD, but we are joining this letter to ensure that Congress does not leave out affordable housing and community development programs as these are essential programs especially for those with disabilities.",
    "As a member of the Disability Rehabilitation Research Coalition (DRRC), United Spinal helped draft and signed onto a letter the DRRC sent to the House and Senate bipartisan appropriations subcommittees leadership recommending that the FY 2019 Labor, HHS, Education, and Related Agencies appropriations bill provide necessary and sufficient funding for the various federal agencies supporting and conducting disability, independent living, and rehabilitation research to address the current and future needs for individuals with disabilities and society. \n\nSigned on to a letter to Congress to express our strong opposition to the Administrations proposal in its FY 2019 Budget to transfer the National Institute on Disability, Independent Living, and Rehabilitation Research (NIDILRR) to the National Institutes of Health (NIH). \n\nUnited Spinal signed onto a Congressional letter, facilitated by the National Respite Coalition, in support of Fiscal Year 2019 Labor/HHS/Education Appropriations bill for respite and family caregiver support that provide a safety net for family caregivers across the lifespan supporting $5 million for the Lifespan Respite Care Program and at least level funding (though pushing for a 12% increase) for the National Family Caregiver Support Program.",
    "As a member of the Consortium for Citizens with Disabilities Social Security Task Force, United Spinal Policy Staff assisted in drafting comments to be submitted via www.regulations.gov on the Notice of Proposed Rulemaking on Revised Medical Criteria for Evaluating Musculoskeletal Impairments, 83 Fed. Reg. 20646 (May 7, 2018), Docket No. SSA-2006-0112.\n\nCCDs Social Security Task Force supports strengthening the accuracy and timeliness of disability determinations. \\"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": -75,
  "trajectory": "declining",
  "yearsActive": 8,
  "avgAnnualSpending": 285625,
  "peakYear": 2024,
  "lobbyistCount": 9,
  "firmCount": 1,
  "issueCount": 34
}