{
  "id": 128875,
  "name": "UNITED LAUNCH ALLIANCE",
  "slug": "united-launch-alliance",
  "state": "CO",
  "description": "Space launch services",
  "totalSpending": 1410000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 160000
    },
    {
      "year": 2019,
      "income": 100000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 200000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "THEODORE KRONMILLER"
  ],
  "lobbyists": [
    "THEODORE KRONMILLER"
  ],
  "issues": [
    "AER",
    null
  ],
  "sampleDescriptions": [
    "Space launch-related legislation, regulations, policies, other space launch-related administrative and legislative matters; Omnibus Appropriations Act, Fiscal Year 2018.",
    "Space launch-related legislation, regulations, policies, other space launch-related administrative and legislative matters; Omnibus Appropriations Act, Fiscal Year 2018. H.R. 5503, National Aeronautics and Space Administration Act of 2018; H.R. 5515. John S. McCain National Defense Authorization Act; H.R. 6157 and S.3159 Department of Defense Appropriations Act for Fiscal Year 2019;  S.3072 and H.R. 5952 Department of Commerce and Justice, Science and Related Agencies Appropriations Act for Fiscal Year 2019",
    "Space launch-related legislation, regulations, policies, other space launch-related administrative and legislative matters; H.R. 5503, National Aeronautics and Space Administration Act of 2018; H.R. 5515. John S. McCain National Defense Authorization Act; H.R. 6157 and S.3159, Department of Defense Appropriations Act for Fiscal Year 2019; H.R. 3219 Make America Secure Appropriations Act, 2018; S.3072 and H.R. 5952 Department of Commerce and Justice, Science and Related Agencies Appropriations Act for Fiscal Year 2019",
    "Space launch-related legislation, regulations, policies, other space launch-related administrative and legislative matters; H.R. 5503, National Aeronautics and Space Administration Act of 2018; H.R. 6157 and S.3159, Department of Defense Appropriations Act for Fiscal Year 2019; H.R. 3219 Make America Secure Appropriations Act, 2018; S.3072 and H.R. 5952 Department of Commerce and Justice, Science and Related Agencies Appropriations Act for Fiscal Year 2019",
    "National Defense Authorization Act for FY 2020, S. 1790, H.R. 2500; Space Frontier Act. S. 919; NASA Authorization Act (bill numbers pending); launch services for the United States Government.",
    "Consolidated Appropriations Act, 2020, H.R. 1158; H.R. Further Consolidated Appropriations Act, 2020, H.R. 1865 National Defense Authorization Act for FY 2020, S. 1790, H.R. 2500; Space Frontier Act. S. 919; NASA Authorization Act (bill number pending);  launch services for the United States Government and other entities.",
    "H.R. 6395 National Defense Authorization Act for Fiscal Year 2021; H.R. 5666, NASA Authorization Act;   launch services for the United States Government and other entities.",
    "H.R. 6395 and S. 4049 National Defense Authorization Act for Fiscal Year 2021; H.R. 5666, NASA Authorization Act; H.R. 7667 Commerce, Justice, Science Appropriations for Fiscal Year 2021; Senate Commerce, Justice, Science Appropriations for Fiscal Year 2021 (no bill number, yet); H.R. 7617 Defense Appropriations for Fiscal Year 2021; Senate Defense Appropriations for Fiscal Year 2021 (no bill number, yet); launch services for the United States Government and other entities.",
    "H.R. 6395 and S. 4049 National Defense Authorization Act for Fiscal Year 2021; H.R. 5666 and S. 2800, NASA Authorization Act; H.R. 7667 Commerce, Justice, Science Appropriations for Fiscal Year 2021; Senate Commerce, Justice, Science Appropriations for Fiscal Year 2021 (no bill number, yet); H.R. 7617 Defense Appropriations for Fiscal Year 2021; Senate Defense Appropriations for Fiscal Year 2021 included with other appropriations in H.R. 133, Consolidated Appropriations Act, 2021; launch services for the United States Government and other entities.",
    "Launch services for the United States Government and other entities, including export and import and issues related to RD-180 engines. H.R. 4350, no Senate bill number, Fiscal Year 2022 National Defense Authorization Act; Fiscal Year 2022 appropriations for defense and NASA (no bill numbers, at this time); S. 1260, United States Innovation and Competition Act of 2021 (including NASA authorization).",
    "Launch services for the United States Government and other entities. H.R. 4350, S.2792, Fiscal Year 2022 National Defense Authorization Act; H.R. 4432, H.R. 4405, Fiscal Year 2022 appropriations for defense and NASA, respectively (Senate bill numbers pending).",
    "Launch services for the United States Government and other entities. H.R. 4350, S.1605, Fiscal Year 2022 National Defense Authorization Act; H.R. 4432, H.R. 4405, Fiscal Year 2022 appropriations for defense and NASA (Commerce, Justice, Science, and Related Agencies), respectively. S.3023, S.3042, \nFiscal Year 2022 appropriations for defense and NASA (Commerce, Justice, Science, and Related Agencies), respectively.",
    "Launch services for the United States Government and other entities. H.R. 7900, National Defense Authorization Act for Fiscal Year 2023 and related Senate bill (number pending).",
    "Launch services for the United States Government and other entities. H.R. 7900, S.2792 National Defense Authorization Act for Fiscal Year 2023; S. 4814, ORBITS Act of 2022.",
    "Launch services for the United States Government and other entities. H.R. 7900, S.2792 National Defense Authorization Act for Fiscal Year 2023; H.R. 2617, Consolidated Appropriations Act, Fiscal Year 2023.",
    "Launch services for the United States Government and other entities; Transportation, Housing, and Urban Development, and Related Agencies Appropriations (proposed FAA/AST funding increase) (bill numbers pending).",
    "Launch services for the United States Government and other entities; Transportation, Housing, and Urban Development, and Related Agencies Appropriations, S.2437, H.R.4820 (proposed FAA/AST funding increase)",
    "Launch services for the United States Government and other entities; National Defense Authorization Act for 2025, S.4638.",
    "Launch services for the United States Government and other entities; National Defense Authorization Act for 2025, H.R. 5009.",
    "Launch services for the United States Government and other entities. National Defense Authorizaiion Act for FY 2026. No bill numbers."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 25,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 176250,
  "peakYear": 2020,
  "lobbyistCount": 1,
  "firmCount": 1,
  "issueCount": 1
}