{"id":129671,"name":"UNIVERSITY OF ILLINOIS","slug":"university-of-illinois","state":"IL","description":"Public University","totalSpending":2450000,"filings":32,"yearlySpending":[{"year":2018,"income":170000},{"year":2019,"income":220000},{"year":2020,"income":380000},{"year":2021,"income":320000},{"year":2022,"income":240000},{"year":2023,"income":400000},{"year":2024,"income":360000},{"year":2025,"income":360000}],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"lobbyists":["APRIL BURKE","MICHAEL LEDFORD","NAOMI WEBBER","JULIE JOLLY ROSE","ERIN CADWALADER","LAUREN BROCCOLI","PAULA TRIMBLE","WILLIAM KATT","NICK SAAB","KARI MCCARRON","JASON GALLAGHER","LELAND COGLIANI","BEETA RASOULI","EVE GRANATOSKY","REBECCA ADLER MISERENDINO","SRINIVAS SONTI","WILLIAM RUCH","CHRISTOPHER DUFOUR","CHRISTINA LARIDAEN","REYNOLDS SKAGGS","MIRIAM QUINTAL","ANDREW HERRIN","SIERRA CATO","SHARON ESHELMAN","JACKSON CLARK","AMBER CASSADY","GRIFFIN REINECKE","SUSANNAH HOWIESON"],"issues":["IMM","AGR","TRA","MMM","BUD","SCI","DEF","HCR","EDU","HOM","LAW","TAX",null,"NAT"],"sampleDescriptions":["Issues pertaining to H-1B visas, high-skilled immigration, immigration executive orders, and the Deferred Action for Childhood Arrivals (DACA) program.","Reauthorization of Farm Bill (2018), Issues pertaining to the research, conservation, nutrition, and rural development titles for the upcoming reauthorization of the 2014 farm bill.","S. 1885, AV START Act, Issues pertaining to Federal Railroad Administration and Federal Transit Administration research and development funding.","Issues pertaining to Graduate Medical Education.\nIssues pertaining to Disproportionate Share (DSH) Hospital Payments and the delay to Medicaid DSH cuts.\nIssues pertaining to protecting Medicaid.\nIssues pertaining to hospital off-campus outpatient departments.","H.R. 3358, S. 1771, FY 2018 Labor/HHS/Education Appropriations, Issues pertaining to funding for NIH, AHRQ, Title VII and VIII health professions, education research, federal student aid, and full support for facilities and administrative (F&A) costs.\nH.R. 3266, S. 1609, FY 2018 Energy/Water Appropriations, Issues pertaining to research, development, and education at DOE and funding for Fossil Energy.\nH.R. 3267, S. 1662, FY 2018 Commerce/Justice/Science Appropriations, Issues pertaining to NSF, NOAA, NIST, NASA, and EDA.\nH.R. 695, FY 2018 Defense Appropriations, Issues pertaining research and development at the Department of Defense including the Army Research Laboratory Open Campus initiative.\nH.R. 3355, FY 2018 Homeland Security Appropriations, Issues pertaining to University Centers of Excellence.\nH.R. 3354, FY 2018 Interior, Environment and Related Agencies Appropriations, Issues pertaining to NEA, NEH, USGS, and the Water Resources Research Institutes.\nH.R. 3268, S. 1603, FY 2018 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs.\nH.R. 3353, S. 1655, FY 2018 Transportation, Housing and Urban Development, and Related Agencies Appropriations, Issues pertaining to research funding for the Department of Transportation. \nP.L. 115-141, Consolidated Appropriations Act, 2018, Issues pertaining to funding of federal research, development, and education.\nP.L. 115-123, Bipartisan Budget Act of 2018, Issues pertaining to funding for FQHCs and Medicaid DSH Delay.\nFY 2019 Labor/HHS/Education Appropriations, Issues pertaining to funding for NIH, AHRQ, Title VII and VIII health professions, education research, and federal student aid.\nFY 2019 Energy/Water Appropriations, Issues pertaining to research, development, and education at DOE and funding for Fossil Energy.\nFY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF, NOAA, NIST, NASA, and EDA.\nFY 2019 Defense Appropriations, Issues pertaining research and development at the Department of Defense including the Army Research Laboratory Open Campus initiative.\nFY 2019 Homeland Security Appropriations, Issues pertaining to University Centers of Excellence.\nFY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to NEA, NEH, USGS, and the Water Resources Research Institutes.\nFY 2019 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs.\nFY 2019 Transportation, Housing and Urban Development, and Related Agencies Appropriations, Issues pertaining to research funding for the Department of Transportation.","Issues pertaining to infrastructure research, workforce development, and research infrastructure.\nIssues related to scientific research and sexual harassment.","P.L.115-91, National Defense Authorization Act for Fiscal Year 2018, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding and implementation of task order contracting for universities.\nNational Defense Authorization Act for Fiscal Year 2019, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding.","Issues pertaining to 340B Drug Pricing.\nIssues pertaining to addressing the opioid epidemic.\nH.R.4392, To provide that the provision of the Medicare Program: Hospital Outpatient Prospective Payment and Ambulatory Surgical Center Payment Systems and Quality Reporting Programs final regulation relating to changes in the payment amount for certain drugs and biologicals purchased under the 340B drug discount program shall have no force or effect, and for other purposes, Issues pertaining to the role of CMS in 340B Drug Pricing.\nIssues pertaining to support for sickle cell research and care.\nIssues pertaining to addressing health disparities.","Higher Education Act Reauthorization, Issues pertaining to accreditation, affordability, student aid programs, grant programs, reporting requirements, and Hispanic-Serving Institutions. \nH.R. 4508, Promoting Real Opportunity, Success, and Prosperity through Education Reform (PROSPER) Act, Issues pertaining to the reauthorization of the Higher Education Act, including student financial aid programs, grant programs, reporting requirements, and campus safety.","S. 1885, AV START Act, Issues pertaining to Federal Railroad Administration and Federal Transit Administration research and development funding.\nIssues pertaining to the University Transportation Center program.","H.R. 2, S. 3042, Agriculture and Nutrition Act of 2018; Agriculture Improvement Act of 2018, Issues pertaining to the research, conservation, nutrition, and rural development titles for the reauthorization of the 2014 farm bill.","Issues pertaining to 340B Drug Pricing.\nIssues pertaining to the role of higher education in addressing the opioid epidemic.\nH.R. 5261, TEACH to Combat Addiction Act, Issues pertaining to the role of higher education in addressing the opioid epidemic.","Issues pertaining to site-neutral payments in the 2019 outpatient prospective payment system.\nIssues pertaining to protecting Medicaid.","Issues pertaining to University Centers of Excellence.","Public Law No. 115-232, National Defense Authorization Act for Fiscal Year 2019, Issues pertaining to research and development activities of the Department of Defense, including basic and applied research funding, international security issues on university campuses, and implementation of task order contracting for universities.","Public Law No: 115-245, FY 2019 Labor/HHS/Education Appropriations, Issues pertaining to funding for NIH, AHRQ, Title VII and VIII health professions, education research, and federal student aid.\nPublic Law No: 115-244, FY 2019 Energy/Water Appropriations, Issues pertaining to research, development, and education at DOE.\nH.R. 5952, S. 3072, FY 2019 Commerce/Justice/Science Appropriations, Issues pertaining to NSF, NOAA, NIST, NASA, and EDA.\nPublic Law No: 115-245, FY 2019 Defense Appropriations, Issues pertaining to research and development, international security concerns, and research protections at the Department of Defense.\nH.R. 6776, S. 3109, FY 2019 Homeland Security Appropriations, Issues pertaining to University Centers of Excellence.\nH.R. 6147, S. 3073, FY 2019 Interior, Environment and Related Agencies Appropriations, Issues pertaining to NEA, NEH, USGS, and the Water Resources Research Institutes.\nH.R. 5961, S. 2976, FY 2019 Agriculture, Rural Development, FDA Appropriations, Issues pertaining to USDA research and related programs.\nH.R. 6072, S. 3023, FY 2019 Transportation, Housing and Urban Development, and Related Agencies Appropriations, Issues pertaining to research funding for the Department of Transportation.","H.R. 6227, S. 3143, National Quantum Initiative Act, Issues pertaining to support for fundamental quantum information science research.","Issues pertaining to 340B Drug Pricing.","H.R. 2267, S. 1301, Resident Physician Shortage Reduction Act of 2017, Issues pertaining to Graduate Medical Education.\nIssues pertaining to protecting Medicaid.","Public Law No. 115-334, Agriculture Improvement Act of 2018, Issues pertaining to the research, conservation, nutrition, and rural development titles for the reauthorization of farm bill."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}