{
  "id": 211833,
  "name": "UPMC",
  "slug": "upmc",
  "state": "PA",
  "description": "Health care provider and insurer",
  "totalSpending": 1480000,
  "filings": 17,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 130000
    },
    {
      "year": 2022,
      "income": 450000
    },
    {
      "year": 2023,
      "income": 360000
    },
    {
      "year": 2024,
      "income": 270000
    },
    {
      "year": 2025,
      "income": 270000
    }
  ],
  "firms": [
    "FEDERAL HEALTH POLICY STRATEGIES"
  ],
  "lobbyists": [
    "DAN ELLING",
    "COOKAB HASHEMI",
    "THOMAS SCULLY",
    "COLIN ROSKEY",
    "JENNIFER FRIEDMAN"
  ],
  "issues": [
    "HCR",
    "MMM",
    null
  ],
  "sampleDescriptions": [
    "Medicare billing issues\nMedicare legislative and regulatory issues",
    "H.R. 5376, Build Back Better Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund",
    "H.R. 5376, Build Back Better Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund; S. 610 Protecting Medicare and American Farmers from Sequester Cuts Act",
    "H.R. 5376, Build Back Better Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund; S. 610 Protecting Medicare and American Farmers from Sequester Cuts Act; H.R. 2471, Consolidated Appropriations Act, 2022; H.R. 4407/S. 1568 TRAIN Act",
    "H.R. 5376, Build Back Better Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund; S. 1568/H.R. 4407 TRAIN Act",
    "H.R. 5376, Inflation Reduction Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund; S. 1568/H.R. 4407 TRAIN Act H.R. 4040, Advancing Telehealth Beyond COVID-19 Act",
    "H.R. 5376, Inflation Reduction Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund; S. 1568/H.R. 4407 TRAIN Act H.R. 4040, Advancing Telehealth Beyond COVID-19 ActH.R. 2167, Consolidated Appropriations Act of 2023",
    "H.R. 5376, Inflation Reduction Act; issues related to proposed CMS/HHS rules governing the hospital inpatient and outpatient prospective payment systems and the physician fee schedule; issues related to operation of the CARES Act Provider Relief Fund; S. 1568/H.R. 4407 TRAIN Act H.R. 4040, Advancing Telehealth Beyond COVID-19 Act H.R. 2167, Consolidated Appropriations Act of 2023",
    "Issues related to CMS final rules governing Outpatient Protective Payment Systems (OPPS), Physician Fee Schedule (PFS) and 340B remedies; issues related to hospital transparency and health care consolidation under review by House Energy and Commerce Committee, House Ways and Means Committee, and Senate Finance Committee; issues related to cancer drug shortages; issues related to proposals affecting site of service payment differentials; H.R. 5378, Lower Costs, More Transparency Act; S. 2840, Bipartisan Primary Care and Workforce Act; issues related to cancer treatment and radiation oncology.",
    "Issues related to CMS proposed rules on improving organ transplant access; issues related to proposals affecting site of service payment differentials; H.R. 5378, Lower Costs, More Transparency Act; S. 2840, Bipartisan Primary Care and Workforce Act; issues related to mandatory program extender policies including delaying Medicaid Disproportionate Share Hospitals (DSH) reductions; issues related to Health Resources and Services Administration (HRSA) 340B program.",
    "Issues related to CMS proposed rules on improving organ transplant access; issues related to proposals affecting site of service payment differentials; H.R. 5378, Lower Costs, More Transparency Act; S. 2840, Bipartisan Primary Care and Workforce Act; issues related to mandatory program extender policies including delaying Medicaid Disproportionate Share Hospitals (DSH) reductions; issues related to Health Resources and Services Administration (HRSA) 340B program, government funding and continuing resolutions.",
    "Issues related to Medicaid program financing; issues related to continuous coverage of Marketplace insurance; CMS final rules on improving organ transplant access; issues related to proposals affecting site of service payment differentials; related to mandatory program extender policies including delaying Medicaid DSH reductions; issues related to HRSA 340B program; H.R. 1, One Big Beautiful Bill Act.",
    "Issues related to Medicaid program financing; issues related to continuous coverage of Marketplace insurance; CMS final rules on improving organ transplant access; issues related to proposals affecting site of service payment differentials; issues related to mandatory program extender policies including delaying Medicaid DSH reductions and telehealth waiver extensions; issues related to Rural Health Transformation Fund; H.R.1, One Big Beautiful Bill Act",
    "Issues related to Medicaid program financing; issues related to continuous coverage of Marketplace insurance; issues related to proposals affecting site of service payment differentials; issues related to mandatory program extender policies including delaying Medicaid DSH reductions and telehealth waiver extensions; issues related to Rural Health Transformation Fund; issues related to treatment of nurse education loan allowances and nurse shortage issues generally."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 108,
  "trajectory": "exploding",
  "yearsActive": 5,
  "avgAnnualSpending": 296000,
  "peakYear": 2022,
  "lobbyistCount": 5,
  "firmCount": 1,
  "issueCount": 2
}