{
  "id": 184867,
  "name": "URANIUM PRODUCERS OF AMERICA",
  "slug": "uranium-producers-of-america",
  "state": "NM",
  "description": "Trade association for domestic uranium industry",
  "totalSpending": 1690000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 100000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 150000
    },
    {
      "year": 2022,
      "income": 180000
    },
    {
      "year": 2023,
      "income": 250000
    },
    {
      "year": 2024,
      "income": 290000
    },
    {
      "year": 2025,
      "income": 320000
    }
  ],
  "firms": [
    "INVARIANT LLC"
  ],
  "lobbyists": [
    "HEATHER PODESTA",
    "BENJAMIN KLEIN",
    "LARISSA MARTINEZ",
    "LANDON STROPKO",
    "KENNY ROBERTS",
    "MAX FRANKEL",
    "BERKLEY LANE",
    "IAN FOLEY",
    "DAMIAN ORTEGA",
    "MAX WHITCOMB",
    "DOUGLAS DZIAK"
  ],
  "issues": [
    "ENG",
    "ENV",
    null
  ],
  "sampleDescriptions": [
    "Educate Members of Congress and Administration officials about issues facing the domestic uranium industry, including actions taken by the Department of Energy to transfer material from the federal excess uranium inventory into the market as well as related provisions in H.R. 1625, the Consolidated Appropriations Act of 2018 (P.L. 115-141); encourage support for S. 512, the Nuclear Energy Innovation and Modernization Act.",
    "Highlight concerns with EPA's Part 192 rulemaking.",
    "Educate Members of Congress and Administration officials about issues facing the domestic uranium industry; support provisions to halt Department of Energy uranium barters (including related provisions in H.R. 3266 and S. 1609); support S. 512, the Nuclear Energy Innovation and Modernization Act; pursue clarity on regulatory oversight role of the Environmental Protection Agency and Nuclear Regulatory Commission; support efforts to extend the Russian Suspension Agreement; and monitor issues impacting the domestic nuclear fuel cycle.",
    "Educate Members of Congress and Administration officials about issues facing the domestic uranium industry; support provisions to halt Department of Energy uranium barters (including related provisions in H.R. 3266 and S. 1609); support S. 512, the Nuclear Energy Innovation and Modernization Act; pursue clarity on regulatory oversight role of the Environmental Protection Agency and Nuclear Regulatory Commission; support efforts to extend the Russian Suspension Agreement; monitor issues impacting the domestic nuclear fuel cycle; educate Administration officials on water research needs in the domestic uranium industry.",
    "Educate Members of Congress and Administration officials about issues facing the domestic uranium industry; support provisions to halt Department of Energy uranium barters (including related provisions in H.R. 5895 and S. 2975); support S. 512, the Nuclear Energy Innovation and Modernization Act; pursue clarity on regulatory oversight role of the Environmental Protection Agency and Nuclear Regulatory Commission; support efforts to extend the Russian Suspension Agreement; monitor issues impacting the domestic nuclear fuel cycle; educate Administration officials on water research needs in the domestic uranium industry.",
    "Educate Members of Congress about issues facing the domestic uranium industry; support provisions to halt Department of Energy uranium barters (H.R. 2960); pursue clarity on regulatory oversight role of the Environmental Protection Agency and Nuclear Regulatory Commission; support efforts to extend the Russian Suspension Agreement and address uranium imports from state-backed entities; monitor issues impacting the domestic nuclear fuel cycle; oppose efforts to remove uranium from the critical minerals list (H.R. 3405).",
    "Educate Members of Congress about issues facing the domestic uranium industry; support provisions to halt Department of Energy uranium barters (S. 2470/H.R. 2960); pursue clarity on regulatory oversight role of the Environmental Protection Agency and Nuclear Regulatory Commission; support efforts to extend the Russian Suspension Agreement and address uranium imports from state-backed entities, including S. 482, the Defending American Security from Kremlin Aggression Act of 2019; monitor issues impacting the domestic nuclear fuel cycle; oppose efforts to remove uranium from the critical minerals list (H.R. 3405).",
    "Educate Members of Congress about issues facing the domestic uranium industry; support maintaining ban on Department of Energy uranium barters, including in S. 4049, the National Defense Authorization Act for Fiscal Year 2021; support efforts to extend the Russian Suspension Agreement and address uranium imports from state-backed entities, including S. 482, the Defending American Security from Kremlin Aggression Act of 2019; monitor issues impacting the domestic nuclear fuel cycle; oppose efforts to remove uranium from the critical minerals list (H.R. 3405).",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the domestic uranium reserve in H.R. 7613, the Energy and Water Development and Related Agencies Appropriations Act of 2021 and draft Senate bill. Support efforts to extend the Russian Suspension Agreement and address uranium imports from state-backed entities, including in S. 482, the Defending American Security from Kremlin Aggression Act of 2019; H.R. 6395 / S. 4049, the National Defense Authorization Act for Fiscal Year 2021; and H.R. 4447, the Clean Economy Jobs and Innovation Act. Monitor issues impacting the domestic nuclear fuel cycle. Oppose efforts to remove uranium from the critical minerals list (H.R. 3405).",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the domestic uranium reserve in H.R. 7613, the Energy and Water Development and Related Agencies Appropriations Act of 2021, draft Senate Energy and Water Development and Related Agencies Appropriations Act of 2021, and H.R. 133, the Consolidated Appropriations Act, 2021. Support efforts to extend the Russian Suspension Agreement and address uranium imports from state-backed entities, including in S. 482, the Defending American Security from Kremlin Aggression Act of 2019, H.R. 4447, the Clean Economy Jobs and Innovation Act, and H.R. 133, the Consolidated Appropriations Act, 2021. Monitor issues impacting the domestic nuclear fuel cycle. Oppose efforts to remove uranium from the critical minerals list (H.R. 3405). Discuss S.4897, the American Nuclear Infrastructure Act of 2020.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the domestic uranium reserve. Monitor issues impacting the domestic nuclear fuel cycle.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the domestic uranium reserve. Monitor issues impacting the domestic nuclear fuel cycle; support uraniums status as a critical mineral, including in H.R.4350, National Defense Authorization Act for Fiscal Year 2022.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the domestic uranium reserve. Monitor issues impacting the domestic nuclear fuel cycle; support uraniums status as a critical mineral, including in H.R.4350, National Defense Authorization Act for Fiscal Year 2022. Monitor Nuclear Regulatory Commission (NRC) and situational recovery rulemaking.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the strategic uranium reserve in the draft House Energy and Water Appropriations bill for fiscal year (FY) 2023. Support legislation that would instruct DOE to operate a domestic uranium reserve, including S. 3978 and H.R. 7403. Monitor issues impacting the domestic nuclear fuel cycle; support uraniums designation as a critical mineral; monitor Nuclear Regulatory Commission (NRC) in-situ recovery rulemaking; support a ban on Russian uranium imports, including S. 3856, A bill to prohibit the importation of uranium from the Russian Federation, H.R. 7222, To prohibit the importation of uranium from the Russian Federation. Support legislation to add uranium to the list of critical minerals published by the United States Geological Survey, H.R. 8045.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the strategic uranium reserve in S. 3978, H.R. 7403, and H.R. 8255, the Energy and Water Appropriations bill for fiscal year (FY) 2023. Support emergency supplemental funding for nuclear fuel in H.R. 6833. Support developing domestic HALEU capacity, including S. 4066, Fueling Our Nuclear Future Act. Support uranium's designation as a critical mineral, including H.R. 8045 and H.R. 8981. Monitor Nuclear Regulatory Commission (NRC) in-situ recovery rulemaking. Support a ban on Russian uranium imports, including S. 3856, A bill to prohibit the importation of uranium from the Russian Federation, and H.R. 7222, To prohibit the importation of uranium from the Russian Federation.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support emergency supplemental funding for nuclear fuel in the end-of-year fiscal year (FY) 2023 bill. Support legislation that would instruct the Department of Energy (DOE) to operate a domestic uranium reserve, including S. 3978 and H.R. 7403. Monitor issues impacting the domestic nuclear fuel cycle such as S. 4066, Fueling Our Nuclear Future Act. Support uranium's designation as a critical mineral; support and monitor domestic mining and critical mineral legislation such as H.R. 8981. Monitor Nuclear Regulatory Commission (NRC) in-situ recovery rulemaking. Support a ban on Russian uranium imports, including S. 3856, A bill to prohibit the importation of uranium from the Russian Federation, and H.R. 7222, To prohibit the importation of uranium from the Russian Federation. Monitor S. 4064, the International Nuclear Energy Act of 2022. Support legislation to add uranium to the list of critical minerals published by the United States Geological Survey, H.R. 8045. Support the nuclear fuel provisions included in S. 4543, the FY 2023 National Defense Authorization Act (NDAA). Monitor the implementation of P.L. 117-169, the Inflation Reduction Act.",
    "Educate Members of Congress about issues facing the domestic uranium industry. Support funding for the Department of Energy's (DOE) uranium reserve. Monitor Nuclear Regulatory Commission's (NRC) in-situ recovery rulemaking and the Bureau of Land Management's (BLM) proposed public lands rule. Support a ban on Russian uranium imports, including S. 763, the Reduce Russian Uranium Imports Act, and H.R. 1042, The Prohibiting Russian Uranium Imports Act. Support and monitor H.R.209, Permitting for Mining Needs Act of 2023, including similar provisions in H.R. 1, the Lower Energy Costs Act. Monitor the implementation of P.L. 117-169, the Inflation Reduction Act, including provisions impacting HALEU. Monitor H.R. 1534 and S.636, the Dolores River National Conservation Area and Special Management Area Act. Monitor uranium provision in S.1742, the Clean Energy Minerals Reform Act. Support and monitor the American Nuclear Workforce Act.",
    "Discuss issues facing the domestic uranium industry. Support implementation of the Nuclear Fuel Security Act [42 USC 16282] in P.L. 118 - 31, the Fiscal Year (FY) 2024 National Defense Authorization Act, including funding for the Department of Energys (DOE) uranium reserve. Monitor implementation of the HALEU provisions of P.L. 117 - 169, the Inflation Reduction Act. Support P.L. 118 - 62, the Prohibiting Russian Uranium Imports Act and its implementation by DOE. Support restoring uraniums federal critical mineral designation, including provisions of H.R. 209, the Permitting for Mining Needs Act, H.R. 1, the Lower Energy Costs Act, and S. 1456, the SPUR Act. Discuss H.R. 8046, the Rosatom Sanctions Enforcement Act. Support H.R. 8129, the American Nuclear Workforce Act.",
    "Discuss issues facing the domestic uranium industry. Support implementation of the Nuclear Fuel Security Act (P.L. 118 - 31) and the implementation of the HALEU provisions of the Inflation Reduction Act (P.L. 117 - 169). Discuss implementation of P.L. 118 - 62, the Prohibiting Russian Uranium Imports Act, including anticircumvention provisions. Support restoring uraniums federal critical mineral designation.",
    "Discuss issues facing the domestic uranium industry. Support implementation of the Nuclear Fuel Security Act (P.L. 118 - 31) and the implementation of the HALEU provisions of the Inflation Reduction Act (P.L. 117 - 169). Discuss implementation of P.L. 118 - 62, the Prohibiting Russian Uranium Imports Act, including anticircumvention provisions. Support restoring uranium's federal critical mineral designation. Discuss nuclear fuel production tax credit."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 60,
  "trajectory": "growing",
  "yearsActive": 8,
  "avgAnnualSpending": 211250,
  "peakYear": 2025,
  "lobbyistCount": 11,
  "firmCount": 1,
  "issueCount": 2
}