{"id":160324,"name":"VALERO ENERGY CORPORATION","slug":"valero-energy-corporation","state":"TX","description":"international manufacturer of transportation fuels and other petrochemical products","totalSpending":1200000,"filings":20,"yearlySpending":[{"year":2018,"income":240000},{"year":2019,"income":240000},{"year":2020,"income":240000},{"year":2021,"income":120000},{"year":2022,"income":120000},{"year":2024,"income":180000},{"year":2025,"income":60000}],"firms":["ERNST & YOUNG LLP (WASHINGTON COUNCIL ERNST & YOUNG)"],"lobbyists":["STEPHEN FRANCIS","TIM URBAN","WESTON COULAM","REBECCA BURCH","LAUREN RUBIN"],"issues":["TAX"],"sampleDescriptions":["International business tax issues regarding oil and gas","Guidance on the Tax Cut and Jobs Act, Fuel and energy tax credits","Tax issues relevant to refiners and IRS code section 40A - biodiesel credits and business tax credits","Biofuel tax credits - IRS Code section 6426","Biofuel tax credits - IRS Code section 6426, Alternative fuel mixture tax credit, H.R. 3301 - tax extenders","S. 617 - tax extenders, biofuel tax credits - IRC section 6426, Alternative fuel mixture tax credit","S. 617 - tax extenders, biofuel tax credits - IRC section 6426, Alternative fuel mixture tax credit; H.R. 1865 - consolidated appropriations","General corporate tax issues. IRC Sec. 6426, Alternative Fuel Mixture Credit.  American Energy Innovation Act (S. 2657, S.Amdt. 1407).  Proposals related to the Electric Vehicle Tax Credit (S. 343, S. 1094, H.R. 1027, H.R. 2256).","General corporate tax issues; HR 748, the Coronavirus Aid, Relief, and Economic Security (CARES) Act; HR 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act.","General corporate tax issues; HR 748, the Coronavirus Aid, Relief, and Economic Security (CARES) Act; HR 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act, HR 925.","General corporate tax issues; \nHR 748, the Coronavirus Aid, Relief, and Economic Security (CARES) Act; \nHR 6800, the Health and Economic Recovery Omnibus Emergency Solutions (HEROES) Act;\nHR 925;\nHR 133 - Consolidated Appropriations Act, 2021.","General corporate tax issues; H.R. 1319 - American Rescue Plan Act.","- HR 5376, Build Back Better Act (fiscal year 2022 budget reconciliation bill) \n- Sustainable Skies Act (H.R. 3440)","- General corporate tax issues - HR 5376, Build Back Better Act (fiscal year 2022 budget reconciliation bill) - Sustainable Skies Act (HR 3440) - Biodiesel tax credit","- General corporate tax issues - HR 5376, Build Back Better Act (fiscal year 2022 budget reconciliation bill) - Biodiesel tax credit","- General corporate tax issues - Inflation Reduction Act implementation (P.L. 117-169) - IRS Code Sec. 45Z (clean transportation fuels tax credit) - Issues related to sustainable aviation fuel"],"years":[2018,2019,2020,2021,2022,2024,2025]}