{"id":196566,"name":"VERIZON COMMUNICATIONS INC AND VARIOUS SUBSIDIARIES","slug":"verizon-communications-inc-and-various-subsidiaries","state":"NY","description":"A broadband and telecommunications company","totalSpending":1150000,"filings":22,"yearlySpending":[{"year":2018,"income":90000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":180000},{"year":2022,"income":110000},{"year":2024,"income":150000},{"year":2025,"income":200000}],"firms":["FORBES-TATE"],"lobbyists":["JEFFREY FORBES","ELIZABETH GREER","JERRY DRISCOLL","JEFFREY STRUNK","FRANKLYN STEINBERG","RICK MURPHY","FRANCESCA MCCRARY","KRISTINA DUNKLIN","CYNTHIA BROWN","KELLEY WILLIAMS","ARTHUR SIDNEY","SAMANTHA MCLEAN"],"issues":["TAX","TEC","TRD","BUD","TAR"],"sampleDescriptions":["Issues related to corporate tax reform; Issues related to spectrum auctions; Issues related to Net Neutrality; Issues related to accelerated depreciation; Issues related to infrastructure deployment; Issues related to privacy.","Issues related to corporate tax reform; Issues related to spectrum auctions; Issues related to Net Neutrality; Issues related to accelerated depreciation; Issues related to infrastructure deployment; Issues related to privacy; Issues related to 5G deployment.","Issues related to corporate tax reform; Issues related to accelerated depreciation; Issues related to infrastructure deployment.","Issues related to spectrum auctions; Issues related to Net Neutrality; Issues related to infrastructure deployment; Issues related to privacy; Issues related to 5G deployment.","Issues related to tariffs.","Issues related to spectrum auctions, net neutrality, infrastructure deployment, privacy, and 5G deployment.","Issues related to H.R. 925 - The Heroes Act.","Issues related to accelerated depreciation; Issues related to infrastructure deployment.","Issues regarding H.R. 1319 - American Rescue Plan Act of 2021 (Public Law No: 117-2).","Issues regarding the implementation of H.R. 1319 - American Rescue Plan Act of 2021 (Public Law No: 117-2).","Issues related to accelerated depreciation; Issues related to infrastructure deployment; Issues related to Research and Development Tax Credit.","Issues related to accelerated depreciation; Issues related to infrastructure deployment; Issues related to Research and Development Tax Credit; Issues related to TCJA Extension.","Issues related to accelerated depreciation; Issues related to infrastructure deployment; Issues related to Research and Development Tax Credit; Issues related to Tax Cuts and Jobs Act (PL 115-97) Extension.","Issues related to spectrum auctions, infrastructure deployment, privacy, and 5G deployment.","Issues related to spectrum auctions, infrastructure deployment, privacy, and 5G deployment. Issues related to FY 2026 NDAA."],"years":[2018,2019,2020,2021,2022,2024,2025]}