{"id":169447,"name":"VIASAT, INC.","slug":"viasat-inc","state":"CA","description":"Satellite broadband and secure communications and cybersecurity solutions provider.","totalSpending":2510000,"filings":28,"yearlySpending":[{"year":2018,"income":270000},{"year":2019,"income":270000},{"year":2020,"income":340000},{"year":2021,"income":350000},{"year":2022,"income":290000},{"year":2023,"income":360000},{"year":2024,"income":360000},{"year":2025,"income":270000}],"firms":["DLA PIPER LLP (US)"],"lobbyists":["NATHANIEL BELL","STEVEN PHILLIPS","ANNE KIERIG","TONY SAMP","CHARLES DENT","LIZ ALBERTINE","SAXBY CHAMBLISS","VINCENT SARUBBI","ALEX PINSON"],"issues":["DEF",null],"sampleDescriptions":["H.R. 5515, National Defense Authorization Act, FY2019, provisions regarding commercial satellites.\nH.R. 6157/S. 3159, Department of Defense Appropriations Act, FY2019, provisions regarding commercial satellites.","National Defense Authorization Act, FY2020, provisions regarding commercial satellites.\nDepartment of Defense Appropriations Act, FY2020, provisions regarding commercial satellites.","H.R. 2500/S. 1790, National Defense Authorization Act, FY2020, provisions regarding commercial satellites. \nH.R. 2988, Department of Defense Appropriations Act, FY2020, provisions regarding commercial satellites.","H.R. 2500/S. 1790, National Defense Authorization Act, FY2020, provisions regarding commercial satellites. \nH.R. 2968, Department of Defense Appropriations Act, FY2020, provisions regarding commercial satellites.","National Defense Authorization Act, FY 2021, provisions regarding commercial satellites.\nDepartment of Defense Appropriations, FY 2021, provisions regarding commercial satellites. \nAir Force procurement issues.","H.R. 6395/S. 4049, National Defense Authorization Act, FY 2021, provisions regarding commercial satellites.\nDepartment of Defense Appropriations, FY 2021, provisions regarding commercial satellites. \nAir Force procurement issues.","H.R. 6395/S. 4049, National Defense Authorization Act, FY 2021, provisions regarding commercial satellites.\nH.R. 7617, Department of Defense Appropriations, FY 2021, provisions regarding commercial satellites. \nAir Force procurement issues.","H.R. 6395/S. 4049, National Defense Authorization Act, FY 2021, provisions regarding commercial satellites.\nH.R. 7617, Department of Defense Appropriations, FY 2021, provisions regarding commercial satellites. \nAir Force procurement issues. \nH.R. 133, Consolidated Appropriations Act of 2021, provisions regarding commercial satellites.","National Defense Authorization Act, FY 2022, provisions regarding commercial satellites.\nDepartment of Defense Appropriations, FY 2022, provisions regarding commercial satellites.\nAir Force procurement issues.\nCybersecurity and orbital debris issues.","H.R. 4432, Department of Defense Appropriations Act, FY2022, provisions regarding commercial satellites.\nAir Force procurement issues.\nCybersecurity and orbital debris issues. \nH.R. 4431, Department of Homeland Security Appropriations Act, FY2022, provisions regarding commercial satellites.","H.R. 8236, Department of Defense Appropriations Act, FY2023, provisions regarding commercial satellites. Air Force procurement issues. Cybersecurity and orbital debris issues. H.R. 8257, Department of Homeland Security Appropriations Act, FY2023, provisions regarding commercial satellites.","H.R. 4365/S. 2587, Department of Defense Appropriations Act, FY2024, provisions regarding commercial satellites. Air Force procurement issues. Cybersecurity and orbital debris issues. H.R. 4367/S. 2625, Department of Homeland Security Appropriations Act, FY2024, provisions regarding commercial satellites. Department of Defense Appropriations Act, FY2025, provisions regarding commercial satellites. Department of Homeland Security Appropriations Act, FY2025, provisions regarding commercial satellites.","Air Force procurement issues. Cybersecurity and orbital debris issues. H.R. 8774, Department of Defense Appropriations Act, FY2025, provisions regarding commercial satellites. H.R. 8752, Department of Homeland Security Appropriations Act, FY2025, provisions regarding commercial satellites.","Air Force procurement issues. Cybersecurity and orbital debris issues. H.R. 8774/S. 4921, Department of Defense Appropriations Act, FY2025, provisions regarding commercial satellites. H.R. 8752, Department of Homeland Security Appropriations Act, FY2025, provisions regarding commercial satellites.","Air Force procurement issues. Cybersecurity and orbital debris issues. Department of Defense Appropriations Act, FY2025 and FY2026, provisions regarding commercial satellites. Department of Homeland Security Appropriations Act, FY2025 and FY2026, provisions regarding commercial satellites. H.R. 1968, FY2025 Full-Year Continuing Appropriations and Extensions Act, provisions regarding commercial satellites.","Air Force procurement issues. Cybersecurity and orbital debris issues. H.R. 4016, Department of Defense Appropriations Act, FY2026, provisions regarding commercial satellites. H.R. 4213, Department of Homeland Security Appropriations Act, FY2026, provisions regarding commercial satellites.","Air Force procurement issues. Cybersecurity and orbital debris issues. H.R. 4016/S. 2572, Department of Defense Appropriations Act, FY2026, provisions regarding commercial satellites. H.R. 4213, Department of Homeland Security Appropriations Act, FY2026, provisions regarding commercial satellites."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}