{
  "id": 181508,
  "name": "VIRTUA",
  "slug": "virtua",
  "state": "NJ",
  "description": "health system",
  "totalSpending": 1540000,
  "filings": 30,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 60000
    },
    {
      "year": 2019,
      "income": 80000
    },
    {
      "year": 2020,
      "income": 320000
    },
    {
      "year": 2021,
      "income": 400000
    },
    {
      "year": 2022,
      "income": 400000
    },
    {
      "year": 2023,
      "income": 160000
    },
    {
      "year": 2024,
      "income": 60000
    },
    {
      "year": 2025,
      "income": 60000
    }
  ],
  "firms": [
    "WASHINGTON STRATEGIC CONSULTING"
  ],
  "lobbyists": [
    "KYLE MULROY",
    "ROSS AIRINGTON"
  ],
  "issues": [
    "HCR",
    null
  ],
  "sampleDescriptions": [
    "Protecting the imputed floor policy for all-urban states, Stark law reform, opioid legislation, telehealth",
    "Protecting the imputed floor policy for all-urban states, Stark law reform, telehealth, Pandemic and All Hazards Preparedness Act, Substance Use-Disorder Prevention that Promotes Opioid Recovery and Treatment for Patients and Communities Act, CY Hospital Outpatient Prospective Payment Rule, CMS RFI on Anti-Kickback Statute & Stark Law",
    "Substance Use-Disorder Prevention that Promotes Opioid Recovery and Treatment (SUPPORT) for Patients and Communities Act, Pandemic All-Hazards Preparedness and Advancing Innovation (PAHPAI) Act of 2019, Network Adequacy and Surprise Billing, Imputed Rural Floor, Site-neutral Payment for E/M Services at Off-Campus HOPDs.",
    "Alternatives to Opioids (ALTO) Demonstration program funding, Resident Physician Shortage Act of 2019 S. 348) - Increased funding for Medicare GME slots, Surprise Medical Bills (pending legislation), Medicaid DSH cuts, Improving Access to Medicare Coverage Act (H.R. 1682/S. 753) - Addressing the Medicare 3-Day Rule for nursing home care, Home Health Payment Innovation Act (S. 433) - Limit Medicare rate changes to 2 percent per year, Protecting Jessica Grubbs Legacy Act (S. 1012) - Federal privacy rules (42 CFR Part 2), Overdose Prevention and Patient Safety Act (H.R. 2062) - Federal privacy rules (42 CFR Part 2), Palliative Care and Hospice Education Act, Protecting Pre-Existing Conditions & Making Health Care More Affordable Act, State Allowance for a Variety of Exchanges (SAVE) Act (H.R. 1385)",
    "Alternatives to Opioids (ALTO) Demonstration program funding, Resident Physician Shortage Act of 2019 S. 348) - Increased funding for Medicare GME slots, Surprise Medical Bills (pending legislation), Medicaid DSH cuts, Improving Access to Medicare Coverage Act (H.R. 1682/S. 753) - Addressing the Medicare 3-Day Rule for nursing home care, Home Health Payment Innovation Act (S. 433) - Limit Medicare rate changes to 2 percent per year, Protecting Jessica Grubbs Legacy Act (S. 1012) - Federal privacy rules (42 CFR Part 2), Overdose Prevention and Patient Safety Act (H.R. 2062) - Federal privacy rules (42 CFR Part 2), Palliative Care and Hospice Education Act, Protecting Pre-Existing Conditions & Making Health Care More Affordable Act, State Allowance for a Variety of Exchanges (SAVE) Act (H.R. 1385), Pandemic All-Hazards legislation, Medicare area wage index",
    "Paycheck Protection Program and Health Care Enhancement Act (H.R.266); CARES Act (H.R.748); Loan Forgiveness Bill (HR 7292); Healthcare Workforce Resilience Act (S. 3599); Medicare Area Wage Index - Imputed Rural Floor.",
    "Telehealth 1135 waivers, Provider Relief Fund, Medicare Advance and Accelerated Payments, Employer Liability, Coronavirus Aid, Relief, and Economic Security (CARES) Act, HEROES Act 2.0 (H.R. 6800), Health, Economic Assistance, Liability Protection and Schools (HEALS) Act, Coronavirus Response and Relief Supplemental Appropriations Act of 2021, Price Transparency, annual Medicare/Medicaid payment rules, Surprise Billing, Imputed Rural Floor",
    "American Rescue Plan Act of 2021 (H.R.1319); Health Care Improvement Act of 2021 (S. 352); Workforce Violence Prevention for Health Care and Social Service Workers Act (H.R. 1195); Resident Physician Shortage Reduction Act of 2021 (S. 834); Protecting Access to Post-COVID-19 Telehealth Act of 2021 (H.E. 366); Social Determinants Accelerator Act of 2021 (H.R. 2503); \"An Act to prevent across-the-board direct spending cuts, and for other purposes\" (H.R. 1868); The Resetting the Impact Act (TRIA) of 2021 (H.R. 8826); Forthcoming Infrastructure Legislation (health care impact); Statutory PAYGO Sequester relief (re: American Rescue Plan Act); 340B COVID relief (S. 773), Price Transparency (HHS rule and re: No Surprises Act); Medicare Area Wage Index - Imputed Rural Floor; Medicare Area Wage Index - creation of new CBSA in New Jersey; telehealth (post-PHE expansion and waivers); CARES Act Provider Relief Fund (general and rural allocation).",
    "Medicare annual payment rules; Graduate Medical Education; COVID-19 Hospital and Health Provider Loan Conversion Act (H.R. 1349); Provider Relief Fund; Medicare Sequester Relief Act (S. 748 / H.R. 1868) ; Parity Enforcement Act (H.R. 1364); Resident Physician Shortage Reduction Act of 2021 (S.834); Dr. Lorna Breen Health Care Provider Protection Act (S. 610 / H.R. 1667); H.R. 2903, the CONNECT for Health Act; Medicare Area Wage Index - Imputed Rural Floor, Core Based Statistical Areas; H.R. 1319, American Rescue Plan Act of 202",
    "Medicare Area Wage Index - New Brunswick-Lakewood CBSA; Radiation Oncology Model; Surprise Billing - Qualified Payment Amount; Site-neutral payment/BBA 2015 Sec. 603; Build Back Better Act (H.R. 5376); Protecting Medicare and American Farmers from Sequester Cuts Act (S. 610); Protecting the American Taxpayer and Medicare Act (S. 3344); Supporting Health Care Providers During the COVID-19 Pandemic Act (H.R. 6143); Supporting Medicare Providers Act of 2021 (S. 3314); Infrastructure Investment and Jobs Act (H.R. 3684); Resident Physician Shortage Reduction Act of 2021 (S.834); Accelerating Access to Critical Therapies for ALS Act (H.R. 3537/S. 1813); Comprehensive Addiction Resources Emergency Act of 2021 (H.R. 6311/S. 3418); Expanding Medical Education Act (H.R. 801/S. 3422); Opioid Treatment Access Act of 2022 (H.R. 6279); Dr. Lorna Breen Health Care Provider Protection Act (H.R. 1667); Capping Prescription Costs Act of 2021 (H.R. 6228/S. 3339); No COVID-19 Vaccination Mandate Act of 2021 (H.R. 6170); Cures 2.0 Act (H.R. 6000); Respecting Our Frontline Workers Act (S. 3225); Provider Relief Fund Improvement Act (H.R. 5963); Inpatient Opioid Safety Act of 2021 (H.R. 5932); LOCAL HEALTH Act (H.R. 5898); Keeping Our COVID-19 Heroes Employed Act (H.R. 5860); Expanded Telehealth Access Act (H.R. 2168/S. 3193); Healthy Competition for Better Care Act (S. 3139); Hospital Revitalization Act of 2021 (S. 3105); Choose Home Care Act of 2021 (H.R. 5514/S. 2562); Good Samaritan Health Professionals Act of 2021 (H.R. 5239/S. 2941); 340B Accountability Act of 2021 (S. 2837).",
    "Public Health Emergency Extension; HRSA Provider Relief Fund Phase 4; Medicare Area Wage Index - New Brunswick-Lakewood CBSA (CMS-1752-F); Surprise Billing - Qualified Payment Amount, Good Faith Estimates (CMS-9908-IFC)/No Surprises Act (P. L. 116-260); Site-neutral payment/BBA 2015 Sec. 603 (P.L. 114-74); CY 2023 Home Health Prospective Payment System Rate Update (CMS-1766-P); FY 2023 Hospital Inpatient Prospective Payment System (CMS-1771-P); FY 2023 SNF Prospective Payment System (CMS-1765-P); Radiation Oncology (RO) Model (CMS-5527-P2); FY 2023 IRF Prospective Payment System (CMS-1767-P); FY 2023 Inpatient Psychiatric Facilities Prospective Payment System (CMS-1769-P); FY 2023 Hospice Wage Index (CMS-1773-P); Bipartisan Safer Communities Act (P.L. 117-159); FY 2023 Appropriations - Labor-HHS; Safety from Violence for Healthcare Employees (SAVE) Act of 2022 (H.R. 7961); ALTO Reauthorization Act (H.R. 4846/S. 2538); Improving Trauma Systems and Emergency Care Act (H.R. 8163/S. 3566); Hospital Inpatient Services Modernization Act (H.R. 7053/S. 3792); PREVENT Pandemics Act (S. 3799); Health Care Providers Safety Act of 2022 (H.R. 7814/S. 4268); Restoring Hope for Mental Health and Well-Being Act of 2022 (H.R. 7666); Travel Nursing Agency Transparency Study Act (S. 4352); Medicare Sequestration.",
    "Consolidated Appropriations Act, 2023 (Pub. L. 117-328); Area Wage Index for Post-Acute Providers; Medicare Sequestration; PAYGO Sequestration; Preserving Access to Home Health Act (H.R. 8581/S. 4605); Hospital Inpatient Services Modernization Act (H.R. 7053/S. 3792); Building Americas Health Care Workforce Act (H.R. 7744); Supporting Medicare Providers Act (H.R. 8800); Improving Seniors Timely Access to Care Act (H.R. 3173/S. 3018); Restoring Hope for Mental Health and Well-Being Act of 2022 (H.R. 7666); Improving Trauma Systems and Emergency Care Act (H.R. 8163/S. 3566); Safety from Violence for Healthcare Employees Act (H.R. 7961); Advancing Telehealth Beyond COVID-19 Act (H.R. 4040); ALTO Reauthorization Act (H.R. 4846/S. 2538); Value in Health Care Act (H.R. 4587); Mental Health Justice Act of 2022 (H.R. 8542/S. 515); Contract Year 2024 Policy and Technical Changes to the Medicare Advantage Program (CMS-4201-P); Programs; Advancing Interoperability and Improving Prior Authorization Processes for Medicare Advantage Organizations (CMS-0057-P); Hospital IPPS and ASC Rule (CMS-1773-FC); CY 2023 Physician Fee Schedule (CMS-1770-F); CY 2023 Home Health PPS (CMS-1766-F); Implementing Certain Provisions of the CSA 2021 (CMS-4199-F); Hospital IPPS Rule (CMS-1771-F).",
    "Site-neutral payment policy proposals, including the Lower Costs, More Transparency Act (H.R. 5378), Telehealth Modernization Act of 2023 (H.R. 7623), Medicaid Disproportionate Share Hospital Cuts, including the Consolidated Appropriations Act, 2024 (H.R. 4366).",
    "The Telehealth Modernization Act of 2024 (H.R. 7623) and the Preserving Telehealth, Hospital, and Ambulance Access Act (H.R. 8261); The Health Care Cybersecurity Improvement Act of 2024 (S. 4054); Bipartisan Medicare GME Working Groups discussion draft regarding Medicare Graduate Medical Education; Site-neutral payment policy proposals, including the Lower Costs, More Transparency Act (H.R. 5378), Medicaid Disproportionate Share Hospital Cuts, including the Consolidated Appropriations Act, 2024 (H.R. 4366); the 340B Drug Pricing Program.",
    "Site-neutral payment policy proposals, including the Lower Costs, More Transparency Act (H.R. 5378) and the Bipartisan Primary Care and Health Workforce Act (S. 2840) Healthcare workforce shortage Healthcare Workforce Resilience Act (H.R. 6205/ S. 3211) Nurse Staffing Standards for Hospital Patient Safety and Quality Care Act (S. 111/H.R. 2530) Resident Physician Shortage Reduction Act of 2023 (H.R. 2389/ S. 1302) Payment reductions to the Medicaid DSH program",
    "\"Medicare Hospital at Home Program; H.R. 1 - One Big Beautiful Bill Act; Medicaid provisions within HR 1; Medicaid; Telehealth; Graduate Medical Education\"",
    "State-directed payments; Organ transplant; Medicaid; Telehealth; Graduate Medical Education"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 192500,
  "peakYear": 2021,
  "lobbyistCount": 2,
  "firmCount": 1,
  "issueCount": 1
}