{
  "id": 151365,
  "name": "VISA",
  "slug": "visa",
  "state": "DC",
  "description": null,
  "totalSpending": 1450000,
  "filings": 29,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 200000
    },
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 150000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 150000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 150000
    },
    {
      "year": 2025,
      "income": 200000
    }
  ],
  "firms": [
    "WILLIAMS AND JENSEN, PLLC"
  ],
  "lobbyists": [
    "MATTHEW HOEKSTRA",
    "SUSAN HIRSCHMANN",
    "JOEL OSWALD",
    "CHERYL JAEGER",
    "CHRISTOPHER HATCHER",
    "MELINDA MAXFIELD",
    "CHRISTOPHER WILCOX",
    "PHILIP KIKO",
    "DANIEL ZIEGLER",
    "JOSHUA FENDRICK"
  ],
  "issues": [
    "SCI",
    "HCR",
    "TAX",
    "CPT",
    "TRD",
    "FIN",
    null
  ],
  "sampleDescriptions": [
    "Cybersecurity and information technology legislation; card security technology.",
    "Issues Related to HSAs, FSAs and ACA implementation.",
    "HSA, FSA, HRA issues related to ACA implementation.",
    "Intellectual property and content issues.",
    "Issues related to trade.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; issues related to financial regulatory reform; H.R. 10 Financial Choice Act; S. 2155.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; issues related to financial regulatory reform; S. 2155.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; issues related to financial regulatory reform.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; issues related to financial regulatory reform.    Issues relating to Data Use and Privacy.",
    "Issues related to HSAs, FSAs.",
    "Issues related to trade.  Issues relating to USMCA.",
    "HSAs, FSAs HRA issues.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security;   Issues relating to Data Use and Privacy.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; \nissues related to financial regulatory reform; issues relating to Data Use and Privacy.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; \nissues related to financial regulatory reform; issues relating to Data Use and Privacy;  COVID-19 relief proposals.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; \nissues related to financial regulatory reform; issues relating to Data Use and Privacy;  COVID-19 relief proposals.   H.R. 133, Consolidated  Appropriations Act, 2021, Public Law No: 116-260.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; issues related to financial regulatory reform.   Issues relating to Data Use and Privacy.  COVID-19 relief proposals including American Rescue Plan Act of 2021, P.L. 117-2, H.R. 1319.",
    "Monitor general business tax issues, HSA, FSA, HRA issues.",
    "Issues Related to HSAs, FSAs.",
    "Issues relating to interchange fees on electronic payments; issues relating to financial literacy; issues relating to payment innovation and card technology; issues related to payment card security; issues related to financial regulatory reform. Issues relating to Data Use and Privacy. COVID-19 relief proposals including American Rescue Plan Act of 2021, P.L. 117-2, H.R. 1319."
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 0,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 181250,
  "peakYear": 2018,
  "lobbyistCount": 10,
  "firmCount": 1,
  "issueCount": 6
}