{"id":140658,"name":"VISTRA CORPORATE SERVICES COMPANY F/K/A VISTRA ENERGY","slug":"vistra-corporate-services-company-f-k-a-vistra-energy","state":"DC","description":"Energy","totalSpending":1250000,"filings":25,"yearlySpending":[{"year":2018,"income":200000},{"year":2019,"income":200000},{"year":2020,"income":200000},{"year":2021,"income":150000},{"year":2022,"income":200000},{"year":2024,"income":100000},{"year":2025,"income":200000}],"firms":["PUBLIC STRATEGIES WASHINGTON, INC."],"lobbyists":["JOSEPH O'NEILL","PATRICK O'NEILL","STEVEN EICHENAUER","THOMAS NAGLE","NANCY O'NEALL","AARON SUNTAG"],"issues":["TAX","ENG","INT","TRD"],"sampleDescriptions":["Legislation to provide tax credits to encourage energy production","Grid reliability, renewable energy and battery storage proposals","Cybersecurity-related proposals","Legislation to provide tax credits to encourage energy production / storage","Grid reliability and battery storage proposals","Legislation to provide tax credits to encourage energy storage","Legislation to provide tax credits to encourage energy storage. Proposals related to corporate tax issues. Monitor tax extender legislation.","Legislation to provide tax credits to encourage energy storage\nMonitor proposals related to corporate tax issues","Legislation to provide tax credits to encourage energy storage\nMonitor proposals related to corporate tax issues \nOngoing monitoring of the Build Back Better Act and the Infrastructure Investment and Jobs Act","Legislation to provide tax credits to encourage energy storage\nMonitor proposals related to corporate tax issues \nOngoing monitoring of the Build Back Better Act","Legislation to provide tax credits to encourage energy storage Monitor proposals related to corporate tax issues Ongoing monitoring of the Build Back Better Act","Legislation to provide tax credits to encourage energy storage Monitor proposals related to corporate tax issues Ongoing monitoring of the consideration of reconciliation packages","Grid reliability and battery storage proposals. Permitting reform propsals","Legislation to provide tax credits to encourage energy storage Monitor proposals related to corporate tax issues Ongoing monitoring of the consideration of the Inflation Reduction Act","Legislation to provide tax credits to encourage energy storage Monitor proposals related to corporate tax issues Implementation of the Inflation Reduction Act","Grid reliability and permitting reform","Monitor proposals related to corporate tax issues Implementation of the Inflation Reduction Act","●Monitor proposals related to corporate and energy tax issues ●Implementation of the Inflation Reduction Act","Monitored proposals related to trade and tariff policy","Monitor proposals related to trade and tariff policy"],"years":[2018,2019,2020,2021,2022,2024,2025]}