{"id":184920,"name":"VSP","slug":"vsp","state":"CA","description":"Vision care health insurance and eyeglass manufacturer.","totalSpending":1520000,"filings":26,"yearlySpending":[{"year":2018,"income":50000},{"year":2019,"income":70000},{"year":2020,"income":170000},{"year":2021,"income":140000},{"year":2022,"income":150000},{"year":2023,"income":300000},{"year":2024,"income":320000},{"year":2025,"income":320000}],"firms":["INVARIANT LLC"],"lobbyists":["HEATHER PODESTA","JONATHAN BECKER","ROBERT HOFFMAN","BENJAMIN KLEIN","MARY STANTON","KATHRYN WISE","LINDLEY SHERER","ANNABELL STOKES","CHRISTOPHER GILLOTT","ASHLEY O'SULLIVAN","DREW GRIFFIN","KAETLYN FANNING","JEFFREY LUNGREN","JENNIFER HAYNES"],"issues":["CSP","LBR","HCR","TAX","MMM",null],"sampleDescriptions":["Monitor competition issues in the global eyewear market.","Monitor proposals related to tax treatment of standalone vision plans.","Discuss impact of Health Insurance Tax and impact on standalone vision plans.","Issues related to standalone vision plans, including H.R. 3762, the DOC Access Act of 2019.","Monitor issues related to standalone vision plans, including H.R. 3762, the DOC Access Act of 2019; advocate for inclusion of optometrists as an essential provider during the COVID-19 pandemic.","Monitor issues related to standalone vision plans, including H.R. 3762, the DOC Access Act of 2019.","Monitor issues related to standalone vision plans, including H.R. 3762, the DOC Access Act of 2019, and telehealth policy.","Monitor issues related to standalone vision plans, and related draft legislation, and telehealth policy.","Monitor issues related to standalone vision plans, S. 1793 and H.R. 3461 Doc Access Act of 2021, and telehealth policy.","Support efforts to provide vision services through Medicare.","Monitor issues related to standalone vision plans, including S. 1793 and H.R. 3461 Doc Access Act of 2021.","Monitor S. 3108 and H.R. 3173 the Improving Seniors' Timely Access to Care Act of 2022.","Monitor issues related to standalone vision plans, including S.1793 and H.R.3461 DOC Access Act of 2021.","Monitor S.3108 and H.R.3173, the Improving Seniors Timely Access to Care Act of 2022.","Monitor issues related to vision care plans, including S.1424 / H.R.1385 DOC Access Act of 2023. Educate policymakers on the vision care market.","Monitor issues related to vision care plans, including S.1424 / H.R.1385 DOC Access Act of 2023, and S.5375, Vison Lab Choice Act. Educate policymakers on the vision care market.","Monitor issues related to vision care plans, including H.R.1521 DOC Access Act of 2025. Educate policymakers on the vision care market.","Monitor issues related to vision care plans, including H.R.1521, the DOC Access Act of 2025, and S.1716, the Vision Lab Choice Act of 2025. Educate policymakers on the vision care market.","Monitor issues related to vision care plans, including H.R.1521, the DOC Access Act of 2025, and S.1716, the Vision Lab Choice Act of 2025. Educate policymakers on consumer choice and competition in the vision market."],"years":[2018,2019,2020,2021,2022,2023,2024,2025]}