{"id":208032,"name":"WABTEC CORPORATION","slug":"wabtec-corporation","state":"PA","description":"rail tech company building equipment & associated products; services in freight & transit","totalSpending":1720000,"filings":16,"yearlySpending":[{"year":2021,"income":230000},{"year":2022,"income":440000},{"year":2023,"income":490000},{"year":2024,"income":110000},{"year":2025,"income":450000}],"firms":["VENN STRATEGIES"],"lobbyists":["ERIK OLSON","BENJAMIN STEINBERG","DOUG MACGILLIVRAY","JOSHUA THARRINGTON","BENNETT RESNIK","MACRAE SHARP","TEAGAN POLEYKETT"],"issues":["BUD","TRA","RRR","MAN","ENG","SCI","FOR",null],"sampleDescriptions":["matters related to creating a more sustainable and safe freight transportation network.","Developing hybrid, battery, electric, and hydrogen fuel cell locomotives.","Developing hybrid, battery, electric, and hydrogen fuel cell locomotives; and technology development to build a state of the art rail network.","Efforts to build a more sustainable, safe, and better utilized freight rail system.","To manufacture and deploy technologies on the freight rail network.","To manufacture and deploy technologies on the freight rail network, including support for H.R. 3684, the INVEST in America Act and S. 1732.","Efforts to build a more sustainable, safe, and better utilized freight rail system, including support for H.R. 3684, the INVEST in America Act and S. 1732.","Developing hybrid, battery, electric, and hydrogen fuel cell locomotives, including support for H.R. 3684, the INVEST in America Act and S. 1732.","Developing hybrid, battery, electric, and hydrogen fuel cell locomotives; and technology development to build a state of the art rail network, including support for H.R. 3684, the INVEST in America Act and S. 1732.","Efforts to build a more sustainable, safe, and better utilized freight rail system, including support for H.R. 3684, the INVEST in America Act and S.1732.","Efforts to build a more sustainable, safe, and better utilized freight rail system, including support for H.R. 4521, the America COMPETES Act of 2022, and S.1732.","Developing hybrid, battery, electric, and hydrogen fuel cell locomotives, including support for H.R. 4521, the America COMPETES Act of 2022, and S.1732.","Developing hybrid, battery, electric, and hydrogen fuel cell locomotives; and technology development to build a state of the art rail network, including support for H.R. 4521, the America COMPETES Act of 2022, and S.1732.","To manufacture and deploy technologies on the freight rail network, including support for H.R. 4521, the America COMPETES Act of 2022, and S.1732.","Supply and logistical issues to supply the Ukrainian Railways diesel-electric locomotives with spare parts, materials, tools, and equipment to maintain the locomotives.","Supply and logistical issues to supply the Ukrainian Railways diesel-electric locomotives with spare parts, materials, tools, and equipment to maintain the locomotives. As well as, International procurement of rail locomotives and related parts.","Research, development, and deployment of hybrid, battery electric, hydrogen, and hydrogen fuel cell locomotives.","Research, development, and deployment of hybrid, battery electric, hydrogen, and hydrogen fuel cell locomotives; and technology development to build a state of the art rail network.","Logistics and procurement matters related to Ukrainian Railway, Kazakhstan Railroad, Mongolian Railroad, and international coordination in West Africa and Central Asia.","Logistics and procurement matters related to Ukrainian Railways, Kazakhstan Railways, and international coordination in West Africa and Central Asia."],"years":[2021,2022,2023,2024,2025]}