{
  "id": 208506,
  "name": "WING AVIATION LLC",
  "slug": "wing-aviation-llc",
  "state": "CA",
  "description": "Air delivery and navigation company",
  "totalSpending": 1540000,
  "filings": 23,
  "yearlySpending": [
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 150000
    },
    {
      "year": 2023,
      "income": 470000
    },
    {
      "year": 2024,
      "income": 400000
    },
    {
      "year": 2025,
      "income": 320000
    }
  ],
  "firms": [
    "HOLLAND & KNIGHT LLP"
  ],
  "lobbyists": [
    "DAVID WHITESTONE",
    "JOEL ROBERSON",
    "LESLIE POLLNER",
    "MICHAEL FRIEDBERG",
    "JENNY BUSBY",
    "THOMAS STORY",
    "EMMA EKMAN",
    "TODD WOOTEN",
    "KATHRYN LEHMAN",
    "DIMITRIOS KARAKITSOS",
    "ELIZABETH CRADDOCK",
    "THOMAS FREEMAN",
    "CHRISTOPHER SENN",
    "SCOTT MASON",
    "KRISTIAN HAVARD",
    "BENJAMIN YEPEZ"
  ],
  "issues": [
    "TRA",
    null
  ],
  "sampleDescriptions": [
    "Air delivery of goods by unmanned aircraft systems and the safety of drone navigation using unmanned traffic management.",
    "Air delivery of goods by unmanned aircraft systems and the safety of drone navigation using unmanned traffic management; FY 2022 appropriations for the Federal Aviation Administration.",
    "Air delivery of goods by unmanned aircraft systems and the safety of drone navigation using unmanned traffic management; FY 2022 appropriations for the Federal Aviation Administration; remote identification of drones; FAA type certification of drones; American Jobs Plan provisions related to FEMA disaster recovery.",
    "Air delivery of goods by unmanned aircraft systems and the safety of drone navigation using unmanned traffic management; FY 2022 appropriations for the Federal Aviation Administration (H.R. 4550); remote identification of drones; FAA type certification of drones; FAA reorganization.",
    "Air delivery of goods by unmanned aircraft systems and the safety of drone navigation using unmanned traffic management; FY 2022 appropriations for the Federal Aviation Administration (H.R. 4550, S. 3045); FAA type certification of drones; FAA reorganization.",
    "Air delivery of goods by unmanned aircraft systems; drone navigation using unmanned traffic management; FY 2023 appropriations for the Federal Aviation Administration (H.R. 8294); FAA type certification of drones; FAA reorganization; beyond visual line of sight operation of drones.",
    "Air delivery of goods by unmanned aircraft systems; drone navigation using unmanned traffic management; FY 2023 appropriations for the Federal Aviation Administration (H.R. 8294 and S. 4670); FAA type certification of drones; FAA reauthorization and reorganization; implementation of the beyond visual line of sight operation aviation rulemaking committee; FAA Part 135 air carrier certification.",
    "Air delivery of goods by unmanned aircraft systems; drone navigation using unmanned traffic management; drone provisions in the FY 2023 appropriations for the Federal Aviation Administration in the Fiscal Year 2023 Consolidated Appropriations Act (Public Law 117-328); FAA type certification of drones; FAA reauthorization and reorganization; implementation of the beyond visual line of sight operation aviation rulemaking committee report; FAA Part 135 air carrier certification.",
    "Air delivery of goods by unmanned aircraft systems; drone navigation using unmanned traffic management (UTM); FY 2025 appropriations for the Federal Aviation Administration; FAA type certification of drones; drone provisions in the H.R. 3935, the Securing Growth and Robust Leadership in American Aviation Act, and S. 1939, the FAA Reauthorization Act of 2023; implementation of the beyond visual line of sight (BVLOS) aviation rulemaking committee (ARC) report; FAA Part 135 air carrier certification; FAA environmental assessments for drone operations; aviation deconfliction issues.",
    "Air delivery of goods by unmanned aircraft systems; drone navigation using unmanned traffic management (UTM); drone provisions in the FY 2025 appropriations for the Federal Aviation Administration (H.R. 9028); FAA type certification of drones; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); implementation of the beyond visual line of sight (BVLOS) aviation rulemaking committee (ARC) report; FAA Part 135 air carrier certification; FAA environmental assessments for drone operations; aviation deconfliction issues.",
    "Air delivery of goods by unmanned aircraft systems; drone navigation and deconfliction using unmanned traffic management (UTM); drone provisions in the FY 2025 appropriations for the Federal Aviation Administration (H.R. 9028 and S. 4796); FAA type certification of drones; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); implementation of the beyond visual line of sight (BVLOS) aviation rulemaking committee (ARC) report; FAA Part 135 air carrier certification; FAA environmental assessments for drone operations.",
    "Air delivery of goods by unmanned aircraft systems; drone identification, navigation and deconfliction using unmanned traffic management (UTM); drone provisions in the FY 2025 appropriations for the Federal Aviation Administration (H.R. 9028 and S. 4796); FAA type certification of drones; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); implementation of the beyond visual line of sight (BVLOS) aviation rulemaking committee (ARC) report; FAA notice of proposed rulemaking on BVLOS operation of drones; FAA environmental assessments for drone operations.",
    "Air delivery of goods by unmanned aircraft systems; drone identification, navigation and deconfliction using unmanned traffic management (UTM); drone provisions in the FY 2026 appropriations for the Federal Aviation Administration; FAA aircraft certification and Section 44807 waivers; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); implementation of the beyond visual line of sight (BVLOS) aviation rulemaking committee (ARC) report; FAA notice of proposed rulemaking on BVLOS operation of drones; FAA environmental assessments for drone operations; carriage of small hazardous material (HAZMAT) items by drones; Commerce Department rulemaking regarding drone national security issues.",
    "Air delivery of goods by unmanned aircraft systems; drone identification, navigation and deconfliction using unmanned traffic management (UTM); drone provisions in the FY 2026 appropriations for the Federal Aviation Administration; FAA aircraft certification and Section 44807 waivers; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); implementation of the beyond visual line of sight (BVLOS) aviation rulemaking committee (ARC) report; FAA notice of proposed rulemaking on BVLOS operation of drones; FAA environmental assessments for drone operations; carriage of small hazardous material (HAZMAT) items by drones; Commerce Department rulemaking regarding drone national security issues; air traffic control modernization.",
    "Air delivery of goods by unmanned aircraft systems; drone identification, navigation and deconfliction using unmanned traffic management (UTM); drone provisions in the FY 2026 appropriations for the Federal Aviation Administration (H.R. 4552; S. 2465); FAA aircraft certification and Section 44807 waivers; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); FAA notice of proposed rulemaking on BVLOS operation of drones; FAA environmental assessments for drone operations; carriage of small hazardous material (HAZMAT) items by drones; Commerce Department rulemaking regarding drone national security issues; air traffic control modernization; aircraft equipage and electronic conspicuity; implementation of the drone industrial base funding from the One Big Beautiful Bill Act (Public Law No: 119-21).",
    "Air delivery of goods by unmanned aircraft systems; drone remote identification; drone navigation and deconfliction using unmanned traffic management (UTM); drone provisions in the FY 2026 appropriations for the Federal Aviation Administration (H.R. 4552; S. 2465); FAA aircraft certification and Section 44807 waivers; implementation of the drone provisions in the FAA Reauthorization Act of 2024 (Public Law No: 118-63); FAA notice of proposed rulemaking on BVLOS operation of drones; FAA environmental assessments for drone operations; carriage of small hazardous material (HAZMAT) items by drones; Commerce Department rulemaking regarding drone national security issues; air traffic control modernization; aircraft equipage and electronic conspicuity; implementation of the drone industrial base funding from the One Big Beautiful Bill Act (Public Law No: 119-21); federal counter drone authorities; FCC Covered List for foreign-made drones and drone critical components."
  ],
  "years": [
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 60,
  "trajectory": "growing",
  "yearsActive": 5,
  "avgAnnualSpending": 308000,
  "peakYear": 2023,
  "lobbyistCount": 16,
  "firmCount": 1,
  "issueCount": 1,
  "industry": "transportation"
}