{"id":182942,"name":"WORKDAY, INC.","slug":"workday-inc","state":"CA","description":"Enterprise Cloud applications for Finance and Human Resources","totalSpending":1290000,"filings":21,"yearlySpending":[{"year":2018,"income":120000},{"year":2019,"income":180000},{"year":2020,"income":240000},{"year":2021,"income":240000},{"year":2022,"income":210000},{"year":2024,"income":280000},{"year":2025,"income":20000}],"firms":["MONUMENT ADVOCACY"],"lobbyists":["JOSEPH HOEFER","ANDREW HOWELL","KATHRYN MILLS","E. ASHLEY HOY","CHAN PARK","ANDERSON HEIMAN","CAROLINE REPPERT","OMID GHAFFARI-TABRIZI","JEFFREY GARY","JULIE DUNNE","CHARLES VERDERY","ANDREW LOCK","TROY STOCK","MICHAEL TANNER","RICH THOMAS"],"issues":["IMM","TRD","CPI","LBR","GOV","HOM"],"sampleDescriptions":["Issues related to DACA","Cross border data flows; Data localization; privacy","Issues related to AI, Big Data, Blockchain, S. 2217, H.R. 4625, The Future of AI Act; H.R. 5356 National Security AI Act; privacy","Issues related to AI, Big Data, Blockchain, S.2217, H.R.4625, The Future of AI Act; H.R.5356 National Security AI Act; privacy; H.R.7002, Blockchain Records and Transactions Act of 2018","Issues related to artificial intelligence; big data analytics; blockchain","Issues related to cross-border data flows; data localization; privacy","Issues related to artificial intelligence; blockchain; privacy","Issues related to workforce development","Issues related to state and local IT modernization funding in COVID-19 legislation","Issues related to artificial intelligence; blockchain; privacy; H.R.8048 - State and Local IT Modernization and Cybersecurity Act and S.1846 - State and Local Government Cybersecurity Act; NDAA: S.1790 and H.R. 6395; H.R. 6216 National Artificial Intelligence Initiative Act; H.Res 1250: Expressing the sense of the House of Representatives with respect to the principles that should guide the national artificial intelligence strategy of the United States","Issues related to immigration","Issues related to state ad local IT modernization funding; cybersecurity","Issues related to cross-border data flows; data localization; privacy; cybersecurity","Issues related to artificial intelligence; blockchain; privacy; cybersecurity; H.R.2013 - Information Transparency & Personal Data Control Act","Issues related to cross-border data flows; data localization; privacy; cybersecurity; digital trade","Issues related to state and local IT modernization funding; cybersecurity","Issues related to workforce development; WIOA","Issues related to artificial intelligence; cybersecurity; privacy; H.R.1816 - Information Transparency & Personal Data Control Act","Issues related to artificial intelligence; cybersecurity; privacy","Issues related to federal, state, and local IT modernization funding, cybersecurity, FedRAMP"],"years":[2018,2019,2020,2021,2022,2024,2025]}