{"id":191976,"name":"YOCHA DEHE WINTUN NATION","slug":"yocha-dehe-wintun-nation","state":"CA","description":"Indian Tribal Government","totalSpending":1375000,"filings":24,"yearlySpending":[{"year":2018,"income":168000},{"year":2019,"income":162000},{"year":2020,"income":120000},{"year":2021,"income":240000},{"year":2022,"income":240000},{"year":2024,"income":195000},{"year":2025,"income":250000}],"firms":["SPIRIT ROCK CONSULTING"],"lobbyists":["AURENE MARTIN","CARL DUNCAN","JENNIFER HEIDE VAN DER","DAMIAN PADILLA"],"issues":["TAX","GAM","LBR","IND","NAT"],"sampleDescriptions":["Monitor tax reform proposals and Extender issues; monitor implementation of the General Welfare Exclusion Act; analyze effects of proposed regulations to change withholding rules for casinos.","Monitor issues affecting tribal gaming; monitor Internet gaming issues; analysis of IRS proposed regulation regarding withholding by casinos; oppose development of off-reservation casino in Vallejo, CA.","Support passage of the Tribal Labor Sovereignty Act, S. 63 and H.R. 986.","General tribal representation, monitor fee to trust policy; advocate for pro-tribal energy policies; monitor and advocate for issues supporting tribal sovereignty; monitor and support pro-tribal tax policies.","Support passage of the Tribal Labor Sovereignty Act.","Monitor issues affecting tribal gaming; monitor Internet gaming issues; analysis of IRS proposed regulation regarding withholding by casinos; oppose development of off-reservation casino in Vallejo, CA","Monitor issues affecting tribal gaming; monitor Internet gaming and sports wagering issues; analysis of IRS proposed regulation regarding withholding by casinos.","General tribal representation, monitor fee to trust policy; advocate for pro-tribal energy policies; monitor and advocate for issues supporting tribal sovereignty; monitor and support pro-tribal tax policies.\n\nAdvocate for tribal government funding in the H.R. 748, the CARES Act.","General tribal representation, monitor fee to trust policy; advocate for pro-tribal energy policies; monitor and advocate for issues supporting tribal sovereignty; monitor and support pro-tribal tax policies.\n\nAdvocate for tribal government funding in the H.R. 748, the CARES Act.\n\nFederal assistance for wildfires in CA","Tribal COVID funding legislation","tribal COVID funding legislation","General Indian issues","Monitor and advocate for client interests on matters pertaining to gaming.","General tribal representation, including monitoring and advocacy on tribal legislation, administrative matters and rulemaking. Pursue co-stewardship agreement with the Bureau of Land Managment.","Monitor and advocate for pro-tribal tax policy and legislation.","Pursue legislative and Administration action to expand the Berryessa Snow Mountain National Monument. Develop co-stewardship agreement with the Bureau of Land Management for lands within and adjacent to the current Berryessa Snow Mountain National Monument.","General tribal representation, including monitoring and advocacy on tribal legislation, administrative matters and rulemaking.","Pursue legislative and Administration action to expand the San Pablo Bay National Wildlife Refuge.","General tribal representation, including monitoring and advocacy on issues affecting tribes.","Monitor and advocate for pro-tribal tax policy."],"years":[2018,2019,2020,2021,2022,2024,2025]}