{"id":202250,"name":"YODLEE INC.","slug":"yodlee-inc","state":"CA","description":"Consumer-permissioned financial aggregation","totalSpending":1720000,"filings":23,"yearlySpending":[{"year":2018,"income":330000},{"year":2019,"income":290000},{"year":2020,"income":140000},{"year":2021,"income":210000},{"year":2022,"income":280000},{"year":2024,"income":130000},{"year":2025,"income":340000}],"firms":["ALLON ADVOCACY, LLC"],"lobbyists":["STEVEN BOMS","REBECCA MULHOLLAND","KATHERINE FLOCKEN"],"issues":["RET","FIN","BAN","TAX","CPI"],"sampleDescriptions":["Fiduciary standards, including the Department of Labor's fiduciary rule.","Consumer-permissioned financial data access issues; alternative data and credit reporting, including S. 2155, the Economic Growth, Regulatory Relief, and Consumer Protection Act.","Consumer-permissioned financial data access; regulation of bank third-parties, including S. 2155, the Economic Growth, Regulatory Relief, and Consumer Protection Act.","Monitoring of implementation of H.R. 1, an Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018.","Consumer-permissioned data access, cyber and data security, including S. 2179, the Data Security and Breach Notification Act","Consumer-permissioned financial data access issues; alternative data and credit reporting, including S. 2155, the Economic Growth, Regulatory Relief, and Consumer Protection Act and Department of Treasury fintech report.","Consumer-permissioned financial data access; regulation of bank third-parties, the Economic Growth, Regulatory Relief, and Consumer Protection Act.","Consumer-permissioned financial data access issues; alternative data and credit reporting, the Economic Growth, Regulatory Relief, and Consumer Protection Act and Department of Treasury fintech report.","Consumer-permissioned financial data access; regulation of bank third-parties, including third-party vendor risk management.","Consumer-permissioned financial data access issues; alternative data and credit reporting; cash-flow underwriting; data privacy","Access to consumer permissioned financial electronic records, third-party bank vendor risk management guidance","Best interest rule proposed by SEC","Data security and privacy issues","Financial data aggregation; Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act; H.R. 6789 in the 115th Congress","Access to consumer permissioned financial electronic records, third-party bank vendor risk management guidance, implementation of Open Banking regime in the United States, including H.R. 6789 (115th Congress)","Best interest rule finalized by SEC","Data security and privacy issues, including potential implementation of a federal data privacy and/or breach notification regime.","Financial data aggregation; Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act; H.R. 6789 in the 115th Congress; OCC third-party vendor risk management FAQs.","Financial data aggregation; Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act; H.R. 4047 in the 116th Congress; OCC third-party vendor risk management FAQs.","Financial data aggregation; Section 1033 of the Dodd-Frank Wall Street Reform and Consumer Protection Act (PL 111-203); H.R. 4047 - Open Banking Study Act of 2019 (116th Congress); OCC third-party vendor risk management FAQs"],"years":[2018,2019,2020,2021,2022,2024,2025]}