{
  "id": 201827,
  "name": "YSLETA DEL SUR PUEBLO TRIBE",
  "slug": "ysleta-del-sur-pueblo-tribe",
  "state": "TX",
  "description": "The Ysleta Del Sur Pueblo Tribe is a Native American Tribe in El Paso, Texas.",
  "totalSpending": 1365000,
  "filings": 28,
  "yearlySpending": [
    {
      "year": 2018,
      "income": 115000
    },
    {
      "year": 2019,
      "income": 200000
    },
    {
      "year": 2020,
      "income": 200000
    },
    {
      "year": 2021,
      "income": 200000
    },
    {
      "year": 2022,
      "income": 200000
    },
    {
      "year": 2023,
      "income": 200000
    },
    {
      "year": 2024,
      "income": 100000
    },
    {
      "year": 2025,
      "income": 150000
    }
  ],
  "firms": [
    "MILNE, WIENER & SHOFE GLOBAL STRATEGIES (FKA M & W GOVERNMENT AFFAIRS, LLC)"
  ],
  "lobbyists": [
    "JOHN MILNE",
    "JEFFREY WIENER",
    "ALLEN SHOFE",
    "CRAIG ROBERTS",
    "CHASE ADAMS",
    "CODY TUCKER"
  ],
  "issues": [
    "GAM",
    "IND",
    "DEF",
    null,
    "FOR"
  ],
  "sampleDescriptions": [
    "HR 4985: The Ysleta del Sur Pueblo and Alabama-Coushatta Tribes of Texas Equal and Fair Opportunity Settlement Act",
    "HR 4985; Ysleta del Sur Pueblo and Alabama-Coushatta Tribes of Texas Equal and Fair Opportunity Settlement Act",
    "Advocating for passage of HR 4985, Ysleta del Sur Pueblo and Alabama-Coushatta Tribes of Texas Equal and Fair Opportunity Settlement Act, in order to authorize gaming for federal tribes in Texas.",
    "Support for HR 759; Ysleta del Sur Pueblo and Alabama-Coushatta Tribes of Texas Equal and Fair Opportunity Settlement Act",
    "Efforts to include, HR 759 The Ysleta del Sur Pueblo and Alabama-Coushatta Tribes of Texas Equal and Fair Opportunity Settlement Act, in the FY21 House National Defense Authorization Act",
    "Advocacy in House for passage of HR 2208 to allow Ysleta Del Sur Pueblo to offer Class II gaming and inclusion of HR 2208 in FY22 National Defense Authorization Act.",
    "Advocacy in House and Senate for passage of HR 2208 to allow Ysleta Del Sur Pueblo to offer Class II gaming.",
    "Advocacy in House and Senate for passage of HR 2208 to allow Ysleta Del Sur Pueblo to offer Class II gaming. Advocacy in House and Senate for passage of HR 4502, Section 119, to allow Ysleta Del Sur Pueblo to offer Class II gaming.",
    "Advocacy in House and Senate for passage of HR 2208 and S. 4196 to allow Ysleta Del Sur Pueblo to offer Class II gaming. Advocacy for inclusion of HR 2208 in the FY23 National Defense Authorization Act and House Interior Appropriations Act in the House.",
    "Advocacy in House and Senate for passage of HR 2208 and S. 4196 to allow Ysleta Del Sur Pueblo to offer Class II gaming. Advocacy for inclusion of HR 2208 in the FY23 National Defense Authorization Act and House Interior Appropriations Act in the House, as well as the FY23 Omnibus Appropriations Act.",
    "Working with Members of Congress to try to bring Tribal items of patrimony back to the United States from Holland.",
    "Support for legislation to enable Ysleta Del Sur Pueblo to operate Class 2 gaming pursuant to the Indian Gaming Regulatory Act, particularly HR 2873 and S.1536.",
    "Legislation to enable Ysleta Del Sur Pueblo to operate Class 2 gaming pursuant to the Indian Gaming Regulatory Act. Working with Members of Congress to try to bring Tribal items of patrimony back to the United States from Holland.",
    "Interaction with Congress, State Department, Department of Interior, and White House to support the repatriation of tribal artifacts from the Kingdom of the Netherlands to Ysleta del Sur Pueblo.",
    "Reintroduction of the Tribal Gaming Regulatory Compliance Act for the 119th Congress -- HR 3723 -- and advocacy for its passage"
  ],
  "years": [
    2018,
    2019,
    2020,
    2021,
    2022,
    2023,
    2024,
    2025
  ],
  "growthRate": 30,
  "trajectory": "stable",
  "yearsActive": 8,
  "avgAnnualSpending": 170625,
  "peakYear": 2019,
  "lobbyistCount": 6,
  "firmCount": 1,
  "issueCount": 4
}