{"id":184874,"name":"ZOCDOC","slug":"zocdoc","state":"NY","description":"Health care technology company","totalSpending":1670000,"filings":25,"yearlySpending":[{"year":2018,"income":270000},{"year":2019,"income":320000},{"year":2020,"income":160000},{"year":2021,"income":100000},{"year":2022,"income":200000},{"year":2024,"income":300000},{"year":2025,"income":320000}],"firms":["INVARIANT LLC"],"lobbyists":["HEATHER PODESTA","BENJAMIN KLEIN","LARISSA MARTINEZ","ANNE PALISI","KATHRYN WISE","JANIE BLANCO","ANNABELL STOKES","CHRISTOPHER GILLOTT","JESSICA HATCHER","EVAN SMITH","MATTHEW FERY","DREW GRIFFIN","KAETLYN FANNING"],"issues":["HCR"],"sampleDescriptions":["Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement, as well as discuss the limitations of the existing federal anti-kickback statute.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement, as well as discuss the limitations of the existing federal anti-kickback statute; educate Members of Congress on technology-based price transparency.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement, as well as discuss the limitations of the existing federal anti-kickback statute; discuss issues related to price transparency.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; highlight use of telehealth to reduce strain of COVID-19 patients on hospitals.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; support making COVID-19 telehealth waivers permanent.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; support making COVID-19 telehealth waivers permanent; discuss initiatives related to health disparities.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; support making COVID-19 telehealth waivers permanent; discuss initiatives related to health disparities; educate policymakers on company's scheduling capabilities.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; discuss issues related to the Anti-Kickback Statute.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; discuss issues related to Anti-Kickback Statute; discuss issues related to information-blocking.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to price transparency; discuss issues related to the Anti-Kickback Statute; discuss issues related to ghost networks; discuss issues related to the health care workforce; encourage support for H.R.7292 / S.3744, the Health ACCESS Act.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to the Anti-Kickback Statute; discuss issues related to ghost networks; discuss issues related to the health care workforce; encourage support for H.R.7292 / S.3744, the Health ACCESS Act.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to the Anti-Kickback Statute; discuss issues related to the health care workforce; encourage support for H.R.7292 / S.3744, the Health ACCESS Act.","Educate Members of Congress about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to the Anti-Kickback Statute; discuss issues related to ghost networks; discuss issues related to the health care workforce; monitor issues related to the VA community care network.","Educate Members of Congress and the Administration about the potential to use technology to improve access to care, reduce wait time, and improve patient engagement; discuss issues related to the Anti-Kickback Statute; discuss issues related to ghost networks; discuss issues related to the health care workforce; monitor issues related to the VA community care network."],"years":[2018,2019,2020,2021,2022,2024,2025]}