{"id":400568701,"name":"DININO ASSOCIATES, LLC","slug":"dinino-associates-llc","totalIncome":2805000,"filings":147,"yearlyIncome":[{"year":2018,"income":350000},{"year":2019,"income":300000},{"year":2020,"income":360000},{"year":2021,"income":310000},{"year":2022,"income":270000},{"year":2023,"income":320000},{"year":2024,"income":455000},{"year":2025,"income":440000}],"clients":["CORNERSTONE GOVERNMENT AFFAIRS OBO BNSF RAILWAY COMPANY","CORNERSTONE GOVERNMENT AFFAIRS OBO NIKE, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO MICROSOFT CORPORATION","CORNERSTONE GOVERNMENT AFFAIRS OBO COMMUNITIES IN SCHOOLS","CORNERSTONE GOVERNMENT AFFAIRS OBO LANKFORD & REED, PLLC","CORNERSTONE GOVERNMENT AFFAIRS OBO LUMEN TECHNOLOGIES","CORNERSTONE GOVERNMENT AFFAIRS OBO ZERO - THE END OF PROSTATE CANCER","CORNERSTONE GOVERNMENT AFFAIRS OBO NEAR AIRPORT INDUSTRY TRADE ASSOCIATION","CORNERSTONE GOVERNMENT AFFAIRS OBO KIRBY CORPORATION","CORNERSTONE GOVERNMENT AFFAIRS OBO NASCAR","CORNERSTONE GOVERNMENT AFFAIRS OBO GLOBAL BUSINESS TRAVEL ASSOCIATION","CORNERSTONE GOVERNMENT AFFAIRS OBO CHILDHELP","CORNERSTONE GOVERNMENT AFFAIRS OBO IDAHO FOREST GROUP, LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO THE NATURAL STONE INSTITUTE","CORNERSTONE GOVERNMENT AFFAIRS OBO SAAB BARRACUDA","CORNERSTONE GOVERNMENT AFFAIRS OBO STUPP BROTHERS, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO TUNICA BILOXI TRIBE OF LOUISIANA","CORNERSTONE GOVERNMENT AFFAIRS OBO SAC & FOX TRIBE OF THE MISSISSIPPI IN IOWA","CORNERSTONE GOVERNMENT AFFAIRS OBO THE CHEROKEE NATION","CORNERSTONE GOVERNMENT AFFAIRS OBO SMARTRONIX","CORNERSTONE GOVERNMENT AFFAIRS OBO PROVIDENCE ST. JOSEPH HEALTH","CORNERSTONE GOVERNMENT AFFAIRS OBO NUTANIX, INC.","CIGAR RIGHTS OF AMERICA","MAXIMUS","CORNERSTONE GOVERNMENT AFFAIRS OBO AMERICAN GAMING ASSOCIATION","SMITH DAWSON & ANDREWS OBO CITY OF DAYTON OH","CORNERSTONE GOVERNMENT AFFAIRS OBO CITY OF DES MOINES","CORNERSTONE GOVERNMENT AFFAIRS OBO HEALTH CARE ALLIANCE FOR PATIENT SAFETY","CORNERSTONE GOVERNMENT AFFAIRS OBO THE COALITION FOR INVESTOR CHOICE","CORNERSTONE GOVERNMENT AFFAIRS OBO HUNT DEVELOPMENT GROUP LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO EAVES LAW FIRM, LLC OBO VIEQUES, PUERTO RICO","CORNERSTONE GOVERNMENT AFFAIRS OBO AMERICAN PHARMACEUTICAL SERVICES, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO OCTASIC INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO HARMONIA HOLDINGS GROUP, LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO INTEGRATED ENERGY MATERIALS LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO ON POINT TECHNOLOGY, LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO BRAINBOX AI US LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO EPIRUS, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO 3 PROTON LITHIUM INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO NATIONAL FEDERATION OF INDEPENDENT BUSINESS","CORNERSTONE GOVERNMENT AFFAIRS OBO THE MICHAEL J. FOX FOUNDATION","CORNERSTONE GOVERNMENT AFFAIRS OBO ADVANCED MATERIALS AND DEVICES, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO LOCUS SOLUTIONS, LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO TATE, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO IRIDIUM SATELLITE LLC","CORNERSTONE GOVERNMENT AFFAIRS OBO NERVGEN PHARMA CORP.","CORNERSTONE GOVERNMENT AFFAIRS OBO VETERANS GUARDIAN","CORNERSTONE GOVERNMENT AFFAIRS OBO CIRCLE INTERNET FINANCIAL, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO HELIOGEN HOLDINGS, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO GARMIN INTERNATIONAL, INC.","CORNERSTONE GOVERNMENT AFFAIRS OBO THE PHOENIX","CORNERSTONE GOVERNMENT AFFAIRS OBO R4 TECHNOLOGIES, INC.","WAVERLY GROUP OBO TROIKA SOLUTIONS","WAVERLY GROUP OBO NORTHWEST HARDWOODS","CORNERSTONE GOVERNMENT AFFAIRS OBO YAYASAN BERBAKTI SEMANGAT INDONESIA","CORNERSTONE GOVERNMENT AFFAIRS OBO NEW MEXICO STATE UNIVERSITY"],"lobbyists":["PAUL DININO","MICHAEL DAVIS","SUSAN SWEAT","ANTHONY LAZARSKI","JOHN LEGGIERI","WILLIAM SMITH"],"issues":["TRA","TAX","TRD","TEC","IMM","EDU","DEF","BUD","AVI","MAR","NAT","AGR","IND","HCR","MMM","CPI","TOB","GAM","URB","ECN","DIS","ENV","ROD","LAW","HOU","BAN","HOM","FIR","CAW","WEL","COM","INT","CSP","LBR","SCI","ENG","GOV","UNM","MED","SPO","RES","FUE","CHM",null,"CPT","FOR","RRR"],"clientCount":56,"years":[2018,2019,2020,2021,2022,2023,2024,2025]}