{"id":62727,"name":"ADAM BORDES","slug":"adam-bordes","revolvingDoor":true,"governmentPositions":["Committee on Oversight and Government Reform; Office of Congressman Louis Stokes; Office of Congressman William Clay, Sr.","Committee on Oversight and Government Reform; Office of Congressman Louis Stokes; Office of Congressman William L. Clay, Sr.","Committee on Oversight and Government Reform; Office of Congressman Louis Stokes, Office of Congressman William L. Clay, Sr.","Committee on Oversight and Government Reform; Office of Congressman Louis Stokes; Office of Congressman William Clay Sr.","Committee on Oversight and Government Reform, Office of Congressman Louis Stokes, Office of Congressman William L. Clay, Sr.","Committee on Oversight and Government Reform, Office of Congressman Louis Stokes, Office of Congressman William L. Clay Sr.","Legislative Correspondent, Office of Cong Louis Stokes (1998) Legislative Assistant, Office of Cong William L. Clay, Sr (1999-2000) Professional Staff Member and Sr Policy Advisor, House Comm on Oversight and Government Reform (2003-2011)","Legislative Correspondent, Office of Louis Stokes (19980; Legislative Assistant, Office of William L. Clay, Sr. (1999-2000); Professional Staff Member and Sr. Policy Advisor, House Comm on Oversight and Government Reform (2003-2011)","Legislative Correspondent, Cong Louis Stokes (1998); Legislative Assistant, Cong William L Clay, Sr (1999-2000); Professional Staff Member and Sr Policy Advisor, House Committee on Oversight and Government Reform (2003-2011)","Professional Staff Member and Sr. Policy Advisor-Committee on Oversight and Government Reform; Legislative Correspondent-Congressman Louis Stokes; Legislative Assistant-Congressman William Clay Sr.","Legislative Correspondent Office of Cong. Louis Stokes (1998), Legislative Assistant, Office of Cong. William L Clay, Sr. (1999-2000), Professional Staff Member and Senior Policy Advisor, House Committee on Oversight and Government Reform (2003-2011)","Legislative Correspondent-Rep Louis Stokes (1998); Legislative Assistant-Rep William L. Clay Sr. (1999-2000); Professional Staff Member and Senior Policy Advisor-House Committee on Oversight and Government Reform (2003-2011)","Legislative Correspondent, Office Louis Stokes 1998; Legislative Assistant, Office of William L. Clay, Sr. 1999-2000; Professional Staff Member and Senior Policy Advisor, House Committee on Oversight & Government Reform 2003-2011","Professional Staff Member and Senior Policy Advisor: Committee on Oversight and Government Reform; Legislative Correspondent: Office of Congressman Louis Stokes; Legislative Assistant: Office of Congressman William L. Clay, Sr."],"totalFilings":202,"yearlyActivity":[{"year":2018,"filings":21,"clients":7,"firms":1,"issues":["HOU","TRA","HOM","FOO","GOV","HCR","PHA","EDU"]},{"year":2019,"filings":37,"clients":10,"firms":1,"issues":["PHA","HCR","EDU","GOV","FOO","AGR","AVI"]},{"year":2020,"filings":26,"clients":9,"firms":1,"issues":["HCR","PHA","FOO","AGR","EDU","AVI"]},{"year":2021,"filings":30,"clients":9,"firms":1,"issues":["HCR","PHA","FOO","EDU","AGR","AVI"]},{"year":2022,"filings":38,"clients":11,"firms":1,"issues":["HCR","PHA","FOO","EDU","AVI","AGR"]},{"year":2023,"filings":28,"clients":8,"firms":1,"issues":[]},{"year":2024,"filings":16,"clients":6,"firms":1,"issues":["EDU","AGR","AVI","HCR","PHA"]},{"year":2025,"filings":6,"clients":6,"firms":1,"issues":["HCR","PHA","EDU","AGR","AVI"]}],"topClients":[{"name":"AMAZON.COM (FRA PILLPACK AN AMAZON COMPANY)","filings":27},{"name":"KELLOGG COMPANY","filings":24},{"name":"GREATER NEW YORK HOSPITAL ASSOCIATION","filings":23},{"name":"HILL EAST GROUP ON BEHALF OF AIRPORTS COUNCIL INTERNATIONAL - NORTH AMERICA","filings":21},{"name":"CORN REFINERS ASSOCIATION","filings":19},{"name":"HUSCH BLACKWELL STRATEGIES ON BEHALF OF THE UNIVERSITY OF HOUSTON","filings":17},{"name":"COALITION FOR STUDENT OPPORTUNITY AND SUCCESS","filings":15},{"name":"BLUESTAR STRATEGIES IN SUPPORT OF SCHOLARLY PUBLISHING & ACADEMIC RESOURCES COAL","filings":12},{"name":"EPIC SYSTEMS","filings":11},{"name":"MESSINA GROUP, INC ON BEHALF OF MONTEFIORE MEDICINE ACADEMIC HEALTH SYSTEM, INC.","filings":10},{"name":"CLEAREDGE PARTNERS, INC.","filings":5},{"name":"LAUNCH EXPEDITIONARY LEARNING CHARTER SCHOOL","filings":5},{"name":"ASSOCIATION OF PROPRIETARY COLLEGES","filings":4},{"name":"NJOY","filings":3},{"name":"INNER STATE","filings":3},{"name":"BROOKS BAWDEN LLC FOR VIGILANT SOLUTIONS INC.","filings":2},{"name":"J. RONALD TERWILLIGER","filings":1}],"firms":[{"name":"CARD & ASSOCIATES, LLC","filings":202}],"issues":["HOU","TRA","HOM","FOO","GOV","HCR","PHA","EDU","AGR","AVI"]}