{"id":48877,"name":"ADAM INGOLS","slug":"adam-ingols","revolvingDoor":true,"governmentPositions":["Chief of Staff, U.S. DOE","Chief of Staff, U.S. DOE; Senior Advisor U.S. DOE; Special Assistant White House; Policy Assistant, Speaker of the House","Chief of Staff, U.S. DOE; Senior Advisor U.S. DOE; Special Assistant White House; Policy Assistant Speaker of the House","Chief of Staff, US DOE","Cheif of Staff, U.S. DOE","DOE Chief of Staff; DOE Senior Advisor; White House Legislative Affairs; Speaker of the House Policy Assistant; Speaker of the House Executive Assistant","DOE Chief of Staff; DOE Senior Advisor; White House Legislative Affairs; Speaker of the House Policy Assistant; Speaker of the House Executive Assistant; DOE Chief of Staff; DOE Senior Advisor; White House Legislative Affairs; Speaker of the House Policy Assistant; Speaker of the House Executive Assistant","Chief of Staff, US DOE; Senior Advisor, US DOE; Special Assistant, White House, Policy Assistant, Speaker of the House of Representatives","Chief of Staff, US DOE; Senior Advisor, US DOE; Legislative Affairs Asst, White House; Policy Assistant Speaker of the House","Chief of Staff, U.S. DOE; Senior Advisor, U.S. DOE; Special Assistant, White House; Policy Assistant, Office of the Speaker","Chief of Staff, US DOE; Senior Advisor, US DOE; Special Assistant, White House; Policy Assistant, Speaker of the US House","Chief of Staff, US Department of Energy; White House Legislative Affairs staff; Office of the Speaker of the House","Chief of Staff, US DOE; Senior Advisor, US DOE; Special Assistant Legislative Affairs, White House; Policy Assistant, Speaker of the House Dennis Hastert","Chief of Staff, U.S. DOE; Special Assistant, White House; Policy Assistant, Speaker of the House Hastert","Chief of Staff, US DOE; Senior Advisor US DOE; Special Assistant White House; Policy Assistant Speaker of the House; Staff Assistant Speaker of the House","Chief of Staff, U.S. DOE; Senior Advisor U.S. DOE; Special Assistant White House; Policy Assistant, Speaker of the House, Staff Assistant, Speaker of the House","Dept. of Energy Chief of Staff; Dept. of Energy Senior Advisor; White House Legislative Affairs; Speaker of the House Policy Assistant; Speaker of the House Executive Assistant","Chief of Staff, U.S. Department of Energy","Chief of Staff, U.S. Department of Energy (DOE); Senior Advisor, US DOE; Special Assistant Legislative Affairs, White House; Policy Assistant, Speaker of the House Dennis Hastert","Chief of Staff, U.S. DOE; Senior Advisor, U.S. DOE; Special Assistant, White House Office of Legislative Affairs, Policy Assistant, Speaker of the House Dennis Hastert, Staff Assistant, Speaker of the House Dennis Hastert","Chief of Staff, U.S. DOE; Senior Advisor, U.S. DOE; Special Assistant, White House Office of Legislative Affairs; Policy Assistant, Speaker of the House Dennis Hastert; Staff Assistant, Speaker of the House Dennis Hastert","Chief of Staff, US Department of Energy; Senior Advisor, US Department of Energy; Special Assistant, White House Office of Legislative Affairs; Policy Assistant, Speaker of the House Hastert","Chief of Staff, U.S. DOE; Senior Advisor U.S. DOE; Special Assistant, White House Office of Legislative Affairs; Policy Assistant, Speaker of the House; Executive Assistant, Speaker of the House","Chief of Staff (U.S. DOE); Senior Advisor (U.S. DOE); Legislative Affairs (White House); Policy Assistant (Speaker of the House); Staff Assistant (Speaker of the House)","Chief of Staff, US Department of Energy; Senior Advisor, US Department of Energy; Special Assistant to the Assistant to the President, White House Office of Legislative Affairs; Policy Assistant, Office of the Speaker of the House Dennis Hastert","Chief of Staff, US Department of Energy; Senior Advisor, US Department of Energy; Special Assistant to the Assistant to the President for Legislative Affairs, White House; Policy Assistant, Speaker of the House J. Dennis Hastert","Chief of Staff, US Department of Energy; Senior Advisor, US Department of Energy; Special Assistant to the Assistant to the President for Legislative Affairs, White House; Policy Assistant, Office of the Speaker of the House J. Dennis Hastert","Chief of Staff, U.S. Department of Energy; Senior Advisor, U.S. Department of Energy; Special Assistant to the Assistant to the President of Legislative Affairs, the White House; Policy Assistant, Speaker of the House Hastert","Chief of Staff US DOE, Senior Advisor US DOE, Special Assistant White House Legislative Affairs, Policy Assistant Speaker of the House Hastert","Chief of Staff, U.S. DOE; Senior Advisor U.S. DOE; Special Assistant to the Assistant to the President for Legislative Affairs, White House; Policy Assistant, Office of the Speaker of the House; Executive Assistant, Office of the Speaker of the House","Chief of Staff, US DOE; Senior Advisor, US DOE; Legislative Affairs Assistant, White House; Policy Assistant, Office of the Speaker of the House Hastert; Executive Assistant, Office of the Speaker of the House Hastert","U.S. DOE Chief of Staff; U.S. DOE Senior Advisor; White House Legislative Affairs; Office of the Speaker of the House Dennis Hastert"],"totalFilings":506,"yearlyActivity":[{"year":2018,"filings":39,"clients":11,"firms":1,"issues":["UTI","MAR","ENG","FUE","GOV"]},{"year":2019,"filings":83,"clients":11,"firms":1,"issues":["UTI","TAX","ENV","ENG","MAR","CAW","TRA","FUE","TRD","TEC","DIS"]},{"year":2020,"filings":65,"clients":12,"firms":1,"issues":["TEC","BUD","UTI","ENG","DIS","TAX","MAR","FUE","NAT"]},{"year":2021,"filings":62,"clients":15,"firms":1,"issues":["ENG","FUE","UTI","MAR","NAT","BUD","MAN","ECN","DEF","TAX","ENV"]},{"year":2022,"filings":77,"clients":18,"firms":1,"issues":["NAT","TAX","ENG","DEF","FUE","MAN","UTI","MAR"]},{"year":2023,"filings":64,"clients":15,"firms":1,"issues":[]},{"year":2024,"filings":55,"clients":14,"firms":1,"issues":["ENG","UTI","DEF","MAR","FUE","TAX"]},{"year":2025,"filings":61,"clients":15,"firms":1,"issues":["ENG","TAX","FUE","UTI","DEF","MAR"]}],"topClients":[{"name":"ENTERGY SERVICES LLC","filings":72},{"name":"ENBRIDGE (U.S.) INC. (FORMERLY SPECTRA ENERGY)","filings":42},{"name":"NUCLEAR ENERGY INSTITUTE","filings":37},{"name":"VALERO ENERGY","filings":37},{"name":"ENERGY TRANSFER PARTNERS","filings":35},{"name":"ISO NEW ENGLAND","filings":35},{"name":"EDISON CHOUEST OFFSHORE","filings":32},{"name":"NEXTERA ENERGY INC","filings":30},{"name":"BECHTEL NATIONAL, INC.","filings":30},{"name":"MP MATERIALS","filings":25},{"name":"CITY OF SAN FRANCISCO (WATER AND POWER DIVISION)","filings":23},{"name":"ORSTED NORTH AMERICA, INC.","filings":23},{"name":"BIA-ENERGY OPERATING COMPANY LLC","filings":15},{"name":"S&B FAMILY OF COMPANIES","filings":12},{"name":"BUSINESS ROUNDTABLE","filings":11},{"name":"ULTRA SAFE NUCLEAR CORPORATION","filings":8},{"name":"ORANO USA LLC","filings":7},{"name":"TALEN ENERGY","filings":7},{"name":"X-ENERGY, LLC","filings":4},{"name":"FEDERATION OF ELECTRIC POWER COMPANIES OF JAPAN","filings":4},{"name":"WESTERMAN, INC.","filings":3},{"name":"COX AUTOMOTIVE, INC.","filings":3},{"name":"INDEPENDENCE HYDROGEN","filings":3},{"name":"JAPAN NUCLEAR FUEL LIMITED","filings":2},{"name":"AT&T SERVICES, INC.","filings":2},{"name":"T-MOBILE","filings":2},{"name":"BATTELLE MEMORIAL INSTITUTE","filings":1},{"name":"CONSORTIUM MANAGEMENT GROUP","filings":1}],"firms":[{"name":"OWEN EVANS INGOLS","filings":506}],"issues":["UTI","MAR","ENG","FUE","GOV","TAX","ENV","CAW","TRA","TRD","TEC","DIS","BUD","NAT","MAN","ECN","DEF"]}