{"id":86565,"name":"ADAM BRAMWELL","slug":"adam-bramwell","revolvingDoor":true,"governmentPositions":["Chief of Staff and General Counsel for Senator Chris Coons; General Counsel to the Secretary of the Senate; Counsel to the Senate Select Committee on Ethics","Chief of Staff and General Counsel for Senator Chris Coons; General Counsel for the Secretary of the Senate; Counsel for the Senate Select Committee on Ethics","Chief of Staff and General Counsel for Senator Chris Coons; General Counsel to the Secretary of the Senate; Counsel to the Senate Select Committee on Ethis","Chief of Staff and General Counsel to Senator Chris Coons; General Counsel to the Secretary of the Senate; Counsel to the Senate Select Committee on Ethics","Chief of Staff and General Counsel to Senator Chris Coons; General Counsel for the Secretary of the Senate; Counsel to the Senate Select Committee on Ethics","Chief of Staff and General Counsel to Senator Christopher Coons; General Counsel to the Secretary of the U.S. Senate; Counsel to the Senate Select Committee on Ethics","Chief of Staff for Senator Christopher Coons; General Counsel to the Secretary of the Senate; Counsel to the Senate Select Committee on Ethics","Chief of Staff to Senator of Chris Coons; General Counsel to the Secretary of the Senate; Counsel to the Senate Select Committee on Ethics","Chief of Staff to Senator Chris Coons; General Counsel to the Secretary of the Senate; Counsel to the Senate Select Committee on Ethics"],"totalFilings":90,"yearlyActivity":[{"year":2020,"filings":19,"clients":3,"firms":1,"issues":["MAN","HCR","TRA","MMM","VET","ADV","DEF","ACC","EDU","BUD"]},{"year":2021,"filings":52,"clients":5,"firms":1,"issues":["TAX","ENV","ENG","REL","EDU","BUD","DEF","VET","MAN","HCR","FOR"]},{"year":2022,"filings":19,"clients":4,"firms":1,"issues":["HCR","ENG","ENV","TAX","BAN","EDU","BUD","DEF","VET"]}],"topClients":[{"name":"MERCURY PUBLIC AFFAIRS, LLC OBO APEI (FKA AMERICAN PUBLIC UNIVERSITY SYSTEM)","filings":33},{"name":"MERCURY PUBLIC AFFAIRS LLC ON BEHALF OF DENBURY INC.","filings":21},{"name":"OLDAKER & WILLISON LLP ON BEHALF OF U.S. MEDICAL NONWOVENS CO.","filings":10},{"name":"MANAGEMENT SCIENCES FOR HEALTH","filings":9},{"name":"MERCURY PUBLIC AFFAIRS LLC ON BEHALF OF GLOBAL MEDICAL RESPONSE","filings":6},{"name":"NMAR, INC.","filings":6},{"name":"ALLIANCE FOR LONGEVITY INITIATIVES","filings":3},{"name":"AMERICANS FOR FINANCIAL REFORM","filings":2}],"firms":[{"name":"COHEN & GRESSER LLP","filings":90}],"issues":["MAN","HCR","TRA","MMM","VET","ADV","DEF","ACC","EDU","BUD","TAX","ENV","ENG","REL","FOR","BAN"]}