{"name":"ALEXANDER LURIE","slug":"alexander-lurie","positions":["Dept. Staff Director, Senate Budget Committee; COS- Senator Frank Lautenberg, Senator Debbie Stabenow","Deputy Staff Director-Senate Budget Committee; Chief of Staff-Senator Frank Lautenberg and Senator Debbie Stabenow","Dept. Staff Director, Senate Budget Committee; Chief of Staff, Senator Frank Lautenberg and Senator Debbie Stabenow","Dept. Staff Director, Senate Budget Committee; COS, Senator Frank Lautenberg; COS, Senator Debbie Stabenow","Deputy Staff Director, Senate Budget Committee; Chief of Staff, Senator Frank Lautenberg and Senator Debbie Stabenow","​Deputy Staff Director, Senate Budget Committee; Chief of Staff, Senator Frank Lautenberg and Senator Debbie Stabenow","Deputy Staff Director Senate Budget Committee; Chief of Staff, Senator Frank Lautenberg and Senator Debbie Stabanow;","Deputy Staff Director, Senate Budget Committee; COS to Senators Lautenberg and Stabenow;","Deputy Staff Director, Senate Budget Committee; Chief of Staff, Senator Frank Lautenberg and Senator Debbie Stavenow","Deputy Staff Director, Senate Budget Committee;; Chief of Staff, Senator Frank Lautenberg and Senator Debbie Stabanow","Deputy Staff Director, Senate Budget Committee;  COS to Senators Lautenberg and Stabenow;","Deputy Staff Director, Senate Budget Committee, COS to Senators Lautenberg and Stabenow","Deputy Staff Director, Senate Budget Committee;   Chief of Staff to Senators Frank Lautenberg and Debbie Stabanow;","Deputy Staff Director, Senate Budget Committee; Chief of Staff to Senators Lautenberg and Stabenow"],"firms":["DENTONS US LLP"],"clients":["IFB SOLUTIONS","UCARE","AMERICAN OSTEOPATHIC ASSOCIATION","AUTO CARE ASSOCIATION","CREDIT UNION NATIONAL ASSOCIATION","INNOVA ECO BUILDING SYSTEM","FORT SILL APACHE","GRAND TRAVERSE BAND OF OTTAWA & CHIPPEWA INDIANS","BARRON COLLIER COMPANIES","GENTING AMERICAS, INC.","TOHONO O'ODHAM NATION","ALCOA CORPORATION","COUNCIL FOR RESPONSIBLE NUTRITION","MASHPEE WAMPANOAG TRIBE","COALITION TO ADVANCE MEDICAL RESIDENT TRAINING IN COMMUNITY HOSPITALS","ADAMS COUNTY, COLORADO","DEOLEO, S.A.","MIB GROUP, INC.","ALTHEADX","DRL ENTERPRISES, INC.","AARON'S INC.","KING RANCH, INC.","THE MOHEGAN TRIBE","PEARL HARBOR AVIATION MUSEUM","LG CHEM MICHIGAN, INC.","NATIONAL VOTE AT HOME COALITION","SMALL UAV COALITION","ILC DOVER","KUAKINI HEALTH SYSTEM","HOLOCAUST MEMORIAL CENTER","AMERISOURCEBERGEN","CANADIAN NATIONAL RAILWAY COMPANY","BUCKHEAD BUSINESS IMPROVEMENT DISTRICT","CITY OF INDIANAPOLIS","MIDTOWN CONNECTOR PROJECT FOUNDATION, INC.","MICHIGAN POTASH AND SALT COMPANY","THE GUIDRY GROUP","COWLITZ INDIAN TRIBE"],"filings":272,"issues":[]}