{"name":"ALI FULLING","slug":"ali-fulling","positions":["Committee Clerk, House Committee on Energy and Commerce, Staff Assistant, Rep. Fred Upton","Clerk, House Energy and Commerce Committee; Assistant, Rep. Fred Upton","Clerk, House Energy and Commerce Committee; Staff Assistant, Rep. Fred Upton","Clerk, House Committee on Energy and Commerce; Staff Assistant, Rep. Fred Upton","Clerk, Committee on Energy and Commerce; Staff Assistant, Rep. Fred Upton","Clerk, House Energy and Commerce Committee, Staff Assistant, Rep. Fred Upton","Clerk, House Committee on Energy and Commerce, Staff Assistant, Rep. Fred Upton","Clerk, House Committee on Energy and Commerce; Staff Asst., Rep. Fred Upton","Clerk, House Committee on Energy and Commerce, Staff Asst., Rep. Fred Upton","Committee clerk, House Committee on Energy and Commerce; Staff Assistant, Rep. Fred Upton","Clerk, House Committee on Energy and Commerce, Staff Assistant, Rep Fred Upton","Majority Clerk, House Energy and Commerce Committee; Staff Assistant, Rep. Fred Upton","House Energy and Commerce Committee, Clerk; Rep. Fred Upton, Staff Assistant","Clerk, House Committee on Energy and Commerce; Staff Asst, Rep. Fred Upton"],"firms":["TWINLOGIC STRATEGIES, LLP"],"clients":["AMERICAN COALITION FOR PUBLIC RADIO","INTERNATIONAL ASSOCIATION OF VENUE MANAGERS","CROWN CASTLE","CONSUMER TECHNOLOGY ASSOCIATION (PREVIOUSLY THE CONSUMER ELECTRONICS ASSOCIATION","PANDORA MEDIA LLC","THE INTERNET INFRASTRUCTURE COALITION (I2COALITION)","HUMETRIX","X CORP. (FORMERLY TWITTER, INC.)","ZEBRA TECHNOLOGIES","CAROLINA WEST WIRELESS","MUSIC.INNOVATION.CONSUMERS COALITION \"MIC\"","LUTRON ELECTRONICS CO., INC.","SHEPPARD, MULLIN, RICHTER & HAMPTON LLP ON BEHALF OF REYNOLDS & REYNOLDS","LINKEDIN","T-MOBILE USA, INC.","REACH - A DBA OF I-BELONG, INC.","SHEPPARD, MULLIN, RICHTER & HAMPTON LLP ON BEHALF OF NIAGARA BOTTLING, LLC","WINN STRATEGIES ON BEHALF OF THE PEW CHARITABLE TRUSTS","SCIENCE APPLICATIONS INTERNATIONAL CORPORATION","REYNOLDS AND REYNOLDS"],"filings":317,"issues":[]}