{"name":"ANNE GAYMAN","slug":"anne-gayman","positions":["Legislative Director for Senator Lisa Murkowski","Legislative Director for Sen. Lisa Murkowski (Began lobbying in Senate on February 20th 2024)","Legislative Director for Senator Lisa Murkowski (Began lobbying in Senate on February 20th 2024)","Legislative Director to Sen. Lisa Murkowski (lobbied Senate starting on February 20, 2024)","Legislative Director for Sen. Lisa Murkowski (lobbied Senate starting on February 20, 2024)","Legislative Director for Sen. Lisa Murkowski (lobbied Senate after February 20, 2024","Legislative Director for Senator Lisa Murkowski (lobbied Senate after February 20, 2024)","Legislative Director, Office of Sen. Lisa Murkowski (Lobbied Senate starting February 20, 2024)","Legislative Director, office of Sen. Lisa Murkowski (lobbied Senate starting on Feb 20, 2024)","Legislative Director for Senator Lisa Murkowski (Lobbied Senate starting February 20, 2024)","Legislative Director for Senator Lisa Murkowski (Lobbied SENATE STARTING ON FEB 20, 2024)","Legislative Director for Sen. Lisa Murkowski (lobbied Senate starting on Feb 20, 2024)","Legislative Director for Senator Lisa Murkowski (lobbied Senate starting on Feb 20, 2024)","Legislative Director for Sen. Lisa Murkowski (lobbied Senate starting on feb 20, 2024)","Legislative Director for Sen. Lisa Murkowski (lobbied Senate starting February 20, 2024)","Legislative Director for Senator Lisa Murkowski (Lobbied Senate after February 20, 2024)","Legislative Director for Senator Lisa Murkowski (began lobbying Senate after February 20, 2024)","Legislative Director for Sen. Lisa Murkowski","Legislative Director to Sen. Lisa Murkowski","Legislative Director, Office of Sen. Lisa Murkowski","Legislative Director, office of Sen. Lisa Murkowski","Legislative Director for Senator Lisa Murkowski; Senior Professional Staff Member, U.S. Senate Committee on Energy & Natural Resources","Legislative Director for Senator Lisa Murkowski; Senior Professional Staff Member, U.S. Senate Committee on Energy & Natural"],"firms":["LOT SIXTEEN LLC"],"clients":["THE ALUMINUM ASSOCIATION","AMBLER METALS LLC","CRUSOE ENERGY","NATIONAL MINING ASSOCIATION","BALL CORPORATION","PINE GATE RENEWABLES, LLC","MICROSOFT CORPORATION","ZERO EMISSION TRANSPORTATION ASSOCIATION (ZETA)","NATIONAL OCEAN INDUSTRIES ASSOCIATION","ADVANCED ENERGY UNITED (FKA ADVANCED ENERGY ECONOMY)","NATIONAL WOODEN PALLET AND CONTAINER ASSOCIATION","BPC ACTION (BIPARTISAN POLICY CENTER)","ENGIE NORTH AMERICA, INC.","SOLIDUS RESOURCES, LLC","ALASKA ENERGY METALS CORPORATION","CENTERLINE ACTION, INC.","INTERNET WORKS ASSOCIATION","GOLDEN ALUMINUM","ANTLER OPERATIONS, INC.","NORTH STAR MANGANESE, INC.","GREENBLU, INC., D/B/A TIDAL METALS","DELAMAR MINING COMPANY","REAL ALLOY HOLDING, LLC","EXCELSIOR ENERGY CAPITAL LP"],"filings":253,"issues":[]}