{"name":"ASHLEE JOHNSON","slug":"ashlee-johnson","positions":["Staff Assistant, Rep. Mike Ross; Executive Assistant, Senate Committee on Agriculture, Nutrition, and Forestry; Legislative Analyst, White House Liaison, Chief of Staff to Deputy Secretary, USDA; Policy Assistant, White House Domestic Policy Council","Staff Assistant, Rep. Mike Ross; Executive Assistant, Senate Committee on Agriculture, Nutrition, and Forestry; Legislative Analyst, White House Liaison, Chief of Staff to Deputy Secretary, USDA; Policy Assistant, Domestic Policy Council","Staff Assistant, Rep. Mike Ross; Executive Assistant, Senate Committeeon Agriculture, Nutrition, and Forestry; Legislative Analyst, White HouseLiaison, Chief of Staff to Deputy Secretary, USDA; Policy Assistant,Domestic Policy Council","Staff Assistant, Rep. Mike Ross; Executive Assistant, Senate Committee on Agriculture, Nutrition, and Forestry; Legislative Analyst, White House Liaison, Chief of Staff to Deputy Secretary, USDA; Policy Analyst, Domestic Policy Council","Staff Assistant, Rep. Mike Ross; Executive assistant, Senate Committee on Agriculture, Nutrition, and Forestry; Legislative Analyst, White House Liaison, Chief of Staff to Deputy Secretary, USDA; Policy Assistant, Domestic Policy Council"],"firms":["THE RUSSELL GROUP, INC."],"clients":["WHOLESTONE PRESTAGE LLC (FORMERLY KNOW AS WHOLESTONE FARMS)","GROWTH ENERGY","TONNIES LEBENSMITTEL GMBH & CO. KG","THE GOOD FOOD INSTITUTE, INC.","CALIFORNIA RICE COMMISSION","CARGILL INC","INDIGO AGRICULTURE, INC.","MCCAIN FOODS USA, INC.","MUSKET CORPORATION","NATIONAL MILK PRODUCERS FEDERATION","PEPSICO","SABRA DIPPING COMPANY, LLC","SAS INSTITUTE, INC.","KRAFT HEINZ COMPANY","BAYER CORPORATION","ALLTECH, INC.","FOOD AND AGRICULTURE CLIMATE ALLIANCE","PERFECT DAY INC","NEW AGE MEATS","CME GROUP, INC.","CARBON AUTONOMOUS ROBOTICS SYSTEMS","ZOETIS","NUTRIEN US LLC (FORMERLY KNOWN AS AGRIUM U.S. INC.) (A NUTRIEN LTD SUBSIDIARY)","CENTRAL VALLEY SALINITY COALITION, INC.","COMPEER FINANCIAL","LAND O'LAKES INC","UPL NA, INC.","FOOD SOLUTIONS ACTION","ALTRIA CLIENT SERVICES LLC","NATIONAL GRAIN AND FEED ASSOCIATION","UNITED NATURAL FOODS, INC.","CSC SUGAR, LLC","NEOGEN CORPORATION","GOLD STAR FOODS"],"filings":320,"issues":[]}