{"id":57524,"name":"CHANI WIGGINS","slug":"chani-wiggins","revolvingDoor":true,"governmentPositions":["Asst Secretary for DHS Legislative Affairs, LD for Senators McCaskill, Dayton and Rep. Stupak, Senior Legislative Assistant for Senator Harkin, Senate HELP Committee professional staff","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators Claire McCaskill, Mark Dayton; Legislative & Communications Director for Rep. Bart Stupak; Legislative Asst for Senator Tom Harkin; HELP Committee professional staff","Asst Secretary for DHS Legislative Affairs; Legislative director - Sen. McCaskill, Sen. Dayton, Rep. Stupak; Legislative Asst - Sen. Harkin","Asst Secretary for DHS Legislative Affairs; Legislative Director - Sen. McCaskill, Sen. Dayton, Rep. Stupak; Legislative Asst - Sen. Harkin","Asst Secretary for DHS Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Bart Stupak; Senior Legislative Asst for Senator Harkin; Senate HELP Committee professional staff","DHS Asst Secretary for Legislative Affairs; Legislative Director - Sens. McCaskill, Dayton, and Rep. Stupak; Sr. Legislative Asst for Sen. Harkin.","Assistant Secretary for DHS Legislative Affairs; Senator McCaskill Legislative Director, Senator Dayton Legislative Director, Rep. Stupak LD, Sen. Harkin senior LA and HELP Committee professional staff.","DHS Assistant Secretary for Legislative Affairs; Legislative Director - Sen. McCaskill; Deputy Chief of Staff - Sen. Dayton; Legislative and Communications Director - Rep. Stupak; Legislative Assistant - Sen. Harkin","Assistant Secretary DHS Legislative Affairs; Legislative Director: Sen. Claire McCaskill, Sen. Mark Dayton, Rep, Bart Stupak; Legislative Asst Sen. Harkin; HELP Committee professional staff","Asst Secretary for DHS Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Sr Legislative Asst for Senator Harkin, Senate HELP Committee professional staff","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill,Dayton; Legislative Director for Rep. Stupak; Legislative Assistant for Senator Harkin/HELP Committee","DHS Asst Secretary for Legislative Affairs; LD for Sens. McCaskill, Dayton; LD and CD for Rep, Stupak; Legislative Asst for Sen. Harkin; HELP Committee professional staff","DHS Asst Secretary for Legislative Affairs; Leg Dir for Sens. McCaskill, Dayton; LD and Comms Dir for Rep. Stupak; Leg. Asst for Sen. Harkkin; HELP Committee professional staff.","Assistant Secretary for DHS Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Senior Legislative Assistant for Senator Harkin; HELP Committee Professional Staff","Asst Secretary of DHS Legislative Affairs; Leg Director - Sen. McCaskill, Sen. Dayon, Rep. Stupak; Leg Asst Sen Harkin.","Asst Secretary for DHS Legislative Affairs, Legislative Dir for Senators McCaskill, Dayton and Rep. Stupak; Sr Legislative Asst for Senator Harkin; Senate HELP Committee Professional Staff","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill and Dayton; Legislative and Communications Director for Rep. Stupak; Legislative Assistant for Senator Harkin/HELP Committee","DHS Assistant Secretary of Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Assistant Senator Harkin; HELP Committee professional staff","DHS Asst Secretary for Legislative Affairs; Senate Legislative Director for Senators McCaskill, Dayton and REp. Stupak; Legislative Asst for Senator Harkin; HELP Committee professional staff","DHS Asst Secretary for Legislative Affairs; LD for Senators McCaskill, Dayton; LD and Communications Director for Rep. Stupak; LA for Senator Harkin.","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators Claire McCaskill, Mark Dayton and Rep. Bart Stupak; Legislative Assistant for Senator Tom Harkin","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Assistant for Sen. Harkin; HELP Committee staff","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Assistant for Sen. Harkin; HELP Committee professional staff","DHS Assistant Secretary of Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Assistant for Senator Harkin; HELP Committee Professional Staff","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Assistant for Senator Harkin ; HELP Committee professional staff","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton & Rep. Stupak; Legislative Asst for Senator Harkin; Professional Staff for HELP Committee","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Assistant for Sen. Harkin; HELP Committee professional staff.","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators Claire McCaskill, Mark Dayton and Rep. Bart Stupak; Legislative Assistant for Senator Tom Harkin; Professional Staff for the HELP Committee","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Bart Stupak; Legislative Assistant for Senator Harkin; HELP Committee Professional Staff","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Asst for Senator Harkin; HELP Committee Professional Staff","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; Legislative Asst for Sen. Harkin; Professional Staff HELP Committee","DHS A/S Legislative Affairs; LD for Senators McCaskill, Dayton and Rep. Stupak; LA for Sen. Tom Harkin; HELP Committee professional staff.","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Congressman Stupak; Legislative Asst for Senator Harkin; HELP Committee professional staff.","DHS Asst Secretary for Legislative Affairs, LD for Senators McCaskill, Dayton and Rep. Bart Stupak; Legislative Assistant for Senator Harkin; HELP Committee Professional Staff","DHS A/S for Legislative Affairs; LD for Senators McCaskill, Dayton and Rep. Stupak; Legislative Asst for Senator Harking; HELP Committee Professional Staff","DHS A/S for Legislative Affairs; LD for Sen. McCaskill, Sen. Dayton and Rep. Stupak; LA for Sen. Harking; HELP Committee Professional Staff","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep. Stupak; HELP Committee Professional Staff; Legislative Assistant for Sen. Harkin;","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators Claire McCaskill, Mark Dayton and Rep. Bart Stupak; Professional Staff HELP Committee, Legislative Assistant for Sen. Tom Harkin.","DHS Assistant Secretary for Legislative Affairs; Legislative Director for Senators Claire McCaskill, Mark Dayton and Rep. Bart Stupak; HELP Committee Professional Staff; Legislative Assistant for Sen. Tom Harkin","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton and Rep, Bart Stupak; HELP Committee professional staff; Legislative Assistant for Senator Harkin.","DHS Asst Secretary for Legislative Affairs; LD for Senators McCaskill, Dayton and Rep. Stupak; Professional Staff HELP Committee; LA for Senator Harkin.","DHS Asst Secretary for Legislative Affairs; Legislative Director for Senators McCaskill, Dayton, and Rep. Stupak; Professional Staff, HELP Committee; Legislative Assistant for Sen. Harkin","DHS Asst Secretary for Legislative Affairs; LD for Senators McCaskill, Dayton and Rep. Stupak; Senate HELP Committee Staff, Legislative Asst for Sen. Harkin.","DHS Legislative Affairs Assistant Secretary; Legislative Director for Senators Claire McCaskill, Mark Dayton and Rep. Bart Stupak; Legislative Assistant for Senator Tom Harkin.","DHS Legislative Affairs A/S; Legislative Director for Sens. McCaskill, Dayton and Rep. Stupak; Legislative Assistant for Senator Harking; Senate HELP Committee Staff.","DHS A/S for Legislative Affairs, LD for Senators Claire McCaskill, Mark Dayton and former Rep. Bart Stupak; HELP Committee staff; Legislative Assistant for Senator Tom Harkin","DHS A/S for Legislative Affairs; LD for Senators McCaskill, Dayton and Rep. Stupak; HELP Committee staff; LA for Senator Tom Harkin","DHS A/S Legislative Affairs, LD for Sens. McCaskill, Dayton and Rep. Stupak; HELP Committee; LA for Sen. Harkin","A/S DHS Leg Affairs; LD for Sens McCaskill, Dayton & Rep. Stupak; HELP Committee, LA for Sen. Tom Harkin.","DHS A/S Leg Affairs; LD for Sens McCaskill, Dayton, & Rep. Stupak; HELP Committee staff; LA for Sen. Harkin"],"totalFilings":1212,"yearlyActivity":[{"year":2018,"filings":238,"clients":13,"firms":1,"issues":["INS","HOM","TRD","MAN","TAX","TEC","ENG","IMM","CPT","AVI","HCR","INT","CPI","LBR","ADV","CSP","TRA","SCI","COM","LAW","BUD","VET","EDU","POS"]},{"year":2019,"filings":177,"clients":11,"firms":1,"issues":["INT","ADV","CPT","CSP","IMM","INS","HOM","TEC","LBR","SCI","TRD","CPI","MAN","ENG","HCR"]},{"year":2020,"filings":198,"clients":14,"firms":1,"issues":["INS","HOM","TEC","CSP","LBR","CPI","TRD","IMM","SCI","INT","CPT","HCR","ENG","MAN","ADV","DIS","BUD","SMB","ART","COM","GOV"]},{"year":2021,"filings":102,"clients":13,"firms":1,"issues":["ART","SMB","TEC","CSP","GOV","LBR","ENV","ENG","INS","HOM","CPT","TRD","CPI","INT","DIS","BUD","SCI","HCR","ADV","IMM","MAN","TAX"]},{"year":2022,"filings":178,"clients":14,"firms":1,"issues":["HOM","INS","TEC","CPT","INT","TRD","CPI","CSP","SCI","HCR","BUD","DIS","LBR","ADV","IMM","MAN","ENG","SMB","ART","TAX","GOV","ENV","DEF"]},{"year":2023,"filings":145,"clients":12,"firms":1,"issues":[]},{"year":2024,"filings":99,"clients":11,"firms":1,"issues":["HOM","TEC","CPT","INT","TRD","CPI","MAN","ENG","SMB","ART","CSP","LBR","ENV","AGR"]},{"year":2025,"filings":75,"clients":9,"firms":1,"issues":["TRD","ENG","TAX","TEC","CPT","INT","CPI","ART","CSP","LBR","GOV","AGR","ENV","AVI"]}],"topClients":[{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF ZEBRA TECHNOLOGIES","filings":178},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF THE INTERNET INFRASTRUCTURE COALITION","filings":149},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF LUTRON ELECTRONICS CO., INC.","filings":138},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF THE CONSUMER TECHNOLOGY ASSOCIATION","filings":103},{"name":"TWIN LOGIC ON BEHALF OF PANDORA MEDIA INC","filings":85},{"name":"TWINLOGIC STRATEGIES LLP ON BEHALFOF INTERNATIONAL ASSOCIATION OF VENUE MANAGERS","filings":64},{"name":"PEW CHARITABLE TRUSTS","filings":55},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF SPRINT","filings":51},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF SIIA","filings":45},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF T-MOBILE USA, INC","filings":44},{"name":"TWIN LOGIC ON BEHALF OF COMPETITIVE CARRIERS ASSOCIATION","filings":40},{"name":"PARTNERSHIP PROJECT ACTION FUND","filings":40},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF OATH INC &VARIOUS SUBSIDIARIES FKA YAHOO! INC","filings":36},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF INTEL CORPORATION","filings":29},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF NOKIA OF AMERICA CORPORATION","filings":28},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF TWITTER, INC","filings":25},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF SCIENCE APPLICATIONS INTERNATIONAL CORPORATION","filings":24},{"name":"TWINLOGIC STRATEGIES LLP ON BEHALF OF CROWN CASTLE","filings":20},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF CAROLINA WEST WIRELESS","filings":19},{"name":"THE CLIMATE REALITY PROJECT","filings":15},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF DELL USA LP","filings":8},{"name":"TWINLOGIC STRATEGIES ON BEHALF OF THE AMERICAN COALITION FOR PUBLIC RADIO","filings":7},{"name":"TWIN LOGIC STRATEGIES ON BEHALF OF PORTER AND KORVICK P.A.","filings":6},{"name":"TWINLOGIC STRATEGIES OBO SHEPPARD,MULLIN,RICHTER&MULLIN OBO NIAGARA BOTTLING,LLC","filings":3}],"firms":[{"name":"WINN STRATEGIES, LLC","filings":1212}],"issues":["INS","HOM","TRD","MAN","TAX","TEC","ENG","IMM","CPT","AVI","HCR","INT","CPI","LBR","ADV","CSP","TRA","SCI","COM","LAW","BUD","VET","EDU","POS","DIS","SMB","ART","GOV","ENV","DEF","AGR"]}