{"name":"CHARLES BRAIN","slug":"charles-brain","positions":["Assistant to the President, Deputy Chief of Staff W&M Committee","Assistant to the President; Deputy Chief of Staff, Ways & Means Committee","Asst. to the President, Dp. Chief Staff W&M Cmte.","Asst. to the President, Dp.Chief Staff W&M Cmte","Asst to the President, Dpty COS W&M Comm","Special Assistant to the President, Deputy Chief of Staff House Ways & Means Committee","Asst.to the President, Dp. Chief Staff W&M Cmte.","Special Assistant to the President, Deputy Chief of Staff House Ways and Means Committee","Asst to the President, Dp Chief of Staff W&M Cmte","Assistant to the President, Deputy Chief of Staff Ways & Means Committee","Special Assistant to the President, Deputy COS W&M Committee","Special Assistant to the President, Deputy COS House W&M Committee","Special Assistant to the President, Deputy COS House Ways & Means Committee","Asst to the President; Dep COS W&M Committee","Asst. to the President, Dp. Chief of Staff W&M Cmte.","Asst. to the President, Dp Chief Staff W&M Cmte.","Special Assistant to the President, Deputy Chief of Staff House W&M Committee","Special Assistant to the President, Deputy Chief of Staff, Ways and Means Committee","Special Assistant to the President, Deputy COS Ways & Means Committee","Assistant to the President, Deputy COS Ways & Means Committee","Assistant to the President; Deputy Chief of Staff, Ways and Means Committee","Special Assistant to the President; Deputy COS Ways and Means Committee","Special Assistant to the President, Dep. COS Ways & Means Committee","Special Assistant to the President; Deputy COS Ways & Means Committee"],"firms":["CAPITOL HILL STRATEGIES,  LLC"],"clients":["MERCK & CO., INC","CONSUMER DATA INDUSTRY ASSOCIATION","HORIZON PHARMA USA, INC","ALTRIA CLIENT SERVICES LLC","BIOTECHNOLOGY INDUSTRY ORGANIZATION","BIOGEN INC","DELTA AIR LINES, INC.","FMR LLC","INVESTMENT COMPANY INSTITUTE","PRINCIPAL FINANCIAL GROUP","WINE AND SPIRITS WHOLESALERS OF AMERICA, INC.","ALLY FINANCIAL, INC.","PHRMA","FARRAGUT PARTNERS LLP ON BEHALF OF HERON THERAPEUTICS","WELLS FARGO & COMPANY","PRUDENTIAL FINANCIAL INC","SANOFI US SERVICES INC.","VERIZON COMMUNICATIONS INC AND VARIOUS SUBSIDIARIES","AMGEN","CITIGROUP WASHINGTON, INC."],"filings":232,"issues":[]}