{"id":16824,"name":"DANIEL MUROFF","slug":"daniel-muroff","revolvingDoor":true,"governmentPositions":["Staff, Cong. Kika de la Garza; Legislative Assistant, Cong. Jim McGovern; Chief of Staff, Cong. Mike Capuano; Special Asst., Cong. Joe Hoeffel","Special Assistant, Congressman Joe Hoeffel, Chief of Staff, Congressman Mike Capuano, Legislative Assistant, Congressman Jim McGovern, Staff, Congressman Kika de la Garza","Staff, Cong. Kika de la Garza (D-TX); Legislative Asst., Cong. Jim McGovern (D-MA); Chief of Staff, Cong. Mike Capuano (D-MA); Spec. Asst., Cong. Joe Hoeffel","Cong. Kika de la Garza (TX-15), staff; Cong. Jim McGovern (MA-03), Legislative Assistant; Cong. Mike Capuano (MA-08), Chief of Staff; Cong. Joe Hoeffel (PA-13), Spec. Asst.","Cong. Kika de la Garza (TX-15), staff; Cong. Jim McGovern (MA-03), LA; Cong. Mike Capuano (MA-08), Chief of Staff; Cong. Joe Hoeffel (PA-13), special asst","Staff, Cong. Kika de la Garza (TX); Legislative Assistant, Cong. Jim McGovern (MA); Chief of Staff, Cong. Mike Capuano (MA); Special Assistant, Cong. Joe Hoeffel (PA)","Cong. Kika de la Garza (TX-15), staff; Cong. Jim McGovern, Leg. Asst. (MA-03); Cong. Mike Capuano (MA-08) Chief of Staff; Cong. Joe Hoeffel (PA-13), special assistant","Cong. Kika de la Garza (TX-15), staff; Cong. Jim McGovern (MA-03); Cong. Mike Capuano (MA-08); Cong. Joe Hoeffel (PA-13)","Cong. Kika de la Garza (TX-15), staff; Cong. Jim McGovern (MA-03), LA; Cong. Mike Capuano (MA-08), Chief of Staff; Cong. Joe Hoeffel (PA-13), Spec. Asst.","Special Assistant, Congressman Joe Hoeffel (PA-13)","Cong. Kika de la Garza (TX-15), staff; Cong. Jim McGovern (MA-03), legislative assistant; Cong. Mike Capuano (MA-08), chief of staff; Cong. Joe Hoeffel (PA-13), special assistant"],"totalFilings":128,"yearlyActivity":[{"year":2019,"filings":10,"clients":1,"firms":1,"issues":["LBR","HOU","BUD","HCR","MMM"]},{"year":2020,"filings":2,"clients":1,"firms":1,"issues":["TRA"]},{"year":2021,"filings":42,"clients":8,"firms":1,"issues":["IMM","LBR","MMM","BUD","TRA","ECN"]},{"year":2022,"filings":33,"clients":8,"firms":1,"issues":["BUD","LBR","MMM","TRA"]},{"year":2023,"filings":18,"clients":6,"firms":1,"issues":[]},{"year":2024,"filings":10,"clients":4,"firms":1,"issues":["BUD"]},{"year":2025,"filings":13,"clients":4,"firms":1,"issues":["BUD","MMM"]}],"topClients":[{"name":"JEVS HUMAN SERVICES","filings":32},{"name":"SALVATION ARMY OF EASTERN PENNSYLVANIA AND DELAWARE","filings":18},{"name":"CENTRAL PHILADELPHIA DEVELOPMENT CORPORATION","filings":15},{"name":"SELF-HELP MOVEMENT, INC","filings":14},{"name":"LIBERTY RESOURCES, INC.","filings":12},{"name":"MANN CENTER FOR THE PERFORMING ARTS ON BEHALF OF CAVAROCCHI RUSCIO DENNIS ASSOC","filings":11},{"name":"INGLIS","filings":10},{"name":"QUNTESSENCE THEATRE GROUP","filings":6},{"name":"HISTORIC LANSDOWNE THEATER COMPANY","filings":4},{"name":"CENTER CITY DISTRICT","filings":2},{"name":"CITIZEN DIPLOMACY INTERNATIONAL PHILADELPHIA","filings":2},{"name":"AFRICAN CULTURAL ALLIANCE OF NORTH AMERICA (ACANA)","filings":2}],"firms":[{"name":"MISSION GOVERNMENT RELATIONS (FORMERLY KNOWN AS MUROFF LAW FIRM, LLC)","filings":128}],"issues":["LBR","HOU","BUD","HCR","MMM","TRA","IMM","ECN"]}