{"id":139604,"name":"DANIEL SEPULVEDA","slug":"daniel-sepulveda","revolvingDoor":true,"governmentPositions":["Amb. and Dep. Asst. Sec. - US Department of State, Senior Adviser - Sen. Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer","Amb. and Dep. Asst. Sec. - US Department of State, Senior Adviser - Sen. Mo Cowan, senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser - Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser -Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR,Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant -Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser -Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser -Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant -Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser - Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant -Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser - Sen. Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer","Amb. and Dep. Asst Sec. - US Department of State, Senior Adviser - Sen. Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer","Amb. and Dept. Asst. Sec. - US Department of State, Senior Adviser - Rep. Mo Cowan, Senior Adviser - Sen. John Kerry, Assistant USTR - USTR, Legislative Assistant - Sen. Barack Obama, Senior Legislative Assistant - Sen. Barbara Boxer"],"totalFilings":191,"yearlyActivity":[{"year":2022,"filings":48,"clients":15,"firms":1,"issues":["TRD","ENG","TEC","EDU","BUD","ART","TRA","LBR","MIA","MAR","SCI","IND","GAM"]},{"year":2023,"filings":42,"clients":10,"firms":1,"issues":[]},{"year":2024,"filings":51,"clients":13,"firms":1,"issues":["LAW","SCI","LBR","ART","TEC","TAX","CPT","MIA","MAR","BUD","TRA","NAT","IND","GAM","IMM"]},{"year":2025,"filings":50,"clients":10,"firms":1,"issues":["SCI","LBR","ART","TEC","TAX","CPT","GAM","IND","BUD","LAW","TRA","IMM","TRD","CPI"]}],"topClients":[{"name":"TILE, INC.","filings":26},{"name":"SAG-AFTRA","filings":24},{"name":"SYCUAN BAND OF THE KUMEYAAY NATION","filings":23},{"name":"THE POKEMON COMPANY INTERNATIONAL","filings":13},{"name":"NEWS MEDIA ALLIANCE","filings":12},{"name":"CROWLEY MARITIME CORP.","filings":10},{"name":"CITY OF KANSAS CITY, MISSOURI","filings":9},{"name":"NATIONAL ASSOCIATION OF VOICE ACTORS","filings":8},{"name":"SONY INTERACTIVE ENTERTAINMENT","filings":7},{"name":"MITCHELL SILBERBERG & KNUPP LLP","filings":7},{"name":"BETA TECHNOLOGIES, INC.","filings":6},{"name":"FRONTIERS OPEN SCIENCE INC.","filings":6},{"name":"AMERICAN CLEAN POWER ASSOCIATION","filings":5},{"name":"UNIDOSUS","filings":5},{"name":"GLYDWAYS, INC","filings":5},{"name":"SDFC TEAM, LLC","filings":5},{"name":"MICROSOFT CORP.","filings":5},{"name":"GOBRANDS, INC.","filings":4},{"name":"RIOT GAMES, INC.","filings":3},{"name":"BUNGIE INC.","filings":3},{"name":"WESTFIELD STATE UNIVERSITY","filings":2},{"name":"AETHON ENERGY","filings":1},{"name":"SIERRA ENERGY","filings":1},{"name":"DALRADIAN USA","filings":1}],"firms":[{"name":"PLATINUM ADVISORS DC, LLC","filings":191}],"issues":["TRD","ENG","TEC","EDU","BUD","ART","TRA","LBR","MIA","MAR","SCI","IND","GAM","LAW","TAX","CPT","NAT","IMM","CPI"]}