{"name":"DAVID SPOONER","slug":"david-spooner","positions":["Asst. Secretary for Import Admin, US Commerce Dept; Chief Textile & Apparel Negotiator, US Trade Rep; Chief of Staff Rep. Sue Myrick; Prof Staff Member, House Comm on Rules; Comm Dir House Ag Comm; Legislative Counsel, Rep Wes Cooley.","Ass. Secretary for Import Admin, US Commerce Dept.; Chief Textile & Apparel Negotiator, US Trade Rep.; Chief of Staff Rep. Sue Myrek; Prof. Staff Member, House Comm. on Rules; Comm. Dir. House Ag. Comm.; Legislative Counsel Rep. Wes Cooley","Asst. Secretary for Import Admin, US Commerce Dept; Chief Textile & Apparel Negotiator, US Trade Rep; Chief of Staff Rep. Sue Myrek; Prof Staff Member, House Comm on Rules; Comm Dir House Ag Comm; Legislative Counsel, Rep Wes Cooley.","Asst. Secretary for Import Admin., US Commerce Dept; Chief Textile & Apparel Negotiator, US Trade Rep; Chief of Staff Rep. Sue Myrek; Prof Staff Member, House Comm. on Rules; Comm. Dir. House Ag. Comm.; Legislative Counsel Rep. Wes Cooley.","Asst Secretary for Import Administration, US Commerce Dept; Chief Textile and Apparel Negotiator, US Trade Rep; chief of Staff Rep. Sue Myrek; Prof. Staff Member, House Comm on Rules; Comm Dir. House Ag. Comm.; Legislative Counsel Rep. Wes Cooley","Asst. Secretary for Import Administration; US Commerce Dept; Chief Textile & Apparel Negotiator, US Trade Rep.; Chief of Staff Rep. Sue Myrek; Prof. Staff member, House Comm. on Rules; Comm. Dir. House Ag. Comm.; Legislative Counsel Rep. Wes. Cooley.","Asst. Sec. for Import Admin. at Dept. of Commerce; Chief Textile & Apparel Negotiator at USTR; Chief of Staff to Rep. Myrick; Leg. Counsel to Rep. Cooley; Staff at House Rules Cmte.; Staff at House Agriculture Cmte.","Assistant Secretary of Commerce to Import Administration; Chief Textile & Apparel Negotiator to Office of U.S. Trade Representative; Chief of Staff to Rep. Sue Myrick; Legislative Counsel to Rep. Wes Cooley","Asst Sec of Commerce to Import Admin; Chief Textile & Apparel Negotiator to Office of U.S. Trade Rep; Chief of Staff to Rep. Sue Myrick; Prof Staff Member to House Comm on Rules; Comm Dir House Ag Comm; Legislative Counsel to Rep. Wes Cooley"],"firms":["BARNES & THORNBURG, LLP"],"clients":["AAR CORP.","ERNST & YOUNG LLP","UNITED STATES STEEL CORPORATION","DAQRI","TILE COUNCIL OF NORTH AMERICA","ALCOA CORPORATION","FIRST PICK FARMS, LLC","UNIVERSAL FOREST PRODUCTS","SANY AMERICA, INC.","U.S. FASHION INDUSTRY ASSOCIATION","NATIONAL CANDLE ASSOCIATION","EARTHLITE","CIMC INTERMODAL EQUIPMENT","MPI CORPORATION","MICHIGAN SUGAR COMPANY","DURACELL DISTRIBUTING, INC.","BISSELL HOMECARE, INC.","INVENTUS POWER","MATERIALS PROCESSING, INC. D/B/A MPI CORPORATION"],"filings":265,"issues":[]}