{"name":"DAVID LASSETER","slug":"david-lasseter","positions":["Schedule C - DOJ and DOD, Legislative Aide - House of Representatives","Schedule C - DOJ and DOD, Legislative Aide - U.S. House of Representatives","Deputy Assistant Secretary of Defense; Deputy Assistant Attorney General; Chief of Staff for former Rep Blake Farenthold; Military Legislative Assistant for former Rep Jeff Miller","Congressional Aide, Schedule C employee","Schedule C - DOD, Legislative Aide - U.S. House of Representatives","Former Congressional Staff, Former Schedule C - DOJ, Former Schedule C - DOD","Former Congressional Aide (U.S. House), Former Schedule C (DOJ, DOD)","Former Schedule C (DOD, DOJ), Former Congressional Aide (U.S. House)","Former Schedule C (DOD and DOJ), Former Congressional Aide (U.S. House)","Former Congressional Aide (U.S. House), Former Schedule C (DOD and DOJ)","Deputy Assistant Secretary of Defense for Countering WMD Deputy Assistant Attorney General for Legislative Affairs","Deputy Assistant Secretary of Defense Deputy Assistant Attorney General","Former Schedule C (DOD, DOJ), Former Congressional Aide (U.S. House, U.S. Senate)","Schedule C (DOD, DOJ); Congressional staffer (U.S. House and U.S. Senate)","Schedule C (DoD and DOJ); Congressional Staffer (U.S. House and U.S. Senate)","Congressional staffer in U.S. House and U.S. Senate; Deputy Assistant Attorney General; Deputy Assistant Secretary of Defense","-Staffer in U.S. Senate and U.S. House -Schedule C Deputy Assistant Secretary at DOD -Schedule C Deputy Assistant Attorney General at DOJ","-Deputy Assistant Secretary of Defense; Deputy Assistant Attorney General; House staffer; and Senate staffer.","Deputy Assistant Secretary of Defense; Deputy Assistant Attorney General; Congressional staffer (House and Senate)","Former Schedule C (DOD, DOJ) Former Congressional Aide (U.S. House, U.S. Senate)","Former Schedule C (DOD), Former Congressional Aide (U.S. House and U.S. Senate)"],"firms":["HORIZONS GLOBAL SOLUTIONS LLC"],"clients":["COBANK","MEDCO33 LLC","CONEXON LLC","GENE CAPTURE","KDF ENTERPRISES LLC","YULISTA INTEGRATED SOLUTIONS LLC","MERIDIAN MEDICAL TECHNOLOGIES","LIVE OAK BANKING COMAPNY","CAPTURA BIOPHARMA","NIGHTHAWK BIOSCIENCES","BIPARTISAN COMMISSION ON BIODEFENSE","TRANSCEND ENGINEERING","LOVELL GOVERNMENT SERVICES","RECCE PHARMACEUTICALS","FRESHAIR SENSORS","GINKGO BIOWORKS","INVARIANT CORPORATION","MARATHON TARGETS","CLEARSPEED","SHUNNARAH VAIL","AFLAC","SIREN CARE INC","ARTESION INC","ELUSYS THERAPUTICS","TRADEVERIFYD (FKA MESUR.IO)","HUDSONALPHA"],"filings":280,"issues":[]}