{"id":1266,"name":"DUANE GIBSON","slug":"duane-gibson","revolvingDoor":true,"governmentPositions":["LA Sen. Stevens; Counsel H Cottees on Resources; H Transp.","LA-Senator Stevens; Counsel H.Committee on Resources; Staff Director, Counsel, House Subcommittee on Highways and Transit","LA Senator Stevens; Staff Director, SubCttee on Highways and Transit; Counsel Committee on Resources","LA Senator Stevens; Staff Director, SubCttee on Highways and Transit; Counsel, Committee on Resources","LA Sen Stevens; Cnsl H. Resources Committee; Staff Director, sub comm. on Highways of Trans Cttee","LA, Sen. Stevens, Counsel House Resources Cttee; Counsel House Transportation Cttee.","LA Senator Stevens; Staff Director SubCttee Highways and Transit; Counsel, Committee on Resources","LA Senator Stevens; Counsel House Resources; Staff Director House Highways and Transit Subcommittee","LA Senator Stevens; Counsel, Committee on Resources; staff director Highways and Transit Subcommittee.","LA Senator Stevens, Counsel Committee on Resources, Staff Director, Subcommittee on Highways and Transit","LA Senator Stevens; Counsel H. Cttee on Resources; Staff Director/Counsel H. Transp Subcommittee on Highways and Transit","LA Senator Stevens; Counsel Committee on Resources; Staff Director Subcommittee on Highways and Transit","LA Senator Stevens; Counsel Resources Committee; Counsel and Staff Dir Highways and Transit Subcommittee","LA Sen. Stevens; Counsel House Nat. Resources Committee; Counsel Highways and Transit Subcommittee","LA Sen Stevens; Counsel H. Committee on Resources; Staff Dir House Sub Committee on Highways and Transit","LA Sen Stevens; Counsel H. Committee on Resources; Staff Dir H. Subcommittee on Highways and Transit","LA Sen Stevens; Counsel H. Committee on Resources; Staff Dir, H. Subcommittee on Highways and Transit","LA Sen Stevens; Counsel H. Resources Committee; Staff Dir H. Highways and Transit Subcommittee","LA Sen Stevens; Counsel H. Committee on Resources; Staff Dir H. Sub Committee on Highways and Transit","LA Sen Stevens, Counsel Committee on Resources; Staff Director subcommittee on Highways and Transit","LA Senator Stevens; Counsel House Committee on Resources; Staff Director House Subcommittee on Highways and Transit","LA Senator Stevens\nCounsel Committee on Resources\nStaff Director, Subcommittee on Highways and Transit (Transportation Committee)","LA Sen. Stevens; Counsel House Committee on Resources; Staff Director Subcommittee on Highways and Transit","LA Sen. Stevens; Counsel Resources Committee; Staff Dir. Highways and Transit Subcommittee","LA Sen Stevens; Counsel Committee on Resources; Staff Dir. Sub Comtt Highways","LA Sen Stevens; Counsel Committee on Resources; Staff Dir Sub committee on Highways and Transit","LA Sen Stevens; Counsel Comm on Resources; Staff Director Subcommittee Highways and Transit","LA Sen Stevens; Counsel Committee on Resources; Staff Dir Subcommittee on Highways and Transit","LA Senator Stevens; Counsel, Committee on Resources; staff director Subcommittee on Highways and Transit","LA Sen Stevens; counsel committee on Resources and staff Dir counsel Subcommittee on Highways and transit.","LA Sen Stevens; Counsel Comm. of Resources; Counsel and Staff Director Subcommittee on Highways and Transit","LA Sen. Stevens; Counsel Committee on Resources; Sr. Counsel and Staff director Highways, Transit, Pipelines subcommittee","LA Senator Stevens; Counsel Committee on Resources; Senior Counsel, Highways Transit Pipelines Subcommittee in House.","LA Sen Stevens, Counsel House Committee on Resources; Counsel and Staff Director Subcommittee on Highways and Transit","LA Senator Stevens; Counsel, Committee on Natural Resources; Counsel & Staff Director, Subcommittee on Highways and Transit.","LA Senator Stevens;  Counsel, Committee on Resources; Senior Counsel & Staff Director, Subcommittee on Highways and Transit.","LA Senator Stevens; Counsel, Committee on Resources; Senior Counsel/Staff Director, Subcommittee on Highways and Transit","LA Sen. Stevens; Counsel Committee on Resources; Counsel/Staff Director Subcommittee on Highways and Transit","LA Sen Stevens; Counsel, Committee on Resources; Counsel/Staff Director Subcommittee on Highways and Transit","LA, senator Stevens; Counsel Nat. Resources Committee; Counsel and Staff Director Highways and Transit subcommittee","LA Sen Stevens; Counsel, Committee on Resources; Staff Dir. Highways and Transit Subcommittee","LA Sen. Stevens; Counsel, House Committee on Resources; Staff Dir, Subcommittee on Highways and Transit","LA Sen. Stevens; Counsel, House Resources Committee; Staff Dir; Subcommittee on Highways and Transit","LA Senator Stevens; Counsel, Committee on Resources; Staff Director/Counsel H. subcommittee on Highways and Transit","LA Senator Stevens; Counsel H. Committee on Resources; Staff Director/Counsel Subcommittee on Highways and Transit","LA, Senator Stevens. Counsel, Committee on Resources; Counsel/Staff Director Subcommittee on Highways and Transit","LA, Senator Stevens; Counsel H. Committee Resources; Staff Director H. Sub Committee on Highways and Transit","LA Sen. Stevens; Counsel House Resources Committee; Staff Director House Trans Committee, subcommittee on Highways and Transit.","LA Sen. Stevens; Counsel, Committee on Resources; Staff Director Highways Subcommittee of T&I","LA, Senator Ted Stevens 1989-1995; Counsel, House Committee on Resources 1995-2001; Staff Director, Counsel, Highways Transit Subcommittee 2001-2002","LA Senator Stevens; Counsel, Committee on Resources; Counsel and staff director Subcommittee on Highways and Transit","LA Senator Stevens, Counsel Resources Committee,Staff Director Highways and Transit Subcommittee.","LA Senator Stevens; Counsel Resources Committee;Staff Director Highways and Transit Subcommittee","LA Senator Stevens; Counsel, Resources Committee; Staff Director, Highways and Transit Subocmmittee","LA, Senator Stevens; Counsel, Natural Resources Committee; Staff Director, Highways and Transit Subcommittee","LA Senator Stevens; Counsel Natural Resources Committee; Staff Director/Counsel Highways and Transit Subcommittee of the Transportation Committee","LA Senator Stevens; Counsel Natural Resources Committee; Staff Director/Counsel Highways and Transit Subcommittee of House Transportation Committee.","LA Senator Stevens; Counsel Natural Resources Committee; Staff Director/Counsel Highways and Transit Subcommittee of the House Transportation Committee","LA Senator Stevens; counsel House Resources Committee; counsel and staff director of Highways Subcommittee.","LA Senator Stevens; Counsel House Natural Resources Committee; Staff director highways subcommittee","LA Senator Stevens; Counsel House Committee on Resources; Counsel/Staff Director Subcommittee on Highways and Transit","LA Senator Stevens; Counsel House Natural Resources; Counsel/Staff Director Subcommittee on Highways and Transit","LA Senator Stevens; Counsel Committee on Resources; Counsel/Staff Director Subcommittee on Highways","LA Senator Stevens; Counsel, House Committee on Resources; Counsel and Staff Director Highways and Transit Subcommittee, of T&I Committee","LA Sen Stevens; Counsel Natural Resources Committee, Counsel and Staff Director Highways and Transit Subcommittee of T&I.","LA Senator Stevens; Counsel Committee on Resources; Staff Director Highways Subcommittee of T&I","LA Sen. Stevens; Counsel Natural Resources Committee; Staff Director and Counsel Highways and Transit Subcommittee","LA Sen. Stevens; Counsel Natural Resources Committee; Staff Director and Counsel House Highways and Transit subcommittee"],"totalFilings":509,"yearlyActivity":[{"year":2018,"filings":35,"clients":6,"firms":1,"issues":["IND","TAX","ROD","TRA","HOU","ENV","NAT","RES","ACC","ENG","FOO","INS"]},{"year":2019,"filings":55,"clients":13,"firms":1,"issues":["WEL","NAT","IND","TAX","TRA","ROD","HOU","RES","ENG","INS","FAM","GOV","TRD","BUD","MAN","LBR","HCR","MMM","FOR"]},{"year":2020,"filings":74,"clients":15,"firms":1,"issues":["ENG","IND","TAX","ROD","TRA","HOU","RES","HCR","MMM","LBR","NAT","MAN","FOR","DEF"]},{"year":2021,"filings":82,"clients":16,"firms":1,"issues":["TAX","TRA","RES","ROD","ENG","DEF","NAT","HCR","EDU","SCI"]},{"year":2022,"filings":79,"clients":14,"firms":1,"issues":["TAX","TRA","ROD","RES","ENG","SCI","NAT","DEF","HCR","EDU"]},{"year":2023,"filings":55,"clients":9,"firms":1,"issues":[]},{"year":2024,"filings":49,"clients":8,"firms":1,"issues":["NAT","DEF","ENG","AVI","EDU","AER","FIN","INS","TRA","SCI","BAN"]},{"year":2025,"filings":80,"clients":11,"firms":1,"issues":["TRA","DEF","ENG","AVI","NAT","EDU","FIN","INS","BAN","IND","GAM","AER","BUD","CPI","HOM","VET","HCR","CAW"]}],"topClients":[{"name":"APTERA MOTORS CORP","filings":66},{"name":"SAGAMORE DEVELPMENT CORPORATION","filings":64},{"name":"COULSON AIRCRANE USA","filings":49},{"name":"ARCIMOTO, INC","filings":36},{"name":"RADIA, LLC","filings":35},{"name":"VOLTA INDUSTRIES, INC.","filings":29},{"name":"BELL & LINDSAY (FOR SOUTHEASTERN COLLEGE)","filings":20},{"name":"FORTRESS WILDFIRE INSURANCE GROUP","filings":20},{"name":"FORTRESS NORTH AMERICA","filings":19},{"name":"ZERO MOTORCYCLE INC","filings":18},{"name":"BELL & LINDSAY (FOR EVERGLADES UNIVERSITY)","filings":18},{"name":"QUANTUM KNIGHT","filings":18},{"name":"HARLEY-DAVIDSON","filings":15},{"name":"BYE AEROSPACE","filings":14},{"name":"4C HEALTH SOLUTIONS, INC","filings":12},{"name":"NATIONAL WHISTLEBLOWER LEGAL DEFENSE & EDUCATION FUND","filings":10},{"name":"COYNE REAL ESTATE","filings":10},{"name":"ALEXANDER CREEK INC","filings":9},{"name":"TRIBAL O/COQUILLE TRIBE","filings":8},{"name":"BELL AND LINDSAY (FOR HC LOGICS)","filings":7},{"name":"GREATER AMERICA LLC (FOR CITY OF LANCASTER CA)","filings":6},{"name":"CITIZENS FOR THE EXTENSION OF THE JAMES ZADROGA ACT, INC","filings":4},{"name":"NEWLINX INTERNATIONAL","filings":4},{"name":"NATIONAL WHISTLEBLOWER CENTER","filings":4},{"name":"GREATER AMERICA LLC (FOR GREEN POINT RESOURCES)","filings":3},{"name":"PEMBINA PIPELINE CORP.","filings":3},{"name":"CITIZENS FOR RESPONSIBLE ENERGY SOLUTIONS","filings":3},{"name":"LIFE CONNECTION OF OHIO","filings":3},{"name":"BELL AND LINDSAY (FOR LABEL INSIGHT)","filings":2}],"firms":[{"name":"GOVBIZ ADVANTAGE, INC.","filings":509}],"issues":["IND","TAX","ROD","TRA","HOU","ENV","NAT","RES","ACC","ENG","FOO","INS","WEL","FAM","GOV","TRD","BUD","MAN","LBR","HCR","MMM","FOR","DEF","EDU","SCI","AVI","AER","FIN","BAN","GAM","CPI","HOM","VET","CAW"]}