{"id":143064,"name":"ELIZABETH DALTON","slug":"elizabeth-dalton","revolvingDoor":true,"governmentPositions":["Principal Deputy Asst Secretary, Office of Electricity Delivery and Energy Reliability, US DOE; Chief of Staff and Senior Advisor, Office of Nuclear Energy, US DOE; Special Asst to the Undersecretary of Energy, US DOE, Scheduler for Rep. Marion Berr","Principal Deputy Asst Secretary, Office of Electricity Delivery and Energy Reliability, US DOE; Chief of Staff and Senior Advisor, Office of Nuclear Energy, US DOE; Special Asst to the Undersecretary of Energy, US DOE, Scheduler for Rep. Marion Berry","Principal Deputy Asst Secretary, Office of Electricity Delivery and Energy Reliability, US DOE; Chief of Staff and Senior Advisor, Office of Nuclear Energy, US DOE; Special Asst to the Undersecretary of Energy, US DOE; Scheduler for Rep. Marion Berry","Principal Deputy Asst Secretary, Office of Electricity Delivery and Energy Reliability, US DOE; Chief of Staff and Senior Advisor, Office of Nuclear Energy, US DOE; Special Asst to the Undersecretary of Energy, US DOE; Scheduler for Rep. Marion Berr","Principal Deputy Asst Secretary, Office of Electricity Delivery and Energy Reliability, US DOE; Chief of Staff and Senior Advisor, Office of Nuclear Energy, US DOE; Special Asst to the Undersecretary of Energy, US DOE;vScheduler for Rep. Marion Berry","Principal Dep. Asst Secretary, Office of Electricity Delivery and Energy Reliability, US DOE; Chief of Staff and Senior Advisor, Office of Nuclear Energy, US DOE; Special Asst to the Undersecretary of Energy, US DOE, Scheduler for Rep. Marion Berry"],"totalFilings":159,"yearlyActivity":[{"year":2023,"filings":46,"clients":4,"firms":1,"issues":[]},{"year":2024,"filings":42,"clients":10,"firms":1,"issues":["ENG","TAX","ENV","NAT","TRD","MAN"]},{"year":2025,"filings":71,"clients":10,"firms":1,"issues":["ENG","TAX","ENV","NAT","TRD","MAN","BUD"]}],"topClients":[{"name":"EDISON INTERNATIONAL","filings":33},{"name":"EQUINOR US OPERATIONS LLC","filings":22},{"name":"STEM, INC.","filings":21},{"name":"SYRAH RESOURCES LIMITED","filings":18},{"name":"KANIN ENERGY","filings":14},{"name":"GOODLEAP","filings":12},{"name":"ARBOR ENERGY AND RESOURCES CORPORATION","filings":11},{"name":"GENERAL MATTER INC","filings":8},{"name":"CELLINK CORPORATION","filings":8},{"name":"RADIANT INDUSTRIES, INC","filings":6},{"name":"GTI ENERGY","filings":6}],"firms":[{"name":"MISSION STRATEGIES LLC (ENERGY)","filings":159}],"issues":["ENG","TAX","ENV","NAT","TRD","MAN","BUD"]}