{"id":53268,"name":"ELIZABETH FRAZEE","slug":"elizabeth-frazee","revolvingDoor":true,"governmentPositions":["Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary House Energy and Commerce Committee, Press Secretary Rep. Tom Bliley","Legislative Director and counsel to Rep. Bob Goodlatte, Press Secretary to former Rep. Tom Bliley, Press Secretary to the House Energy and Commerce Committee","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary House Energy and Commerce Committee, Press Secretary, former Rep. Tom Bliley","Legislative Director and Counsel for Rep. Bob Goodlatte, Press Secretary for House Energy and Commerce Committee, Press Secretary for Rep. Tom Bliley","Legislative Counsel and Director to Rep. Bob Goodlatte (VA), Press Secretary to the House Energy and Commerce Committee, Press Secretary to former Rep. Tom Bliley","Legislative director and counsel, Rep. Bob Goodlatte, press secretary Rep. Tom Bliley, press secretary, House Energy and Commerce Committee","Legislative Counsel and Director - Rep. Bob Goodlatte/Press Secretary House E&C","Legislative Counsel - Rep.Goodlatte/Press Sec.House E&C","Legislative Counsel - Rep.Goodlatte/Press Sec. House E&C","Legislative Counsel and Director - Rep.Goodlatte/Press Sec.House Energy and Commerce","Legislative Counsel and Director to Rep. Bob Goodlatte (VA), Press Secretary to the House Energy and Commerce Committee, Press Secretary to Rep. Tom Bliley (VA)","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary to the House Energy and Commerce Committee","Legislative Counsel and Director, Rep.Bob Goodlatte, Press Secretary House Energy and Commerce Committee","Legislative Director and Counsel to Rep. Bob Goodlatte (VA), Press Secretary to the House Energy and Commerce Committee, Press Secretary to former Rep. Tom Bliley","Legislative Director and Counsel to Rep. Bob Goodlatte (VA), press secretary to the House Energy and Commerce Committee","Legislative Director and Counsel - Rep.Goodlatte (VA)/Press Secretary House Energy and Commerce Committee","Legislative Director and Counsel - Rep.Goodlatte (VA)/Press Secretary House Committee on Energy and Commerce","Legislative Director and Counsel, Rep. Bob Goodlatte (R-VA), Press Secretary, House Energy and Commerce Committee, Press Secretary, Former Rep. Tom Bliley (R-VA)","Legislative Director and Counsel to Rep. Bob Goodlatte and Press Secretary to the House Energy and Commerce Committee","Legislative Director and Counsel, Rep. Bob Goodlatte and Press Secretary House Energy and Commerce Committee","Legislative Director and Counsel, Rep. Bob Goodlatte, Press Secretary, former Rep. Tom Bliley, Press Secretary, House Energy and Commerce Committee","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary, Committee on Energy and Commerce, Press secretary to former Rep. Tom Bliley","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary, Committee on Energy and Commerce, Press secretary former Rep. Tom Bliley","Legislative Director and Counsel, Rep. Bob Goodlatte, Press Secretary Rep. Tom Bliley, Press Secretary, House Energy and Commerce Committee\nLegislative Counsel - Rep.Goodlatte/Press Sec.House E&C","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary to former Rep. Tom Bliley, Press Secretary to House Energy and Commerce Committee","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary to former Rep. Tom Bliley, Press Secretary to the House Energy and Commerce Committee","Legislative and Director to Rep. Bob Goodlatte, Press Secretary to former Rep. Tom Bliley, Press Secretary to House Energy and Commerce Committee","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary to the House Energy and Commerce Committee, Press Secretary to former Rep. Tom Bliley","Legislative Director and Counsel to Rep. Bob Goodlatte (VA), Press Secretary to the House Energy and Commerce Committee, Press Secretary to former Rep. Tom Bliley (VA)","Legislative Director and Counsel to Rep. Bob Goodlatte, Press Secretary, House Energy and Commerce Committee, Press Secretary to former Rep. Tom Bliley","Legislative Director and Counsel to Rep. Bob Goodlatte/Press Secretary House Energy and Commerce Committee","Legislative Counsel and Director for Rep. Bob Goodlatte (R-VA); Press Secretary Rep. Tom Bliley; Press Secretary House Energy and Commerce Committee","Legislative Counsel and Legislative Director, Rep. Bob Goodlatte, Press Secretary, House Energy and Commerce Committee, Press Secretary, Former Rep. Tom Bliley","Legislative Director and Counsel, Rep. Bob Goodlatte; Press Secretary, House Energy and Commerce Committee; Press Secretary former Rep. Tom Bliley","Legislative Counsel and Director to Rep. Bob Goodlatte, Press Secretary House Committee on Energy and Commerce and Press Secretary for Rep. Tom Bliley","Legislative Director and Counsel, Rep. Bob Goodlatte; Press Secretary, House Energy and Commerce Committee; Press Secretary, Rep. Tom Bliley","Legislative Director & Counsel, former Rep. Bob Goodlatte, Press Secretary, House Energy and Commerce Committee, Press Secretary, former Rep. Tom Bliley","Legislative Counsel and Director to former Rep. Bob Goodlatte, Communications Director, House Energy and Commerce Committee, Press Secretary, former Rep. Tom Bliley","Counsel and Legislative Director, former Rep. Bob Goodlatte; Communications Director, House Energy and Commerce Committee; Press Secretary, former Rep. Tom Bliley","Counsel and Legislative Director, former Rep. Bob Goodlatte; Communications Director, House Energy and Commerce Committee, Press Secretary, former Rep. Tom Bliley","Counsel and Legislative Director, Rep. Bob Goodlatte, Communications Director, Rep.Tom Bliley, Press Secretary, House Energy and Commerce Committee","Counsel and Legislative Director, Rep. Bob Goodlatte, Communications Director, Rep. Tom Bliley, Press Secretary, House Energy and Commerce Committee","Counsel and Legislative Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Legislative Director and Counsel, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Counsel and Legislative Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Legislative Director and counsel, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Legislative Director and Counsel, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Legislative Director and Counsel, Rep. Bob Goodlatte, Communications Director, Rep. Tom Bliley, Press Secretary, House Energy and Commerce Committee","Legislative Director and Counsel, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley, Press Secretary, House Committee on Energy and Commerce","Legislative Director and Counsel, Rep. Bob Goodlatte: Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Legislative Counsel and Director, Former Rep. Bob Goodlatte; Communications Director, Former Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Legislative counsel and director; Former Rep. Bob Goodlatte; Communications Director; Former Rep. Tom Bliley; Press Secretary; House Energy and Commerce Committee","Legislative Counsel and Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Legislative counsel and director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Counsel and Legislative Director, Rep. Bob Goodlatte; Press Secretary Rep. Tom Bliley; Communications Director, House Energy and Commerce Committee","Counsel and Legislative Director, Rep. Bob Goodlatte; Press Secretary, Rep. Tom Bliley; Communications Director, House Energy and Commerce Committee","Counsel and Legislation Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Counsel and Legislative Director, Rep. Bob Goodlatte, Press Secretary, Rep. Tom Bliley; Communications Director, House Energy and Commerce Committee","Legislative Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Legislative Director and Counsel to Rep. Bob Goodlatte, Communications Director, Rep. Tom Bliley, Press Secretary, House Energy and Commerce Committee","Legislative Director and Counsel, Rep. Bob Goodlatte (R-VA), Communications Director, Rep. Tom Bliley (R-VA), Press Secretary, House Energy and Commerce Committee","Counsel and Legislative Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, Committee on Energy and Commerce","Counsel and Legislative Director, Rep.Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Counsel and legislative director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Counsel and legislative director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Energy and Commerce Committee","Legislative and Counsel, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Counsel and Legislative Director, Representative Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce","Legislative Counsel and Director, Rep. Bob Goodlatte; Communications Director, Rep. Tom Bliley; Press Secretary, House Committee on Energy and Commerce"],"totalFilings":1779,"yearlyActivity":[{"year":2018,"filings":289,"clients":18,"firms":1,"issues":["LBR","VET","SMB","IMM","HOM","TRD","TEC","FIN","TAX","CPT","CSP","INT","ADV","CPI","ENV","TRA","HCR","SCI","COM","AVI","EDU","MAN","ENG","LAW"]},{"year":2019,"filings":221,"clients":16,"firms":1,"issues":["CSP","CPT","LBR","ADV","TEC","INT","IMM","CPI","TAX","TRD","SCI","HCR","LAW","MAN","ENG","VET","EDU","COM"]},{"year":2020,"filings":228,"clients":19,"firms":1,"issues":["DIS","LBR","BUD","TEC","IMM","INT","CSP","CPI","SCI","TRD","CPT","ADV","LAW","ENG","MAN","HCR","VET","EDU","COM","SMB","ART","HOM","GOV"]},{"year":2021,"filings":171,"clients":19,"firms":1,"issues":["CPT","CSP","TEC","LBR","ADV","LAW","TRD","MAN","ENG","IMM","VET","BUD","HCR","CPI","EDU","SMB","ART","GOV","DIS","SCI","INT","ENV","TAX"]},{"year":2022,"filings":243,"clients":18,"firms":1,"issues":["CPT","LBR","CPI","HOM","TEC","CSP","GOV","TRD","ADV","INT","LAW","MAN","ENG","IMM","EDU","SMB","ART","BUD","TAX","ENV","SCI","HCR","DIS","POS","DEF","COM"]},{"year":2023,"filings":237,"clients":17,"firms":1,"issues":[]},{"year":2024,"filings":175,"clients":17,"firms":1,"issues":["CPI","TEC","CSP","CPT","INT","TRD","LAW","IMM","ENG","TAX","MAN","EDU","LBR","GOV","ENV","HOM","COM","TOU","TRA","AVI","SMB","ART","BUD"]},{"year":2025,"filings":215,"clients":16,"firms":1,"issues":["ADV","CPI","TEC","CPT","CSP","INT","TRD","LAW","LBR","TAX","MAN","IMM","ENG","EDU","SMB","ART","HOM","GOV","AVI","COM","TOU"]}],"topClients":[{"name":"ZEBRA TECHNOLOGIES","filings":181},{"name":"LUTRON ELECTRONICS CO., INC.","filings":178},{"name":"THE INTERNET INFRASTRUCTURE COALITION (I2COALITION)","filings":174},{"name":"CONSUMER TECHNOLOGY ASSOCIATION (PREVIOUSLY THE CONSUMER ELECTRONICS ASSOCIATION","filings":135},{"name":"INTERNATIONAL ASSOCIATION OF VENUE MANAGERS","filings":103},{"name":"PANDORA MEDIA LLC","filings":90},{"name":"X CORP. (FORMERLY TWITTER, INC.)","filings":79},{"name":"LINKEDIN","filings":72},{"name":"DIRECTV, LLC","filings":64},{"name":"SIIA","filings":63},{"name":"NOKIA OF AMERICA CORPORATION","filings":63},{"name":"T-MOBILE USA, INC.","filings":59},{"name":"MUSIC.INNOVATION.CONSUMERS COALITION \"MIC\"","filings":58},{"name":"SPRINT CORPORATION (FORMERLY SPRINT)","filings":48},{"name":"SCIENCE APPLICATIONS INTERNATIONAL CORPORATION","filings":37},{"name":"OATH INC AND VARIOUS SUBSIDIARIES FORMERLY KNOWN AS YAHOO! INC","filings":36},{"name":"INTEL CORPORATION","filings":33},{"name":"COMPETITIVE CARRIERS ASSOCIATION (FORMERLY RURAL CELLULAR ASSOCIATION)","filings":32},{"name":"HUMETRIX","filings":29},{"name":"PORTER AND KORVICK, P.A.","filings":28},{"name":"CROWN CASTLE","filings":25},{"name":"TRAVEL TECH: THE TRAVEL TECHNOLOGY ASSOCIATION","filings":24},{"name":"SHEPPARD, MULLIN, RICHTER & HAMPTON LLP ON BEHALF OF REYNOLDS & REYNOLDS","filings":23},{"name":"REYNOLDS AND REYNOLDS","filings":23},{"name":"AMAZON.COM","filings":21},{"name":"CAROLINA WEST WIRELESS","filings":16},{"name":"AMERICAN COALITION FOR PUBLIC RADIO","filings":13},{"name":"DELL USA LP","filings":12},{"name":"PEW CHARITABLE TRUSTS","filings":11},{"name":"NETWORK ADVERTISING INITIATIVE","filings":11},{"name":"TOOLS FOR HUMANITY CORPORATION","filings":8},{"name":"ENGINE ADVOCACY","filings":7},{"name":"SPOTIFY USA INC.","filings":6},{"name":"UNITED FOR PATENT REFORM","filings":5},{"name":"SHEPPARD, MULLIN, RICHTER & HAMPTON LLP ON BEHALF OF NIAGARA BOTTLING, LLC","filings":4},{"name":"WINN STRATEGIES ON BEHALF OF THE PEW CHARITABLE TRUSTS","filings":4},{"name":"REACH - A DBA OF I-BELONG, INC.","filings":3},{"name":"IMMIGRATION VOICE","filings":1}],"firms":[{"name":"TWINLOGIC STRATEGIES, LLP","filings":1779}],"issues":["LBR","VET","SMB","IMM","HOM","TRD","TEC","FIN","TAX","CPT","CSP","INT","ADV","CPI","ENV","TRA","HCR","SCI","COM","AVI","EDU","MAN","ENG","LAW","DIS","BUD","ART","GOV","POS","DEF","TOU"]}