{"name":"EMILIA DISANTO","slug":"emilia-disanto","positions":["Deputy Inspector General-US Department of State; Chief of Staff - Federal Housing Finance Agency Office of Inspector General; Chief Investigative Counsel and Special Counsel - U.S. Senate Committee on Finance","Deputy Inspector General-US Department of State; Chief of Staff-Federal Housing Finance Agency; Chief Investigative Counsel and Special Counsel - U.S. Senate Committee on Finance","Deputy Inspector General-US Department of State; Chief of Staff-Federal Housing Finance Agency Office of Inspector General; Chief Investigative Counsel and Special Counsel-U.S. Senate Committee on Finance","Deputy Inspector General - US Department of State; Chief of Staff - Federal Housing Finance Agency Office of Inspector General; Chief Investigative Counsel and Special Counsel - U.S. Senate Committee on Finance","Deputy Inspector General-US Department of State; Chief of Staff-Federal Housing Finance Agency; Chief Investigative Counsel and Special Counsel-US Senate Committee on Finance","Deputy Inspector General-US Department of State; Chief of Staff-Federal Housing Finance Agency; Chief Investigative Counsel and Special Counsel-US Senate Committee on Finance.","Deputy Inspector General-US Department of State; Chief of Staff-Federal Housing Finance Agency Office of Inspector General; Chief Investigative Counsel and Special Counsel-US Senate Committee on Finance.","Deputy Inspector General-US Department of State; Chief of Staff-Federal Housing Finance Agency of Inspector General; Chief Investigative Counsel and Special Counsel-U.S. Senate Committee on Finance.","Chief Investigative Counsel & Special Counsel, Senate Committee on Finance; Chief Investigative Counsel, Special Committee on Aging; Deputy Inspector General, U.S. Department of State; Chief of Staff, Federal Housing Finance Agency","Deputy Inspector General, US Department of State; Chief of Staff, Federal Housing Finance Agency Office of Inspector General; Chief Investigative Counsel & Special Counsel, US Senate Committee on Finance","Deputy Inspector General, US Department of State; Chief of Staff, Federal Housing Finance Agency Office of Inspector General; Chief Investigative Counsel & Special Counsel, US Senate Committee on Finance.","Deputy Inspector General- US Department of State; Chief of Staff- Federal Housing Finance Agency; Chief Investigative Counsel and Special Counsel- US Senate Committee on Finance"],"firms":["VENN STRATEGIES"],"clients":["VOICES FOR NON-OPIOID CHOICES","PACIRA PHARMACEUTICALS INC.","RAIL SECURITY ALLIANCE","AMERICAN HEALTH CARE ASSOCIATION","SEVITA (FORMERLY KNOWN AS NATIONAL MENTOR HOLDINGS)","REGENERON PHARMACEUTICALS, INC.","NATIONAL ALLIANCE FOR BETTER NUTRITION","LEXMARK INTERNATIONAL INC.","CIVICA INC.","PREMIER HOME HEALTH CARE SERVICES, INC.","ORACLE AMERICA INC.","STEIN MITCHELL BEATO & MISSNER LLP","ELI LILLY AND COMPANY","TRIS PHARMA, INC."],"filings":168,"issues":[]}