{"id":70784,"name":"ERIC LAUSTEN","slug":"eric-lausten","revolvingDoor":true,"governmentPositions":["Chief of Staff Rep. Lipinski; Legislative Director Rep.Pierluisi Urrutia; Legislative Director Rep. McKinney","Chief of Staff Rep. Lipinski; Legislative Director Rep. Acevedo-Vila; Legislative Director Rep. McKinney","Chief of Staff. Rep. Lipinski, LD Rep. Acevedo-Villa, LD Rep. McKinney","​Chief of Staff Rep. Lipinski; Legislative Director Rep. Acevedo-Vila; Legislative Director Rep. McKinney","​Chief of Staff. Rep. Lipinski, LD Rep. Acevedo-Villa, LD Rep. McKinney","​​Chief of Staff. Rep. Lipinski, LD Rep. Acevedo-Villa, LD Rep. McKinney","Congressman Lipinski - Chief of Staff\nCongresswoman McKinney - Legislative Director\nCommissioner Acevedo-Vila - Legislative Director","Congressman Lipinski - Chief of Staff\nCongressman Anibal Acevedo Vila - Legislative Director","Congressman Lipinski - Chief of Staff Congresswoman McKinney - Legislative Director Commissioner Acevedo-Vila - Legislative Director","Congressman Lipinski - Chief of Staff Congresswoman McKinney - Legislative Director Commissioner Avevedo - Vila - Legislative Director","Congressman Lipinski - Chief of Staff\nCongressman Acevedo - Legislative Director","Congressman Lipinski - Chief of Staff, Congressman Acevedo - Chief of Staff","Congressman Lipinski - Chief of Staff, Congressman Avevedo - Chief of Staff","Congressman Lipinski - Chief of Staff, Congressman Acevedo - Legislative Director.","Congressman Lipinski - Chief of Staff, Congreeman Acevedo - Legislative Director","Chief of Staff - Rep. Lipinski, Rep Acevedo - Rep. Acevedo.","Congressman Lipinski - Chief of Staff, Congressman Acevedo - Legislative Director","Rep. Lipinski, Chief of Staff\nRep. Acevedo-Vila, Legislative Director\nRep. McKinney, Legislative Director","Rep Lipinski (Chief of Staff) Rep Acevedo-Vila (Legislative Director) Rep McKinney (Legislative Director)","Rep Lipinski (Chief of Staff), Rep Acevedo Vila (Legislative Director), Rep McKinney (Legislative Director).","Rep. Lipinski - Chief of Staff Rep. Acevedo-Vila - Legislative Director Rep. McKinney - Legislative Director","Rep Lipinski - Chief of Staff Rep Acevedo-Villa - Legislative Director Rep McKinney - Legislative Director","Rep Lipinski - Chief of Staff Resident Commissioner Acevedo-Vila - Legislative Director Rep McKinney - Legislative Director","Rep Lipinski - Chief of Staff Resident Commissioner Acevedo-Vila, Legislative Director Rep McKinney, Legislative Director","Congressman Lipinski, Chief of Staff, Congressman Acevedo-Villa, Chief of Staff, Congressman McKinney, Legislative Director","Congressman Lipinski - Chief of Staff, Assistant House Science, Space &Technology Committee - Legislative Director Congressman Acevedo-Vila- Legislative Director Congressmen McKinney - Legislative Director","Transportation infrastructure and funding, specifically as it relates to expansion of its Metrolink system.","Rep Lipinski - Chief of Staff Rep Acevedo-Villa - Chief of Staff Rep McKinney - Chief of Staff","Congressman Lipinski, Chief of Staff Congressman Acevedo-Villa, Legislative Director Congressman McKinney, Legislative Director","Congressman Lipinski, Chief of Staff Congressman Acevedo- Villa, Legislative Director Congressman McKinney, Leg","Congressman Lipinski Chief of Staff Congressman Acevedo-Villa, Legislative Director Congressman McKinney, Legislative Director","Congressman Lipinski, Chief of Staff Congressman Acevedo- Villa, Legislative Director Congressman McKinney, Legislative Director","Congressman Lipinski, Chief of Staff, Congressman Acevedo-Villa, Legislative Director, Congressman McKinney, Legislative Director","Congressman Lipinski, Chief of Staff, Congressman Acevedo-Villa, Legislative Director, Congressman Lipinski, Legislative Director","Congressman Lipinski, Chief of Staff, Congressman Acevedo-Villa, Legislative Director, Congressman McKinney, Legislative Director,","Congressman Lipiniski, Chief of Staff Congressman Acevedo-Villa, Legislative Director Congressman McKinney, Legislative Director","Congressman Lipinski, Chief of Staff Congressman Acevedo-Villa, Legislative Director Congressman McKinnery, Legislative Director","Congressman Lipiniski - Chief of Staff Congressman Acevedo-Villa - Legislative Director Congressman McKinney - Legislative Director","Rep Lipinski - Chief of Staff Rep Avevedo-Villa - Chief of Staff Rep McKinney - Chief of Staff","Chief of Staff - Rep. Lipinski, Legislative Director - Rep Acevedo, Legislative Director Rep. Acevedo.","Chief of Staff - Rep Lipinski Legislative Director - Rep Acevedo-Villa Legislative Director - Rep McKinney","Rep Lipinski - Chief of Staff, Rep Avevedo-Villa - Chief of Staff, Rep McKinney - Chief of Staff.","Rep Lipinksi - Chief of Staff, Rep Acevedo-Villa, Chief of Staff, Rep McKinney - Chief of Staff.","Chief of Staff - Rep Lipinski Legislative Director - Rep Acevedo Vila","Chief of Staff - Rep Lipinshi Legislative Director - Rep Acevdo Vila Legislative Director - Rep McKinney","Chief of Staff - Rep Lipiniski, Legislative Director - Rep Acevedo Vila","Chief of Staff - Rep Lipinski, Legislative Director - Rep Acevedo Vila","Rep Lipinski - Chief of Staff, Legislative Director Rep Acevedo-Vila, Legislative Director Rep McKinney, Legislative Director","Chief of Staff - Rep Lipinski, Legislative Director - Rep Acevedo Vila, Legislative Director - Rep McKinney","Chief of Staff - Rep Lipinski, Legislative Director - Rep Acevedo Vila, Legislative Director - Rep McKinney.","Rep Lipinski - Chief of staff, Rep Avevedo-Villa - Legislative Director, Rep McKinney - Legislative Director."],"totalFilings":1077,"yearlyActivity":[{"year":2019,"filings":24,"clients":7,"firms":1,"issues":["TRD","TRA","BUD","FOO","ANI","TEC","ENV","TAX","LBR","AVI"]},{"year":2020,"filings":51,"clients":12,"firms":1,"issues":["TEC","FOO","ANI","TRD","TAX","BUD","LBR","AVI","TRA","SMB","TAR","ENV","IMM","ENG","DEF"]},{"year":2021,"filings":82,"clients":14,"firms":1,"issues":["BUD","ENV","TAX","LBR","AGR","IMM","TRA","TEC","MAR","DIS","HCR","TRD","FOO","ANI","ENG","SCI","DEF"]},{"year":2022,"filings":101,"clients":16,"firms":1,"issues":["TRA","ENG","LBR","BUD","TAX","IMM","AGR","MAR","ENV","ANI","FOO","TEC","DIS","HCR","TRD","SCI","AUT","DEF"]},{"year":2023,"filings":266,"clients":34,"firms":1,"issues":[]},{"year":2024,"filings":274,"clients":28,"firms":1,"issues":["AVI","CSP","DEF","FIN","TRA","AUT","TAX","TOU","TRD","AGR","ENV","NAT","BUD","DIS","PHA","HCR","HOU","CAW","BAN","ECN","VET","MAR","LBR","IMM","ENG","MMM","LAW","TAR","FOO","ANI"]},{"year":2025,"filings":279,"clients":27,"firms":1,"issues":["BUD","TRA","HOU","DIS","HCR","DEF","ECN","AVI","VET","ANI","FOO","ENG","AUT","TAX","CSP","FIN","TOU","TRD","MAR","LBR","IMM","AGR","ENV","PHA","CAW","BAN","MMM","LAW","NAT","SCI","TAR"]}],"topClients":[{"name":"CJ LAKE, LLC (ON BEHALF OF COUNTY OF ALAMEDA, CALIFORNIA)","filings":89},{"name":"ENTERPRISE HOLDINGS, INC. DBA ENTERPRISE MOBILITY","filings":70},{"name":"DIAMOND PET FOODS INC.","filings":57},{"name":"COUNTY OF MERCED","filings":54},{"name":"ANACOSTIA WATERSHED SOCIETY","filings":45},{"name":"CJ LAKE, LLC (ON BEHALF OF CITY OF THORNTON)","filings":45},{"name":"CJ LAKE, LLC (ON BEHALF OF MARCH JOINT POWERS AUTHORITY)","filings":44},{"name":"WPC TECHNOLOGIES","filings":41},{"name":"NATIONAL MILK PRODUCERS FEDERATION","filings":36},{"name":"BAYER U.S. LLC","filings":36},{"name":"CJ LAKE, LLC (ON BEHALF OF SAN JOAQUIN COUNCIL OF GOVERNMENTS)","filings":30},{"name":"ADVANCED THERMOVOLTAIC SYSTEMS INC. (FORMERLY BERKEN ENERGY LLC)","filings":28},{"name":"KANSAS CITY AREA TRANSPORTATION SYSTEM (FKA KC AREA TRANSPORTATION AUTHORITY)","filings":27},{"name":"CJ LAKE, LLC (ON BEHALF OF FRESNO COMMUNITY HOSPITAL AND MEDICAL CENTER)","filings":27},{"name":"OUTDOOR AMUSEMENT BUSINESS ASSOCIATION","filings":25},{"name":"TRANSITAMERICA SERVICES","filings":24},{"name":"SES AMERICOM INC.","filings":22},{"name":"RDP (FORMERLY VENTURA COUNTY COMMUNITY - NAVY ACTION PARTNERSHIP)","filings":22},{"name":"COALITION OF HOPE FOUNDATION","filings":21},{"name":"ALAMEDA COUNTY TRANSPORTATION COMMISSION","filings":21},{"name":"LINDSAY CORP.","filings":20},{"name":"EXPEDIA GROUP","filings":20},{"name":"US STRATEGIC METALS","filings":20},{"name":"H-J ENTERPRISES","filings":20},{"name":"CJ LAKE, LLC (ON BEHALF OF CALIFORNIA STATE SENATE)","filings":18},{"name":"SAN DIEGO COMMUNITY POWER","filings":18},{"name":"BRIGGS AND STRATTON","filings":18},{"name":"BI-STATE DEVELOPMENT AGENCY","filings":18},{"name":"GENESIS SYSTEMS, LLC","filings":16},{"name":"CJ LAKE, LLC (ON BEHALF OF BAY AREA RAPID TRANSIT DISTRICT)","filings":15},{"name":"SAN JOAQUIN COUNCIL OF GOVERNMENTS","filings":15},{"name":"A3 GLOBAL, INC.","filings":14},{"name":"HUSCH BLACKWELL ON BEHALF OF THE SNY ISLAND LEVEE DRAINAGE DISTRICT","filings":13},{"name":"HUSCH BLACKWELL LLP ON BEHALF OF MONARCH-CHESTERFIELD LEVEE DISTRICT","filings":13},{"name":"HUSCH BLACKWELL ON BEHALF OF THE FABIUS RIVER DRAINAGE DISTRICT","filings":12},{"name":"GREAT LAKES DREDGE & DOCK COMPANY, LLC","filings":11},{"name":"JOBY AERO","filings":9},{"name":"VIAMERICAS","filings":8},{"name":"CJ LAKE, LLC (ON BEHALF OF COUNTY OF MERCED)","filings":6},{"name":"CONGAREE RIVER GROUP LLC (OBO WEJO DATA SERVICES, INC.)","filings":5},{"name":"AMERICAN GOLF INDUSTRY COALITION","filings":5},{"name":"CJ LAKE, LLC (ON BEHALF OF SAN JOAQUIN VALLEY AIR POLLUTION CONTROL DISTRICT)","filings":4},{"name":"5G EVERYWHERE IN AMERICA LLC","filings":3},{"name":"CJ LAKE, LLC (ON BEHALF OF ALAMEDA COUNTY TRANSPORTATION COMMISSION)","filings":3},{"name":"SEVEN W AND AFFILIATES","filings":2},{"name":"HUSCH BLACKWELL LLP ON BEHALF OF COALITION OF AMERICAN SPECIALTY GLASS USERS","filings":2},{"name":"CJ LAKE, LLC (ON BEHALF OF VENTURA COUNTY COMMUNITY-NAVY ACTION PARTNERSHIP)","filings":2},{"name":"SAN JOAQUIN VALLEY AIR POLLUTION CONTROL DISTRICT","filings":2},{"name":"KANSAS CITY AREA TRANSPORTATION AUTHORITY","filings":1}],"firms":[{"name":"HB STRATEGIES","filings":1077}],"issues":["TRD","TRA","BUD","FOO","ANI","TEC","ENV","TAX","LBR","AVI","SMB","TAR","IMM","ENG","DEF","AGR","MAR","DIS","HCR","SCI","AUT","CSP","FIN","TOU","NAT","PHA","HOU","CAW","BAN","ECN","VET","MMM","LAW"]}