{"id":64081,"name":"ERIN SIEFRING","slug":"erin-siefring","revolvingDoor":true,"governmentPositions":["Confidential Assistant, US Department of Housing and Urban Development, Secretary Mel Martinez\nLegislative Director, Representative Tom Feeney (FL)\nChief of Staff, Representative Dave Brat (VA)","Congressman Tom Feeney, Legislative Director Congressman Dave Bratt, Chief of Staff","Congressman Tom Feeney, Legislative Director. Congressman Dave Bratt, Chief of Staff","Confidential Assistant, US Department of Housing and Urban Development, Secretary Mel Martinez Legislative Director, Representative Tom Feeney (FL) Chief of Staff, Representative Dave Brat (VA)","Chief of staff, Rep. Dave Brat, Legislative Director, Rep. Tom Feeney, Confidential Assistant, HUD","Rep. Dave Brat, Chief of Staff Rep. Tom Feeney, Legislative Director Department of Housing and Urban Development, Confidential Assistant","Chief of Staff, Rep. Dave Brat (Va) Legislative Director, Rep. Tom Feeney (FL) Confidential Assistant, Department of Housing and Urban Development","Chief of Staff, Rep. Dave Brat (VA) Legislative Director, Rep. Tom Feeney (FL) Confidential Assistant, Department of Housing and Urban Development","Chief of Staff, Rep. Dave Brat (R-VA) Legislative Director, Rep. Tom Feeney (R-FL) Confidential Assistant, Department of Housing and Urban Development, Secretary Mel Martinez","COS, Rep. Dave Brat LD, Rep. Tom Feeney Special Assistant, HUD","Special Assistant, HUD Rep. Tom Feeney, Legislative Director Rep. Dave Brat, Chief of Staff","COS, Rep. Dave Brat (VA) LD, Rep. Tom Feeney (FL) Special Assistant, HUD","COS, Rep. Dave Brat; LD, Rep. Tom Feeney; Special Assistant, HUD","COS, Rep. Dave Brat; LD, Rep. Tom Feeney, Special Assistant, HUD"],"totalFilings":133,"yearlyActivity":[{"year":2018,"filings":8,"clients":2,"firms":1,"issues":["IMM","EDU"]},{"year":2019,"filings":8,"clients":2,"firms":1,"issues":["IMM","EDU"]},{"year":2020,"filings":14,"clients":5,"firms":1,"issues":["EDU"]},{"year":2021,"filings":17,"clients":4,"firms":1,"issues":["EDU"]},{"year":2022,"filings":22,"clients":5,"firms":1,"issues":["EDU","HOU"]},{"year":2023,"filings":16,"clients":4,"firms":1,"issues":[]},{"year":2024,"filings":17,"clients":5,"firms":1,"issues":["EDU","HOU","BAN","FIN"]},{"year":2025,"filings":31,"clients":4,"firms":1,"issues":["SCI","CPI","TAX","HOU","FIN","ENG","LBR","GOV"]}],"topClients":[{"name":"GOOGLE CLIENT SERVICES LLC (FKA GOOGLE)","filings":20},{"name":"AMAZON","filings":18},{"name":"MICROSOFT","filings":18},{"name":"NATIONAL LOW INCOME HOUSING COALITION","filings":16},{"name":"COMUNITY PRESERVATION CORPORATION","filings":14},{"name":"WORKDAY, LLC","filings":14},{"name":"COMPUTER SCIENCE EDUCATION COALITION","filings":11},{"name":"META PLATFORMS, INC. (FKA FACEBOOK)","filings":11},{"name":"RELATED EB-5 REGIONAL CENTER HOLDINGS, LLC","filings":8},{"name":"NATIONAL COUNCIL OF NONPROFITS(FORMERLY KNOWN AS THE NATIONAL COUNCIL OF NONPRO","filings":3}],"firms":[{"name":"HILLTOP ADVOCACY","filings":133}],"issues":["IMM","EDU","HOU","BAN","FIN","SCI","CPI","TAX","ENG","LBR","GOV"]}