{"name":"JAMES BURTON","slug":"james-burton","positions":["- Staff Assistant, Senator David Perdue; Special Assistant, Senate Committee on Indian Affairs","Staff Assistant, Senator David Perdue; Special Assistant, Senate Committee on Indian Affairs","Special Asst - Sen. Indian Affairs Cmte; Staff Asst - Sen. David Perdue","Special Asst. - Senate Cmte on Indian Affairs; Staff Asst. - Sen. David Perdue","Special Asst. - Sen. Cmte on Indian Affairs; Staff Asst. - Sen. David Perdue","Special Asst - Senate Cmte on Indian Affairs; Staff Asst. - Sen. David Perdue","Special Asst. - Senate Cmte on Indian Affairs","Special Asst - Senate Cmte on Indian Affairs","Special Asst - Senate Cmte on Indian Affairs; Staff Asst - Sen. David Perdue","Spec.Asst. Senate Cmte on Indian Affairs; Staff Asst. Senator David Perdue","Spec. Asst - Senate Cmte on Indian Affairs; Staff Asst. - Senator David Perdue","Spec Asst - Senate Cmte on Indian Affairs; Staff Asst - Sen. David Perdue","Spec. Asst. - Senate Cmte on Indian Affairs; Staff Asst. - Sen. David Perdue","Spec Asst - Senate Cmte on Indian Affairs","Special Asst. - Senate Cmte on Indian Affairs; Staff Asst - Sen. David Perdue","Special Asst - Senate Cmte on Indian Affairs; Staff Assistant - Sen. David Perdue","Special Asst - Senate Cmte on Indian Affairs, Staff Asst - Sen. David Perdue","Special Asst - Senate Indian Affairs Cmte; Staff Assistant - Sen. David Perdue","Special Assistant - Sen. Committee on Indian Affairs; Staff Asst. - Sen. David Perdue","Special Assistant - Senate Comm. on Indian Affairs; Staff Asst. - Sen. David Perdue","Special Asst. - Senate Comm. on Indian Affairs; Staff Asst. - Sen. David Perdue","Special Asst - Senate Comm on Indian Affairs; Staff Asst - Sen. David Perdue"],"firms":["CLARK HILL, PLC"],"clients":["ASSOCIATION OF UNIVERSITIES FOR RESEARCH IN ASTRONOMY, INC.","CITY OF BALTIMORE","MICHIGAN MINORITY SUPPLIER DEVELOPMENT COUNCIL","AIR MARSHAL ASSOCIATION","WOLF CREEK RAILROAD LLC","FIRST 5 CALIFORNIA","INVENTUS POWER","MASTRONARDI PRODUCE-USA INC","NATIONAL WOMENS LAW CENTER","NATIONAL CONSUMERS LEAGUE","NATIONAL DIAPER BANK NETWORK","ZERO TO THREE","AMERICAN CANCER SOCIETY CANCER ACTION NETWORK, INC.","CURATORS OF THE UNIVERSITY OF MISSOURI","CLEAN HARBORS ENVIRONMENTAL SERVICES, INC.","KBR, INC. F/K/A SGT, INC.","MORGAN STATE UNIVERSITY FOUNDATION","SHEPPARD PRATT HEALTH SYSTEM","SOUTHEASTERN UNIVERSITIES RESEARCH ASSOCIATION, INC.","VERU, INC.","FLORIDA INTERNATIONAL UNIVERSITY","UNIVERSITY OF PENNSYLVANIA PERELMAN SCHOOL OF MEDICINE","UNIVERSITY OF CONNECTICUT","BOYD WATTERSON GSA REIT","BLUE ORIGIN, LLC","UNIVERSITY OF CALIFORNIA, SAN FRANCISCO"],"filings":229,"issues":[]}