{"id":40279,"name":"JAMES HYLAND","slug":"james-hyland","revolvingDoor":true,"governmentPositions":["Staff Asst. to Sen. John Warner; Counsel, House Banking Committee; Subcomm. Staff Dir. Senate Banking Committee; Leg. Dir. Sen. Faircloth; Senator KB Hutchison","aide to Senator John Warner; Staff and Counsel House Banking Committee; LD to Senator Faircloth (R-NC) and Kay Bailey Hutchison (R-TX); Staff Dir. Financial Ins. Subcommittee Senate Banking Committee.","former staff to Senator John Warner; staff of oSenate Banking and House Financial Services Committee; Leg. Director to Senator Faircloth and KB Hutchison.","Senator Kay Bailey Hutchison - Legislative Director; Senate Lauch Faircloth - Legislative Director; Senate Banking Committee, Financial Institutions Subcommittee Staff Director; House Banking Committee, Assistant Staff Director and Senior Counsel.","Aide to Sen. John Warner (VA); Counsel to House and Senate Banking Committees; Leg. Director to Sen. Lauch Faircloth (NC) and Sen. Kay Bailey Hutchison (TX).","Staff of Senate Banking; House Financial Services; Leg Director to Senator Faircloth (R-NC) and Senator Kay Bailey Hutchison (R-TX); Staff to Senator John Warner (R-VA).","former assistant to Senator John Warner; former staff of House Banking Committee (now FSC); Leg Director to Sen. Faircloth and Sen. Kay Bailey Hutchison.","Staff Asst. to Sen. John Warner; Counsel, House Banking Committee; Subcomm. Staff Dir. Senate Banking Comm.; Leg Dir. to Sen. Lauch Faircloth; Leg. Dir to Sen. Kay Bailey Hutchison.","Aide to Senator John Warner (VA); Counsel to House and Senate Banking Committees; Legislative Director to Senator Faircloth (NC) and Senator Hutchison (TX)","Former Leg. Director to Sen. Kay Bailey Hutchison (R-TX)","Former Legislative Director to Senator Kay Bailey Hutchison (R-TX) and Senator DM Faircloth (R-NC)."],"totalFilings":220,"yearlyActivity":[{"year":2018,"filings":29,"clients":7,"firms":1,"issues":["BAN","TAX","FIN","ECN","BUD"]},{"year":2019,"filings":29,"clients":7,"firms":1,"issues":["BAN","TAX","ECN","BUD","FIN"]},{"year":2020,"filings":35,"clients":8,"firms":1,"issues":["BAN","TAX","ECN","BUD","FIN"]},{"year":2021,"filings":30,"clients":6,"firms":1,"issues":["BAN","TAX","SMB","FIN","BUD","ECN"]},{"year":2022,"filings":35,"clients":6,"firms":1,"issues":["TAX","SMB","ECN","BUD","FIN","BAN"]},{"year":2024,"filings":30,"clients":7,"firms":1,"issues":["BAN","FIN","BUD","ECN","TAX","SMB"]},{"year":2025,"filings":32,"clients":7,"firms":1,"issues":["BAN","TAX","BUD","FIN","SMB","ECN"]}],"topClients":[{"name":"TEXAS LAND TITLE ASSOCIATION","filings":48},{"name":"OFFICE OF THE STATES OF THE APPALACHIAN REGION","filings":42},{"name":"AMERICAN CRAFT SPIRITS ASSOCIATION","filings":38},{"name":"AMERICAN SHARE INSURANCE","filings":26},{"name":"THE NORTH AMERICAN SECURITIES ADMINISTRATORS ASSOCIATION","filings":17},{"name":"TEXAS CREDIT UNION LEAGUE (CORNERSTONE CREDIT UNION LEAGUE)","filings":16},{"name":"GPS CAPITAL MARKETS","filings":11},{"name":"UNIVERSITY OF NORTH CAROLINA AT WILMINGTON","filings":11},{"name":"ASSOCIATED FOREIGN EXCHANGE","filings":8},{"name":"CALIFORNIA LAND TITLE ASSOCIATION","filings":3}],"firms":[{"name":"THE PENNSYLVANIA AVENUE GROUP","filings":220}],"issues":["BAN","TAX","FIN","ECN","BUD","SMB"]}