{"name":"JAN FOWLER","slug":"jan-fowler","positions":["Intern; Representative McCrery","Leg. Asst, Sen. Voinovich; Leg. Asst, Sen. Voinovich; Leg. Asst, Rep. McCrery; Leg. Correspondent, Rep. McCrery; Staff Asst., Rep. McCrery, Intern, Rep. McCrery","Leg. Asst, Sen. Voinovich; Leg. Asst., Leg. Correspondent, Staff Assistant, Intern for Rep. McCrery","Leg. Asst, Sen. Voinovich; Leg. Assistant, Leg. Correspondent, Staff Asst, Intern for Rep. McCrery","Leg. Asst., Sen. Voinovich; Leg. Asst., Leg Corr., Staff Asst., and Intern Rep McCrery","Leg. Asst, Sen. Voinovich; Leg Asst., Leg. Correspondent, Staff Asst., Intern Rep. McCrery","Leg. Asst, Sen. Voinovich; Leg. Asst, Leg Correspondent, Staff Asst, Intern Rep. McCrery","Leg. Asst, Sen. Voinovich; Leg. Asst, Leg. Correspondent, Staff Asst., Intern for Rep. McCrery","Legislative Assistant, Senator Voinovich Legislative Asst., Legislative Correspondent, Staff Assistant, Intern for Rep. McCrery","Leg. Asst, Sen. Voinovich; Leg. Assistant, Leg. Correspondent, Staff Assistant, Intern from Rep. McCrery","​Leg. Asst., Sen. Voinovich; Leg. Asst., Leg. Corr., Staff Asst, and Intern Rep. McCrery","Policy Adv., Sen. Rep. Conference: Leg. Director Sen. Blunt; Leg. Dir. Rep. Blunt; Sr. Policy Adv. Rep. Maj. Whip; Sr. Policy Adv. House Maj. Whip; Research Analyst, House Maj. Whip; Spec. Asst to the Chief Deputy Whip Blunt"],"firms":["THE WASHINGTON TAX & PUBLIC POLICY GROUP"],"clients":["COMCAST CORPORATION","GENERAL MOTORS COMPANY","ECONOMIC INNOVATION GROUP","ALTRIA CLIENT SERVICES LLC","ORGANIZATION FOR INTERNATIONAL INVESTMENT","LUMEN TECHNOLOGIES (FORMERLY KNOWN AS CENTURYLINK, INC.)","TAX REFORM COALITION","LINCOLN INFRASTRUCTURE USA INC.","PLUG POWER INC.","SUNTORY GLOBAL SPIRITS (FORMERLY BEAM SUNTORY INC.)","YUM! BRANDS","HSBC GR-CORP","APPLIED MATERIALS, INC.","ALLIANZ REAL ESTATE OF AMERICA LLC","CELGENE CORPORATION","CATERPILLAR INC","HEWLETT PACKARD ENTERPRISE COMPANY","JOHNSON & JOHNSON SERVICES INC","BAYER CORPORATION (FORMERLY KNOWN AS MONSANTO COMPANY)","NATIONAL RURAL ELECTRIC COOPERATIVE ASSOCIATION","NEXTERA ENERGY CAPITAL HOLDINGS INC. (FORMERLY NEXTERA ENERGY INC.)","PACIFIC INVESTMENT MANAGEMENT COMPANY LLC","PFIZER, INC.","THE GOODYEAR TIRE & RUBBER COMPANY","PROCTER & GAMBLE COMPANY","ALLIANZ CAPITAL PARTNERS GMBH","ALLIANCE FOR BIOPHARMACEUTICAL COMPETITIVENESS AND INNOVATION","THE COCA COLA COMPANY","AMT REFUND COALITION","MACK ENERGY CORPORATION","FEDEX CORPORATION","LEGGETT & PLATT, INC."],"filings":163,"issues":[]}