{"name":"JENNY ROSENBERG","slug":"jenny-rosenberg","positions":["Acting Asst. Sec. for Aviation & Intl Affairs, US DOT; Asst. Administrator for Comms., FAA; Comms Dir., Senate Commerce Committee; Comms Dir., House OGR Committee; Dep. Comms. Dir., U.S. Sen. Russ Feingold.","Acting Asst. Sec. for Aviation&Intl Affairs, USDOT; Asst. Admin. for Comms., FAA; Comms. Dir., Senate Commerce Committee; Comms. Dir., House OGR Committee; Press Sec., Senate Approps Committee; Dep. Comms Dir., U.S. Sen. Russ Feingold.","US DOT Asst. Sec. Aviation Intl Affairs (Acting); FAA Asst. Admin. Communications; Comms Director, Senate Commerce Committee; Press Secretary, Senate Approps Committee; Comms Director, House Oversight Committee.","DOT: Asst. Sec. Aviation and Intl Affairs (Acting); FAA: Asst. Admin. Communications; Comms Director, Senate Commerce Committee; Comms Director, House Oversight Committtee; Press Sec, Senate Approps Committee.","U.S. DOT Asst. Sec. Aviation & Int'l Affairs (Acting); FAA Asst. Administrator for Comms; Senate Commerce Cmte Comms Director; Senate Approps Press Secretary; House OGR Comte Comms Dir.","DOT Asst. Sec. Aviation & Int'l Affairs (Acting); FAA Asst. Admin.for Comms.; Senate Commerce Cmt Comms Dir; Senate Approps Cmte Press Sec; House OGR Cmte Comms Dir.","DOT Asst. Sec. Aviation & Int'l Affairs (Acting); FAA Asst. Admin. Comms.; Senate Commerce Cmte. Comms Dir.; Senate Approps. Cmte. Press Sec.; House OGR Cmte. Comms. Dir.","US DOT ASST SEC AVIATION & INT'L AFFAIRS (ACTING); FAA ASST. ADMIN. COMMS; COMMS DIR, SENATE COMMERCE COMMITTEE; PRESS SECRETARY, SENATE APPROPS COMMITTEE; COMMS DIRECTOR, HOUSE OVERSIGHT COMMITTEE.","U.S. DOT ASST SEC AVIATION & INT'L AFFAIRS (ACTING); FAA ASST. ADMIN. COMMS; COMMS DIR, SEN. COMMERCE COMMITTEE; PRESS SECRETARY, SEN APPROPS COMMITTEE; COMMS DIR, HOUSE OVERSIGHT COMMITTEE.","Asst. Administrator, Federal Aviation Administration; Communications Director, Senate Commerce Committee.","Acting Asst. Secretary for Aviation and Int'l Affairs, U.S. DOT; FAA Assistant Administrator; Communications Director, Senate Commerce Committee.","Acting Asst. Secretary for Aviation and Int'l Affairs, U.S. DOT;\nFAA Assistant Administrator; Communications Director,\nSenate Commerce Committee.","DOT: Asst. Sec. Aviation and Int'l Affairs (Acting); FAA: Asst. Admin.; Comms Director, Senate Commerce Committee; Comms Director, House Oversight Committee.","DOT: Asst. Sec. Aviation and Intl Affairs (Acting); FAA: Asst. Admin. Communications; Comms Director, Senate Commerce Committee; Comms Director, House Oversight Committee; Press Sec, Senate Approps Committee.","DOT: Asst Sec Aviation and Intl Affairs (Acting); FAA: Asst Admin Comms; Comms Director: Senate Commerce Committee, House Oversight Committee; Press Secretary: Senate Approps Committee.","DOT: ASST SEC AVIATION & INT'L AFFAIRS (ACTING); FAA: ASST ADMIN COMMS; COMMS DIR: SENATE COMMERCE COMMITTEE, HOUSE OVERSIGHT COMMITTEE; PRESS SECRETARY: SENATE APPROPS COMMITTEE.","Acting Asst. Secretary for Aviation and Int'l Affairs - US DOT Asst. Admin. for Comms - FAA Comms. Dir - US Senate Commerce Committee","Acting Asst. Sec. for Aviation & Int'l Affairs - US DOT Asst. Admin. for Comms. - FAA Comms. Director - US Senate Commerce Committee","Acting Asst. Sec. for Aviation Int'l Affairs, US DOT Asst. Admin., FAA Comms Director, U.S. Senate Commerce, U.S. House Oversight, Gov't Reform Press Sec, U.S. Senate Approps. Comms Dir, U.S. Dept. HHS, OASH","Acting Asst Sec for Aviation, Int'l Affairs, US DOT Asst Admin, FAA Comms Director, US Senate Commerce, US House Committee Oversight & Gov Reform Press Sec, US Senate Approps Committee Comms Dir, US HHS, OASH","FAA - Assistant Administrator for Communications DOT - Assistant Secretary for Aviation and International Affairs (Acting)","US DOT ASST SEC AVIATION & INT'L AFFAIRS (ACTING); FAA ASST. ADMIN. COMMS; COMMS DIR, SENATE COMMERCE COMMITTEE; PRESS SECRETARY, SENATE APPROPS COMMITTEE; COMMS DIRECTOR, HOUSE OVERSIGHT COMMITTEE.  ","USDOT-Asst Sec Aviation & Int'l Affairs (Acting) FAA - Asst Administrator US Senate Commerce Committee - Comms Director US Senate Approps Committee - Press Sec","U.S. Senate Appropriations Committee - Press Secretary","US DOT - Aviation and International Affairs FAA - Assistant Administrator Senate Commerce - Comms Director Senate Appropriations - Press Secretary House Oversight - Comms Director","US DOT Aviation and International Affairs FAA Asst Administrator Senate Appropriations Committee Senate Commerce Committee House Oversight Committee","US DOT - Aviation and International Affairs FAA - Asst Administrator US Senate - Commerce and Appropriations Committees US House - Oversight Committee","US DOT - Office of Aviation and International Affairs FAA - Asst Administrator US Senate - Commerce and Appropriations Committees US House - Oversight Committee","US DOT - AVIATION AND INTERNATIONAL AFFAIRS FAA - ASST ADMINISTRATOR US SENATE COMMERCE AND APPROPRIATIONS COMMITTEES - STAFF","US DOT - AVIATION + INT'L AFFAIRS FAA - ASS'T ADMINISTRATOR US SENATE COMMERCE AND APPROPRIATIONS COMMITTEES - STAFF","US DOT - ASST SEC FOR AVIATION + INT'L AFFAIRS (A) FAA - ASST ADMINISTRATOR US SENATE COMMERCE COMMITTEE - STAFF","US DOT - Ass't. Admin. for Aviation & Int'l Affairs (A) FAA - Assistant Administrator","US DOT - Asst Sec for Aviation + Int'l Affairs (A) FAA - Asst Administrator","US DOT - Asst Sec for Aviation + Int'l Affairs (A) FAA - Assistant Administrator","Asst Sec for Aviation and Int'l Affairs - US DOT US Senate Commerce Committee US Senate Appropriations Committee","Asst. Sec. Aviation + Int'l Affairs (Acting) - US DOT Asst. Administrator - FAA US Senate Commerce Committee Staff US Senate Appropriations Committee Staff","Asst. Sec. Aviation Int'l Affairs (Acting), US DOT Asst. Administrator, FAA US Senate Commerce Committee Staff US Senate Appropriations Committee Staff","U.S. Senate Commerce Committee - Staff FAA Asst. Administrator US DOT Asst. Sec. Aviation + Int'l Affairs (Acting)","US DOT - Asst Sec Aviation + Int'l Affairs (Acting) FAA - Asst Administrator US Senate Commerce Committee - Staff US Senate Approps Committee - Staff US House Oversight + Gov Reform - Staff","US Senate Commerce Committee - Staff US DOT - Asst Sec for Aviation and Int'l Affairs (Acting) FAA - Asst Administrator","US DOT Acting Asst Secretary - Aviation/Int'l Affairs FAA Assistmant Administrator U.S. House: OGR U.S. Senate Appropriations Commerce","US DOT - Asst Sec Aviation Int'l Affairs FAA - Assistant Administrator House - Oversight Committee Senate - Appropriations and Commerce Committees","US DOT - Asst Sec Aviation + Int'l Affairs (Acting) FAA - Assistant Administrator US House - OGR Committee Staff US Senate - Approps and Commerce Committees Staff","US DOT - Asst. Sec. for Aviation and Int'l Affairs (A) FAA - Asst. Administrator US Senate Commerce Committee - Dir. of Comms.","US DOT ASST SECRETARY FOR AVIATION AND INTL AFFAIRS (A) FAA ASST ADMINISTRATOR US SENATE COMMERCE COMMITTEE - STAFF US SENATE APPROPRIATIONS COMMITTEE - STAFF"],"firms":["JTR STRATEGIES LLC"],"clients":["JETBLUE AIRWAYS","THORN RUN PARTNERS O/B/O ALLIANCE FOR DRONE INNOVATION","ATLAS AIR WORLDWIDE","THORN RUN PARTNERS O/B/O FEDEX CORPORATION","THORN RUN PARTNERS-PARTNERSHIP FOR INFRASTRUCTURE PROJECT EXCELLENCE","IAERO GROUP","STREETLIGHT DATA, INC.","THORN RUN PARTNERS O/B/O CARGO AIRLINE ASSOCIATION","ALASKA AIRLINES","PANGIAM","ZIPLINE","TOWN OF LEESBURG","AURA NETWORK SYSTEMS","JSX","ARCHER","WHISKER LABS","STRATOLAUNCH","AERO TECHNOLOGIES, INC.","FERROVIAL AIRPORTS","VERTICAL AVIATION INTERNATIONAL (VAI)","ELECTRA.AERO","ROHDE & SCHWARZ USA, INC.","VECTOR AIRPORT SYSTEMS","AVIDYNE","THALES USA"],"filings":216,"issues":[]}