{"id":39722,"name":"JOHN DUNCAN","slug":"john-duncan","revolvingDoor":true,"governmentPositions":["AA to Senator William V. Roth, Jr Deputy Undersecretary, Department of Treasury","Deputy Undersecretary Department of Treasury AA to former Senator William V. Roth","Deputy Undersecretary Department of the Treasury, AA to Senator William V. Roth, Jr","Deputy Undersecretary, Department of the Treasury, AA to Senator William V. Roth, Jr","Deputy Undersecretary Department of the Treasury AA Senator William V. Roth, Jr","AA to Senator William V. Roth, JR and Deputy Undersecretary Department of Treasury","Deputy Undersecretary Department of Treasury, AA to Senator William V. Roth, Jr.","AA Senator William V. Roth, Jr and Deputy Undersecretary Department of Treasury","Administrative Assistant for Senator William V. Roth, Jr and Deputy Undersecretary for Congressional Affairs, Department of Treasury","Deputy Undersecretary Department of the Treasury, AA Senator William V. Roth, Jr.","Deputy Undersecretary for Legislative Affairs, Department of the Treasury","AA to Senator William V. Roth, Jr., Deputy Undersecretary, Department of Treasury"],"totalFilings":105,"yearlyActivity":[{"year":2018,"filings":32,"clients":3,"firms":1,"issues":["BUD","GOV","TAX","LBR","FIN","BAN","TRA","HOU"]},{"year":2019,"filings":10,"clients":2,"firms":1,"issues":["BUD","GOV","FIN","TAX","LBR"]},{"year":2020,"filings":14,"clients":2,"firms":1,"issues":["LBR","FIN","TAX","BUD","GOV"]},{"year":2021,"filings":22,"clients":2,"firms":1,"issues":["BUD","GOV","FIN","TAX","ECN"]},{"year":2022,"filings":20,"clients":2,"firms":1,"issues":["FIN","TAX","ECN","BUD","GOV"]},{"year":2024,"filings":3,"clients":1,"firms":1,"issues":["FIN"]},{"year":2025,"filings":4,"clients":1,"firms":1,"issues":["FIN"]}],"topClients":[{"name":"THE LIVINGSTON GROUP (ON BEHALF OF THE INVESTMENT COMPANY INSTITUTE)","filings":52},{"name":"SHARED SERVICES LEADERSHIP COALITION","filings":38},{"name":"S&P GLOBAL (FORMALLY MCGRAW-HILL FINANCIAL)","filings":15}],"firms":[{"name":"JOHN DUNCAN AND ASSOCIATES, LLC","filings":105}],"issues":["BUD","GOV","TAX","LBR","FIN","BAN","TRA","HOU","ECN"]}