{"id":145286,"name":"JOHN ASSINI","slug":"john-assini","revolvingDoor":true,"governmentPositions":["Senator Baldwin - Legislative Staff Rep Panetta - Legislative Staff Senate Energy and Resources Committee - Majority Staff","Senator Baldwin, Legislative Assistant, Congressman Panetta, Legislative Assistant, Energy and Natural Resources Committee, Majority Staff","Senator Baldwin, Legislative Assistant, Congressman Panetta, Legislative Assistant, Energy and Natural Resources Committe, Majority Staff","Senator Baldwin, Legislative Assistant Congressman Panetta, Sr. Legislative Assistant Energy and Natural Resources Committee, Majority Staff","Senator Baldwin, Legislative Assistant, Congressman Panetta, Sr. Legislative Assistant, Energy and Natural Resources Committee, Majority Staff","Senator Baldwin, Legislative Assistant, Congressman Panetta, Sr. Legislative Assistant, Senate Energy and Natural Resources, Majority Staff","Senator Baldwin, Legislative Assistant, Congressman Panetta, Legislative Assistant, Senate Energy & Natural Resources Committee, Majority Staff","Senator Baldwin, Legislative Assistant, Congressman Panetta, Sr. Legislative Assistant, Senate Energy and Natural Resources Committee, Majority Staff","Senator Baldwin - Legislative Staff Rep Panetta - Legislative Staff Energy and Natural Resources Committee - Majority Staff","Senator Baldwin - Legislative Staff Rep Penetta - Legislative Staff Senate Energy and Natural Resources Committee - Majority Staff","Senator Baldwin, Legislative Assistant, Congressmen Panetta, Sr. Legislative Assistant, Energy and Natural Resources Committee, Majority Staff","Legislative Staff - Senator Baldwin, Legislative Staff - Rep Panetta, Senate Energy and Natural Resources Committee - Majority Staff","Legislative Staff - Senator Baldwin, Legislative Staff - Rep Panetta, Senate Energy and Natural Resources Committee - Majority Staff.","Senator Baldwin - Legislative Assistant Rep Panetta - Sr. Legislative Assistant Energy and Natural Resources Committee - Majority Staff","Senator Baldwin - Legislative Assistant Rep Panetta - Legislative Assistant Energy and Natural Resources Committee - Majority Staff","Senator Baldwin - Legislative Assistant, Rep Panetta - Legislative Assistant, Senate Energy & Natural Resources Committee - Majority Staff","Senator Baldwin - Legislative Staff Rep Panetta - Legislative Staff Senate Energy & Natural Resources Committee - Majority Staff","Senator Baldwin - Legislative Staff Rep Panetta - Legislative Staff SenateEnergy & Natural Resources Committee - Majority Staff"],"totalFilings":727,"yearlyActivity":[{"year":2022,"filings":103,"clients":13,"firms":1,"issues":["DEF","BUD","CAW","TRA","HOU","ECN","AVI","NAT","AGR","DIS","MAR","HCR","TAX","ENV","EDU","LAW","IMM","HOM","LBR"]},{"year":2023,"filings":243,"clients":20,"firms":1,"issues":[]},{"year":2024,"filings":185,"clients":14,"firms":1,"issues":["TOU","TRD","BUD","TRA","DIS","AGR","EDU","LAW","IMM","CSP","ENG","HOU","CAW","BAN","HCR","ECN","AVI","DEF","VET","NAT","MAR","LBR","MMM"]},{"year":2025,"filings":196,"clients":17,"firms":1,"issues":["LBR","EDU","BUD","TRA","HOU","DIS","AGR","LAW","IMM","CSP","ENG","HCR","DEF","ECN","AVI","VET","TOU","TRD","MAR","CAW","BAN","MMM","NAT"]}],"topClients":[{"name":"CJ LAKE, LLC (ON BEHALF OF COUNTY OF ALAMEDA, CALIFORNIA)","filings":107},{"name":"CJ LAKE, LLC (ON BEHALF OF CALIFORNIA STATE SENATE)","filings":102},{"name":"CJ LAKE, LLC (ON BEHALF OF CITY OF THORNTON)","filings":57},{"name":"CJ LAKE, LLC (ON BEHALF OF MARCH JOINT POWERS AUTHORITY)","filings":56},{"name":"COUNTY OF MERCED","filings":54},{"name":"CJ LAKE, LLC (ON BEHALF OF SAN JOAQUIN COUNCIL OF GOVERNMENTS)","filings":41},{"name":"CJ LAKE, LLC (ON BEHALF OF FRESNO COMMUNITY HOSPITAL AND MEDICAL CENTER)","filings":36},{"name":"CJ LAKE, LLC (ON BEHALF OF BAY AREA RAPID TRANSIT DISTRICT)","filings":35},{"name":"ALAMEDA COUNTY TRANSPORTATION COMMISSION","filings":30},{"name":"SAN DIEGO COMMUNITY POWER","filings":27},{"name":"CJ LAKE, LLC (ON BEHALF OF COUNTY OF MERCED)","filings":23},{"name":"RDP (FORMERLY VENTURA COUNTY COMMUNITY - NAVY ACTION PARTNERSHIP)","filings":22},{"name":"SAN JOAQUIN VALLEY AIR POLLUTION CONTROL DISTRICT","filings":22},{"name":"EXPEDIA GROUP","filings":20},{"name":"CJ LAKE, LLC (ON BEHALF OF CALSTART)","filings":15},{"name":"CJ LAKE, LLC (ON BEHALF OF ALAMEDA COUNTY TRANSPORTATION COMMISSION)","filings":15},{"name":"SAN JOAQUIN COUNCIL OF GOVERNMENTS","filings":15},{"name":"GREAT LAKES DREDGE & DOCK COMPANY, LLC","filings":11},{"name":"CJ LAKE, LLC (ON BEHALF OF SAN JOAQUIN VALLEY AIR POLLUTION CONTROL DISTRICT)","filings":10},{"name":"CJ LAKE, LLC (ON BEHALF OF VENTURA COUNTY COMMUNITY-NAVY ACTION PARTNERSHIP)","filings":8},{"name":"EBSCO PUBLISHING INC.","filings":8},{"name":"CJ LAKE, LLC (ON BEHALF OF GREAT LAKES DREDGE & DOCK COMPANY, LLC)","filings":4},{"name":"MISSOURI BEHAVIORAL HEALTH COALITION","filings":4},{"name":"ZURN ELKAY WATER SOLUTIONS","filings":3},{"name":"TOTAL WINE & MORE","filings":2}],"firms":[{"name":"HB STRATEGIES","filings":727}],"issues":["DEF","BUD","CAW","TRA","HOU","ECN","AVI","NAT","AGR","DIS","MAR","HCR","TAX","ENV","EDU","LAW","IMM","HOM","LBR","TOU","TRD","CSP","ENG","BAN","VET","MMM"]}