{"id":114059,"name":"JOSEF NOVOTNY","slug":"josef-novotny","revolvingDoor":true,"governmentPositions":["Reading Clerk:  Lorraine Miller - Clerk of the House\nReading Clerk:  Karen Haas - Clerk of the House\nReading Clerk:  Cheryl Johnson - Clerk of the House","Lorraine Miller - Reading Clerk\nKaren Haas - Reading Clerk\nCheryl Johnson - Reading Clerk","Clerk of the House Lorraine Miller - Reading Clerk Clerk of the House Karen Haas - Reading Clerk Clerk of the House Cheryl Johnson - Reading Clerk","Clerk of the House Miller - Reading Clerk\nClerk of the House Haas - Reading Clerk\nClerk of the House Johnson - Reading Clerk","Clerk of the House, Lorraine Miller (Reading Clerk), Clerk of the House, Karen Haas (Reading Clerk), Clerk of the House Cheryl Johnson (Reading Clerk)","Clerk of the House, Lorraine Miller (Reading Clerk), Clerk of the House,Karen Haas (Reading Clerk), Clerk of the House Cheryl Johnson(Reading Clerk)","Lorraine Miller - Reading Clerk, Karen Haas - Reading Clerk, Cheryl Johnson - Reading Clerk","Clerk of the House, Lorraine Miller, Reading Clerk\nClerk of the House, Karen Haas, Reading Clerk\nClerk of the House, Cheryl Johnson, Reading Clerk","Clerk of the House - Reading Clerk","Reading Clerk - Office of Legislative Operations, Office of the Clerk Chief Clerk - Committee on Education and Labor","Clerk of the House - Miller Clerk of the House - Haas Clerk of the House - Johnson","Reading Clerk, Office of Legislative Operations, Office of the Clerk Chief Clerk, Committee of Education and Labor","Clerk of the House - Clerks Miller, Haas & Johnson","Office of Legislative Operations, Reading Clerk, Office of the Chief Clerk, Clerk. Committee on Education and Labor, Clerk","Reading Clerk, Office of Legislative Operations, Office of the Clerk, Chief Clerk, Chief Clerk, Committee on Education and Labor.","Reading Clerk - Office of Legislative Operations, Office of the Clerk. Chief Clerk - Committee on Education and Labor","Reading Clerk - Office of Legislative Operations, Office of the Clerk Chief Clerk - Committee on Education & Labor","Clerk of House - Clerks Miller, Haas & Johngon","Office of the Clerk - Reading Clerk Committee on Education & Labor - Chief Clerk","Reading Clerk - Office of Legislative Operations, Chief Clerk - Office of the Clerk, Chief Clerk - Committee on Education & Labor","Clerk of the House - Miller, Haas, Johnson","Clerk of the House, Chief Clerk - Lorraine Miller, Karen Haas and Cheryl Johnson","Chief of Staff, Chief Clerk - Lorraine Miller, Karen Haas, Cheryl Johnson","Clerk of the House, Chief Clerk Lorraine Miller, Karen Haas and Cheryl Johson","Chief Clerk, Lorraine Miller, Karen Haas, Cherly Johnson","Chief Clerk - Lorraine Miller, Karen Haas, Cheryl Johnson","Clerk of the House, Chief Clerk - Lorraine Miller, Karen Haas and Cheryl Johnson.","Clerk of the House - Chief Clerk, Lorraine Miller, Karen Haas and Cheryl Jones","Chief Clerk, Clerk of the House Miller, Clerk of the House Hass and Clerk of the House Johnson","Reading Clerk - Office of the Clerk, US House of Representative Chief Clerk - Education and Workforce Committee, US House of Representative","Reading Clerk - Office of the Clerk, US House of Representative ChiefClerk - Education and Workforce Committee, US House of Representative"],"totalFilings":359,"yearlyActivity":[{"year":2021,"filings":32,"clients":4,"firms":1,"issues":["BUD","EDU","TRD","AGR","TRA","ECN","HCR"]},{"year":2022,"filings":52,"clients":9,"firms":1,"issues":["TRA","ENG","EDU","BUD","AGR","TRD","HCR","ECN","TAR"]},{"year":2023,"filings":65,"clients":12,"firms":1,"issues":[]},{"year":2024,"filings":104,"clients":16,"firms":1,"issues":["SCI","HCR","EDU","TRA","AGR","TRD","BUD","TAR","CPT","ECN","ENG","MAR","LAW"]},{"year":2025,"filings":106,"clients":17,"firms":1,"issues":["LBR","EDU","HCR","BUD","ECN","TAR","SCI","TRA","MAR","ENG","MAN","TAX","TRD","LAW","CPT","AGR"]}],"topClients":[{"name":"ARGENTUM","filings":54},{"name":"NATIONAL MILK PRODUCERS FEDERATION","filings":36},{"name":"MISSOURI STATE UNIVERSITY","filings":34},{"name":"ACCEL","filings":30},{"name":"CENTER ROAD SOLUTIONS, LLC","filings":21},{"name":"UNIVERSITY OF HOUSTON","filings":21},{"name":"THE UNIVERSITY OF MISSOURI SYSTEM","filings":20},{"name":"CSMI, LLC","filings":16},{"name":"NOMI HEALTH, INC.","filings":13},{"name":"VERU, INC.","filings":12},{"name":"U.S. CHAMBER OF COMMERCE","filings":12},{"name":"CAN MANUFACTURERS INSTITUTE","filings":10},{"name":"OXFAM AMERICA","filings":8},{"name":"HUSCH BLACKWELL LLP ON BEHALF OF MONARCH-CHESTERFIELD LEVEE DISTRICT","filings":8},{"name":"A. T. STILL UNIVERSITY","filings":8},{"name":"NATIONAL CHILDREN'S ALLIANCE","filings":8},{"name":"EBSCO PUBLISHING INC.","filings":8},{"name":"ACT EDUCATION CORP.","filings":8},{"name":"HUSCH BLACKWELL ON BEHALF OF THE FABIUS RIVER DRAINAGE DISTRICT","filings":6},{"name":"HUSCH BLACKWELL ON BEHALF OF THE SNY ISLAND LEVEE DRAINAGE DISTRICT","filings":6},{"name":"NATIONAL MUSIC PUBLISHERS' ASSOCIATION","filings":5},{"name":"SKINCURE ONCOLOGY","filings":5},{"name":"CURTIS, MALLET-PREVOST, COLT & MOSLE LLP (ON BEHALF OF SILGAN CONTAINERS)","filings":3},{"name":"BAYER U.S. LLC","filings":3},{"name":"A3 GLOBAL, INC.","filings":2},{"name":"TOTAL WINE & MORE","filings":2}],"firms":[{"name":"HB STRATEGIES","filings":359}],"issues":["BUD","EDU","TRD","AGR","TRA","ECN","HCR","ENG","TAR","SCI","CPT","MAR","LAW","LBR","MAN","TAX"]}