{"name":"JOSEPH MURRAY","slug":"joseph-murray","positions":["Senator Ron Johnson, Rep. Mark Meadows, Republican Study Committee","Senator Ron Johnson, Rep. Mark Meadows, the Republican Study Committee","Senator Ron Johnson, House Republican Study Committee, Rep. Mark Meadows","U.S. Senator Ron Johnson, Rep. Mark Meadows, Republican Study Committee","Senator Ron Johnson, Republican Study Committee, Rep. Mark Meadows","U.S. Senator Ron Johnson; Rep. Mark Meadows; Republican Study Committee","Senator Ron Johnson; Republican Study Committee; Rep. Mark Meadows.","Senator Ron Johnson; Republican Study Committee; Rep. Mark Meadows","Senator Ron Johnson, Rep. Mark Meadows, & the Republican Study Committee","Senator Ron Johnson, Rep. Mark Meadows, and Republican Study Committee","Senator Ron Johnson; Rep. Mark Meadows; & Republican Study Committee","Senator Ron Johnson; Rep. Mark Meadows; Republican Study Committee","Republican Study Committee; Rep. Mark Meadows; & Senator Ron Johnson","Republican Study Committee; Rep. Mark Meadows; Senator Ron Johnson"],"firms":["FIRST PRINCIPLES STRATEGIES, LLC"],"clients":["FIDELIS GOV'T RELATIONS ON BEHALF OF COALITION TO STOP GENOCIDE IN BURMA","SEXTONS CREEK ON BEHALF OF AFFORDABLE HOUSING TAX CREDIT COALITION","SQUIRE PATTON BOGGS ON BEHALF OF MOLNLYCKE HEALTH CARE US, LLC","MOLNLYCKE HEALTH CARE, U.S., LLC","HORIZON GOVERNMENT AFFAIRS ON BEHALF OF THE HEALTH INNOVATION ALLIANCE","SEXTONS CREEK ON BEHALF OF AMERICAN TITANIUM WORKS, LLC","THE HEALTH INNOVATION ALLIANCE","FIDELIS GOV'T RELATIONS ON BEHALF OF EXELA PHARMA SCIENCES","HEALTHY TRUCKING OF AMERICA","NATIONAL PRESSURE INJURY ADVISORY PANEL","THE HARRIS FIRM, PLLC ON BEHALF OF FORGOTTEN GM BAILOUT VICTIMS","OLD NORTH STRATEGIES, LLC ON BEHALF OF EXELA PHARMA SCIENCES, LLC","OLD NORTH STRATEGIES, LLC ON BEHALF OF PETER DAMON GROUP, LLC","SEXTONS CREEK ON BEHALF OF THE CLAPHAM GROUP","YC CONSULTING LLC ON BEHALF OF KOREAN INTERNATIONAL TRADE ASSOCIATION","NATIONAL JEWISH ADVOCACY CENTER ACTION","VALIDAS, LLC","HORIZON GOVERNMENT AFFAIRS ON BEHALF OF U.S. PHARMACOPEIAL CONVENTION","SEXTONS CREEK ON BEHALF OF INDIANA WESLEYAN UNIVERSITY","OLD NORTH STRATEGIES, LLC ON BEHALF OF QUALEXA HEALTHCARE, LLC","THE CLAPHAM GROUP, LLC ON BEHALF OF CHILDREN'S EQUITY FUND","AMERICAN LABORATORIES PHARMA, LLC"],"filings":213,"issues":[]}