{"name":"JUSTIN BROWN","slug":"justin-brown","positions":["Staff Director, House Veterans Affairs Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs Subcommittee on Economic Opportunity","Staff Director, House Veterans Affairs Committee, Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs Committee, Subcommittee on Economic Opportunity","Staff Director, House Veterans Affairs, Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs, Subcommittee on Economic Opportunity","Staff Director, House Veterans Affairs Subcommittee on Disability Assistance & Memorial Affairs & Economic Opportunity; Staff Assistant, Rep. Joe Sestak.","Staff Director, House Veterans Affairs Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs Subcommittee on Economic Opportunity; Staff Assistant, Rep. Joe Sestak.","Staff Director, House Veterans Affairs Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs Subcommittee on Economic Opportunity; Staff Assistant, Rep. Joe Sestak","Staff Director, House Veterans Affairs Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs Subcommittee on Economic Opportunity; Staff Assistant, Rep Joe Sestak.","Staff Director of the Subcommittees on Economic Opportunity/DAMA, House Veterans Affairs Committee; Staff Assistant, Rep. Joe Sestak.","Staff Director, Economic Subcommittee/DAMA Subcommittee, House Veterans Affairs Committee; Staff Assistant, Rep. Joe Sestak.","Staff Director, House Veterans Affairs Subcommittee on Disability Assistance and Memorial Affairs; Staff Director, House Veterans Affairs Subcommittee on Economic Opportunity. Staff Assistant, Rep Joe Sestak.","Staff Director, House Veterans Affairs Subcommittee on Disability Assistance and Memorial Affairs: Staff Director, House Veterans Affairs Subcommittee on Economic Opportunity","Staff Director, House Veterans Affairs Committee, Subcommittees on Economic Opportunity & the Subcommittee on Disability Assistance & Memorial Affairs. Staff Assistant, Representative Joe Sestak.","Staff Director, House Veterans Affairs Committee; Subcommittees on Economic Opportunity & Disability Assistance and Memorial Affairs; Staff Assistant, Rep. Joe Sestak; Intern, House Foreign Affairs Committeee","Staff Director, House Veterans Affairs Committee: Subcommittees of Economic Opportunity & Disability Assistance and Memorial Affairs; Staff Assistant, Rep. Joe Sestak; Intern, House Foreign Affairs Committee","Staff Director, House Veterans Affairs Committee, Subcommittees on Economic Opportunity & Disability Assistance and Memorial Affairs; Staff Assistant, Rep. Joe Sestak; Intern, House Foreign Affairs Committee","Staff Director, House Veterans Affairs Committee; Subcommittees on Economic Opportunity & Disability Assistance and Memorial Affairs; Staff Assistant, Rep. Joe Sestak; Intern, House Foreign Affairs Committee."],"firms":["THE NIMITZ GROUP LLC"],"clients":["AMERICAN OPTOMETRIC ASSOCIATION","AMVETS/AMERICAN VETERANS","BOULDER CREST RETREAT","THE GLOBAL WAR ON TERROR MEMORIAL FOUNDATION","GOVERNMENT CIO","GOLD STAR WIVES OF AMERICA, INC.","AVALON ACTION ALLIANCE","ACCESS FUND","GOLD STAR SPOUSES OF AMERICA, INC.","THE MACLEAN GROUP (TMG)","PURPLE JAY LLC","PHRONESIS GLOBAL TRAINING SOLUTIONS LLC, D/B/A PGT SOLUTIONS","RECRUITMILITARY"],"filings":333,"issues":[]}