{"id":56588,"name":"JUSTIN DALY","slug":"justin-daly","revolvingDoor":true,"governmentPositions":["SENIOR COUNSEL TO US HOUSE/SENATE/SEC","SENIOR COUNSEL TO US HOUSE COMMITTEE ON FINANCIAL SERVICES; SENIOR COUNSEL TO US SENATE COMMITTEE ON BANKING, HOUSING AND URBAN AFFAIRS; SENIOR COUNSEL TO US SECURITIES AND EXCHANGE COMMISSION","Senior Counsel to US House Committee on Financial Services; Senior Counsel to US Senate Committee on Banking, Housing and Urban Affairs; Senior Counsel to US Securities and Exchange Commission","Senior Counsel to US House, Senate, and SEC","Senior Counsel to US House Financial Services Committee Senior Counsel to US Senate Banking Committee Senior Counsel to US Securities and Exchange Commission","SENIOR COUNSEL TO US HOUSE FINANCIAL SERVICES COMMITTEE SENIOR COUNSEL TO US SENATE BANKING COMMITTEE SENIOR COUNSEL TO US SECURITIES AND EXCHANGE COMMISSION","Senior Counsel to US House Financial Services Committee, Senior Counsel to US Senate Banking Committee, Senior Counsel to US Securities and Exchange Commission","Senior Counsel - US House Financial Services Committee\nSenior Counsel - US Senate Banking Committee\nSenior Counsel - US Securities and Exchange Commission","Senior Counsel - US House Financial Services Committee Senior Counsel - US Senate Banking Committee Senior Counsel - US Securities and Exchange Commission","Senior Counsel to US House; \nSenior Counsel to US Senate; and \nSenior Counsel to Securities and Exchange Commission","SENIOR COUNSEL TO US HOUSE SENIOR COUNSEL TO US SENATE SENIOR COUNSEL TO SECURITIES AND EXCHANGE COMMISSION","SENIOR COUNSEL TO US HOUSE; SENIOR COUNSEL TO US SENATE; AND SENIOR COUNSEL TO SECURITIES AND EXCHANGE COMMISSION","Senior Counsel to US House of Representatives; Senior Counsel to US Senate; Senior Counsel to Securities and Exchange Commission","SENIOR COUNSEL TO US HOUSE; SENIOR COUNSEL TO US SENATE; SENIOR COUNSEL TO SECURITIES AND EXCHANGE COMMISSION","SENIOR COUNSEL TO US HOUSE, SENATE, AND SECURITIES AND EXCHANGE COMMISSION","SENIOR COUNSEL TO US HOUSE/US SENATE/SECURITIES AND EXCHANGE COMMISSION","SENI0R COUNSEL TO HOUSE FINANCIAL SERVICES/SENIOR COUNSEL TO SENATE BANKING COMMITTEE/SENIOR COUNSEL TO SECURITIES AND EXCHANGE COMMISSION","SENIOR COUNSEL TO HOUSE FINANCIAL SERVICES COMMITTEE/SENIOR COUNSEL TO SENATE BANKING COMMITTEE/SENIOR COUNSEL TO SECURITIES AND EXCHANGE COMMISSION","SENIOR COUNSEL TO US HOUSE FINANCIAL SERVICES COMMITTEE; SENIOR COUNSEL TO US SENATE BANKING COMMITTEE; SENIOR COUNSEL, US SECURITIES AND EXCHANGE COMMISSION","SENIOR COUNSEL TO US HOUSE FINANCIAL SERVICES COMMITTEE/SENIOR COUNSEL TO US SENATE BANKING COMMITTEE/SENIOR COUNSEL TO US SECURITIES AND EXCHANGE COMMISSION","Senior Counsel to House Financial Services Committee; Senior Counsel to Senate Banking Committee; Senior Counsel, Securities and Exchange Commission","Senior Counsel to House Financial Services Committee; Senior Counsel to Senate Banking Committee; Senior Counsel to Securities and Exchange Commission","SENIOR COUNSEL TO HOUSE FINANCIAL SERVICES COMMITTEE; SENIOR COUNSEL TO SENATE BANKING COMMITTEE; SENIOR COUNSEL TO SECURITIES AND EXCHANGE COMMISSION"],"totalFilings":502,"yearlyActivity":[{"year":2018,"filings":93,"clients":18,"firms":1,"issues":["FIN","ACC","INS","VET","AGR","BAN"]},{"year":2019,"filings":64,"clients":20,"firms":1,"issues":["FIN","ACC","INS","VET","BAN"]},{"year":2020,"filings":48,"clients":17,"firms":1,"issues":["INS","FIN","BAN","ACC"]},{"year":2021,"filings":55,"clients":15,"firms":1,"issues":["FIN","ACC","INS","BAN"]},{"year":2022,"filings":71,"clients":16,"firms":1,"issues":["FIN","BAN","ACC","INS"]},{"year":2023,"filings":64,"clients":17,"firms":1,"issues":[]},{"year":2024,"filings":58,"clients":15,"firms":1,"issues":["FIN","ACC","INS","BAN"]},{"year":2025,"filings":49,"clients":13,"firms":1,"issues":["FIN","ACC","INS","BAN"]}],"topClients":[{"name":"INVESTMENT COMPANY INSTITUTE","filings":33},{"name":"TRAVELERS COMPANIES INC AND SUBSIDIARIES (WAS THE TRAVELERS COMPANIES INC","filings":33},{"name":"PWC US GROUP LLP (FORMERLY PRICEWATERHOUSECOOPERS LLP)","filings":32},{"name":"DEPOSITORY TRUST & CLEARING CORPORATION","filings":32},{"name":"S&P GLOBAL INC (FORMERLY MCGRAW HILL FINANCIAL)","filings":31},{"name":"STATE STREET BANK AND TRUST COMPANY","filings":31},{"name":"THE GOLDMAN SACHS GROUP, INC.","filings":31},{"name":"MARINER FINANCE","filings":29},{"name":"XTX MARKETS LLC (AMERICAS)","filings":28},{"name":"BROADRIDGE FINANCIAL SOLUTIONS, INC.","filings":24},{"name":"ROBINHOOD MARKETS, INC.","filings":24},{"name":"ALLY FINANCIAL","filings":23},{"name":"S-3 GROUP, O/B/O COUNCIL FOR INVESTOR RIGHTS AND CORPORATE ACCOUNTABILITY, INC.","filings":21},{"name":"BLACKROCK FUNDS SERVICES GROUP LLC (FKA BLACKROCK, INC.)","filings":17},{"name":"CHIME FINANCIAL, INC.","filings":17},{"name":"FMR LLC (\"FIDELITY INVESTMENTS\")","filings":14},{"name":"TRANSUNION LLC","filings":14},{"name":"KOCH COMPANIES PUBLIC SECTOR, LLC","filings":13},{"name":"FINANCIAL INDUSTRY REGULATORY AUTHORITY (\"FINRA\", FORMERLY NASD)","filings":12},{"name":"MELLON FINANCIAL SERVICES CORPORATION #1","filings":10},{"name":"THE GUARDIAN LIFE INSURANCE COMPANY OF AMERICA","filings":8},{"name":"HARBOR","filings":7},{"name":"HSBC-NORTH AMERICA","filings":7},{"name":"CLINICOMP, INTL.","filings":6},{"name":"NOMURA HOLDING AMERICA INC.","filings":3},{"name":"AMERICAN FREE ENTERPRISE CHAMBER OF COMMERCE","filings":2}],"firms":[{"name":"DALY CONSULTING GROUP","filings":502}],"issues":["FIN","ACC","INS","VET","AGR","BAN"]}