{"name":"KEVIN KAYES","slug":"kevin-kayes","positions":["Chief Counsel, Dem Leader Harry Reid; Staff Director/Chief Counsel, Senate Commerce, Transportation and Science Committee; Assistant Parliamentarian, US Senate; Leg Assistant, Congressman Adam Benjamin Jr. (D-Ind)","Chief Counsel, Senate Dem Leader Harry Reid; Staff Director/Chief Counsel, Senate Commerce, Science and Transportation; Assistant Parliamentarian, US Senate; Legislative Assistant, Congressman Adam Benjamin, Jr.","Chief Counsel, Dem Leader Harry Reid; Staff Director/Chief Counsel, Senate Commerce, Science and Transportation Committee; Assistant Parliamentarian, US Senate; Leg Assistant, Congressman Adam Benjamin, Jr.","Chief Counsel, Senate Democratic Leader Harry Reid; Staff Director/Chief Counsel, Senate Commerce, Science and Transportation Committee; Assistant Parliamentarian, United States Senate; Legislative Assistant, Congressman Adam Benjamin, Jr.","Chief Counsel/Democratic Leader Harry Reid; Staff Director/Senate Commerce Committee; Assistant Parliamentarian/US Senate; LA/Congressman Adam Benjamin, Jr.","Chief Counsel, Senate Democratic Leader Harry Reid; Staff Director, Senate Commerce, Science and Transportation Committee; Assistant Parliamentarian, US Senate; Legislative Assistant, Congressman Adam Benjamin, Jr.","Chief Counsel, Democratic Leader Harry Reid 2005-2007; Staff Director, Senate Commerce Science and Transportation Committee 1999-2005; Assistant Parliamentarian, US Senate 1987-1999; Legislative Assistant, Congressman Adam Benjamin, Jr. 1978-1981.","Chief Counsel, Leader Harry Reid, 2005-6; Staff Director, Senate Commerce Committee 1999 - 2005; Assistant Senate Parliamentarian 1987-1999; Leg Assistant, Congressman Adam Benjamin, Jr. 1978-1981.","2005-6 Chief Counsel, Democratic Leader Harry Reid; 1999 - 2005 Staff Director, Senate Commerce Committee; 1987 - 1999 Assistant Parliamentarian, US Senate; 1978-1981 Leg Assistant, Congressman Adam Benjamin, Jr."],"firms":["KEVIN KAYES"],"clients":["ARCBEST","THE BROADWAY LEAGUE INC.","ATT SERVICES INC (FORMERLY ATT)","BROWNSTEIN HYATT FARBER AND SCHRECK ON BEHALF OF ROYAL CARIBBEAN CRUISES LTD","SONY CORPORATION OF AMERICA","NCTA","FWD.US","NEXTNAV LLC","NATIONAL ASSOCIATION OF CHAIN DRUG STORES"],"filings":140,"issues":[]}