{"name":"LARRY LAVENDER","slug":"larry-lavender","positions":["Partner","Former Chief of Staff of House Financial Services Committee","Former Chief of Staff, House Financial Services Committee","Former Chief of Staff House Financial Services Committee","House Financial Services Committee Chief of Staff","House Financial services Committee Chief of Staff","Former CoS House Financial Services Committee","Chief of Staff U.S. House Financial Services Committee","Chief of Staff U. S. House Financial Services Committee","Chief of Staff House Financial services Committee","Chief of Staff, House Financial Services Committee","Chief of Staff House Financial Services Committee","Chief of Staff, House Financial Services Committee Chief of Staff, Rep. Spencer Bachus","Chief of Staff, House Financial Services Committee Chief of Staff , Rep. Spencer Bachus","Chief of Staff U.S. House of Representatives Financial Services Committee","Chief of Staff US House Financial Services Committee","Chief of Staff U.S. House of Representatives Financial Services Committee Chief of Staff Rep. Spencer Bachus","House Financial Services Chief of Staff","House Financial Services Committee Chief of Staff, Alabama 6th Congressional District Chief of Staff","Chief of Staff, House Financial Services Committee, Alabama 6th Congressional District Chief of Staff","Chief of Staff House Financial Services Committee, Alabama 6th Congressional District Chief of Staff","Chief of Staff US House Financial Services Committee, Alabama 6th Congressional District Chief of Staff"],"firms":["LAVENDER CONSULTANTS"],"clients":["TRIBAL COUNCIL POARCH CREEK INDIANS","ONLINE LENDERS ALLIANCE","JONES WALKER, LLP ON BEHALF OF JDW PROPERTIES III,LLC","JONES WALKER, LLP ON BEHALF OF GREATER NEW ORLEANS, INC.","JONES WALKER, LLP ON BEHALF OF BALDRIDGE FOUNDATION","JONES WALKER, LLP ON BEHALF OF MID-SIZE BANK COALITION OF AMERICA","MID-SIZE BANK COALITION OF AMERICA","JACKSON VAUGHN PUBLIC STRATEGIES ON BEHALF OF ENOVA ONLINE SERVICES, INC.","JACKSON VAUGHN PUBLIC STRATEGIES ON BEHALF OF FIRST COMMAND FINANCIAL SERVICES,","CITY OF HOOVER, ALABAMA","ENOVA INTERNATIONAL, INC","THE NATURE CONSERVANCY ALFO","THE LIVINGSTON GROUP, LLC ON BEHALF OF HEALTH SUPPLY US","COALITION FOR CONSUMER CHOICE, INC."],"filings":196,"issues":[]}