{"id":139390,"name":"LAUREN COHEN","slug":"lauren-cohen","revolvingDoor":true,"governmentPositions":["annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY23","FY23 funding for historic preservation","Reauthorization and enhancement to the Historic Preservation Fund","annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY24; reauthorization of Historic Preservation Fund","FY25 funding for historic preservation","annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY25; reauthorization of Historic Preservation Fund","Chaco Canyon Cultural Heritage Protection Act","Improvements to the federal rehabilitation tax credit.","Annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY25 and FY26; reauthorization of Historic Preservation Fund","FY25 and FY26 funding for historic preservation","Historic Preservation Fund reauthorization.","Annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY25 and FY26; Advisory Council on Historic Preservation annual budget","Improvements to the federal rehabilitation tax credit; historic tax credit provisions in the One Big Beautiful Bill Act","Annual appropriations bills affecting historic preservation generally, including the Advisory Council on Historic Preservation and from the Historic Preservation Fund and Department of the Interior budget request for FY25 and FY26, specifically.","FY25 and FY26 funding for historic preservation.","Annual appropriations bills with jurisdiction over historic preservation activities generally, including the Advisory Council on Historic Preservation and the Historic Preservation Fund and Department of the Interior budget request for FY26, specific","FY26 funding for historic preservation, FY26 funding for the NEA and NEH"],"totalFilings":52,"yearlyActivity":[{"year":2022,"filings":9,"clients":1,"firms":1,"issues":["BUD","GOV","CIV","NAT","TRA","TAX","BAN","FIN"]},{"year":2023,"filings":15,"clients":1,"firms":1,"issues":[]},{"year":2024,"filings":12,"clients":1,"firms":1,"issues":["BUD","GOV","CIV","NAT","TAX"]},{"year":2025,"filings":16,"clients":1,"firms":1,"issues":["BUD","GOV","CIV","NAT","TAX"]}],"topClients":[{"name":"NATIONAL TRUST FOR HISTORIC PRESERVATION","filings":52}],"firms":[{"name":"NATIONAL TRUST FOR HISTORIC PRESERVATION","filings":52}],"issues":["BUD","GOV","CIV","NAT","TRA","TAX","BAN","FIN"]}