{"name":"LEONARD WOLFSON","slug":"leonard-wolfson","positions":["Assistant Secretary for Congressional and Intergovernmental Relations at the U.S. Department of Housing and Urban Development and Acting Commissioner of the Federal Housing Administration","Asst. Sec., HUD; Acting FHA Commissioner; General Dep. Asst. Sec., HUD; Dep. Asst. Sec., HUD; Director, HUD; LD, Rep. Chris Shays","Assistant Secretary for Congressional and Intergovernmental Relations at the U.S. Department of Housing and Urban Development","Assistant Secretary for Congressional and Intergovernmental Relations at HUD, Acting FHA Commissioner, General Deputy Assistant Secretary for Congressional and Intergovernmental Relations at HUD, Legislative Director to Rep. Chris Shays.","Assistant Secretary, HUD; Acting FHA Commissioner; General Deputy Assistant Secretary, HUD; Deputy Assistant Secretary, HUD; Director of Legislative Affairs, HUD; Legislative Director, Rep. Christopher Shays","Assistant Secretary, HUD; Acting FHA Commissioner; General Deputy Assistant Secretary, HUD; Deputy Assistant Secretary, HUD; Director of Legislative Affairs, HUD; Legislative Director, Rep. Christopher Shays."],"firms":["FEDERAL HALL POLICY ADVISORS, LLC"],"clients":["CBC MORTGAGE AGENCY","NEW SENIOR INVESTMENT GROUP","INSURANCE SERVICES OFFICE, INC.","WEBBANK","WESTCOR LAND TITLE INSURANCE COMPANY","NATIONAL RENTAL HOME COUNCIL","PRETIUM","INTERNATIONAL COUNCIL OF SHOPPING CENTERS","BIPARTISAN POLICY CENTER ACTION","SNAPDOCS, INC.","DEFI EDUCATION FUND","U.S. MORTGAGE INSURERS","THE MAJORITY GROUP, LLC (ON BEHALF OF SAGENT)","ARNALL GOLDEN GREGORY (ON BEHALF OF THE LOCAL HOUSING ADMINISTRATORS COALITION)","MONARCH ALTERNATIVE CAPITAL LP","VANTAGESCORE SOLUTIONS, LLC","CREDIT UNION NATIONAL ASSOCIATION. INC. DBA AMERICA'S CREDIT UNIONS","PADSPLIT","THE MAJORITY GROUP, LLC (ON BEHALF OF PENNYMAC)","ARNALL GOLDEN GREGORY (O/B/O HOUSING AUTHORITY OF THE COUNTY OF SANTA BARBARA)","ARNALL GOLDEN GREGORY (O/B/O HOUSING AUTHORITY OF THE COUNTY OF BUTTE)","PENNYMAC FINANCIAL SERVICES","ARNALL GOLDEN GREGORY (ON BEHALF OF SOUTHWEST HOUSING COMPLIANCE CORPORATION)","MR. COOPER","SAN DIEGO HOUSING COMMISSION"],"filings":297,"issues":[]}