{"id":141699,"name":"LINDSAY FRYER","slug":"lindsay-fryer","revolvingDoor":true,"governmentPositions":["Professional Staff Member, House Education and Workforce Committee Senior Policy Advisor, Senate Health, Education, Labor, & Pensions Committee","Professional Staff Member, House Education and Workforce Committee Senior Policy Advisor, Senate HELP Committee","Profressional Staff Member, House Education and Workforce Committee Senior Policy Advisor, Senate HELP Committee","Professional Staff Member, House Education and Workforce Committee, Senior Education Policy Advisor, Senate HELP Committee","Professional staff member, House education and workforce committee; Senior education policy advisor, Senate Health, Education, Labor, & Pensions committee","Professional Staff Member, House Education and Workforce Committee; Senior Education Policy Advisor, Senate Health, Education, Labor, & Pensions Committee","Professional Staff Member, US House Education and Workforce Commmittee; Senior Education Policy Advisor, US Senate HELP Committee","Professional Staff Member, US House Education and Workforce Committee; Senior Education Policy Advisor, US Senate HELP Committee"],"totalFilings":107,"yearlyActivity":[{"year":2024,"filings":44,"clients":6,"firms":1,"issues":["EDU","BUD","AVI"]},{"year":2025,"filings":63,"clients":9,"firms":1,"issues":["BUD","EDU","TAX","BNK","CSP","LBR"]}],"topClients":[{"name":"DATA QUALITY CAMPAIGN, INC.","filings":18},{"name":"BETTER FUTURE FORWARD","filings":16},{"name":"VITALSOURCE TECHNOLOGIES, LLC","filings":14},{"name":"BLUE LEARNING","filings":14},{"name":"COMMUNITIES IN SCHOOLS","filings":14},{"name":"EXCELLENCE IN EDUCATION NATIONAL, INC.","filings":12},{"name":"REGIONAL AIRLINE ASSOCIATION","filings":9},{"name":"AMERICAN INSTITUTES FOR RESEARCH","filings":8},{"name":"RED MAPLE CONSULTING, LLC (ON BEHALF OF SKYROCKET EDUCATION SERVICES)","filings":2}],"firms":[{"name":"LODESTONE DC","filings":107}],"issues":["EDU","BUD","AVI","TAX","BNK","CSP","LBR"]}