{"id":56995,"name":"LISETTE MONDELLO","slug":"lisette-mondello","revolvingDoor":true,"governmentPositions":["Asst. Secretary, Dept. of Veterans Affairs Senior Advisor, U.S. Senator Kay Bailey Hutchison Senior Advisor, US Dept. of Education Communications Director, U.S. Senator Al D'Amato","Assistant Secretary of Public & Intergovernmental Affairs-Dept. of Veterans Affairs\nSenior Advisor, US Sen. Kay Bailey Hutchison\nSenior Advisor to Secretary, US Dept. of Education\nCommunications Director US Sen. Kay Bailey Hutchison","Assistant Secretary for Public & Intergovernmental Affairs-Dept. of VA\nSenior Advisor, US Senator Kay Bailey Hutchison\nSenior Advisor to the Secretary, US Dept.of Education\nComms Director, Sen. Kay Bailey Hutchison\nComms Director, Sen. Al D'Amato","Assistant Secretary-US Dept of Veterans Affairs Senior Advisory--US Dept. of Education Senior Advisor--US Sen. Kay Bailey Hutchison Communications Director--US Sen. Kay Bailey Hutchison Communications Director--US Sen. Al D'Amato","Asst. Sec.-Dept. of Veterans Affairs; Sr. Advisor-Sen. Kay Bailey Hutchison; Sr. Advisor to the Secretary-Dept of Education; Comms Director-Sen. Hutchison; Comms Dir.-Sen. Al D'Amato","Asst. Sec. of VA; Sr. Adv., Sen.Kay Bailey Hutchison; Sr. Advisor, Dept. of Educ.; Communications Director, Senators Hutchison, Sen. Al D'Amato","Assistant Secretary of Veterans Affairs; Senior Advisor to the Secretary at the Department of Education; Senior Advisor/Communications Director for Senator Kay Bailey Hutchison; Communications Director for Senator Al D'Amato.","Asst. Sec. VA Senior Adv. US Sen. Kay Bailey Hutchison Senior Adv. US Dept. of Education","Asst. Secretary Veterans Affairs; Senior Advisor to Secretary of Education; Senior Advisor to Sen. Kay Bailey Hutchison; Communications Director for Sen. Al D'Amato and Sen. Kay Bailey Hutchison.","Asst. Secretary, Department of Veterans Affairs; Senior Advisor, Department of Education; Senior Advisor, Sen. Kay Bailey Hutchison; Communications Director, Sen. Kay Bailey Hutchison, Sen. Al D'Amamto"],"totalFilings":97,"yearlyActivity":[{"year":2018,"filings":15,"clients":3,"firms":1,"issues":["AVI","TRA","AUT","LAW"]},{"year":2019,"filings":13,"clients":4,"firms":1,"issues":["AVI","TRA","AUT","SPO","HCR"]},{"year":2020,"filings":15,"clients":4,"firms":1,"issues":["AVI","AUT","SPO","HCR","VET"]},{"year":2021,"filings":9,"clients":3,"firms":1,"issues":["AVI","HCR","SPO"]},{"year":2022,"filings":9,"clients":3,"firms":1,"issues":["AVI","SPO","EDU"]},{"year":2023,"filings":16,"clients":4,"firms":1,"issues":[]},{"year":2024,"filings":14,"clients":4,"firms":1,"issues":["AVI","SPO","EDU","HCR"]},{"year":2025,"filings":6,"clients":2,"firms":1,"issues":["EDU","AVI"]}],"topClients":[{"name":"SOUTHWEST AIRLINES","filings":31},{"name":"WORLD ANTI-DOPING ASSOCIATION (WADA)","filings":20},{"name":"TEXAS INSTRUMENTS, INC","filings":15},{"name":"ISTATION","filings":11},{"name":"NUHOPE","filings":9},{"name":"REGENATIVE LABS","filings":8},{"name":"CORRECTIVE EDUCATION COMPANY","filings":3}],"firms":[{"name":"THE MONDELLO GROUP LLC","filings":97}],"issues":["AVI","TRA","AUT","LAW","SPO","HCR","VET","EDU"]}