{"id":148828,"name":"MEGHAN SCHMIDTLEIN","slug":"meghan-schmidtlein","revolvingDoor":true,"governmentPositions":["Congressman Luetkemeyer - Legislative Director, Congressman Graves - Senior Legislative Assistant, Congressman Sessions - Legislative Assistant.","Congressman Luetkemeyer - Legislative Director Congressman Sessions - Legislative Assistant Congressman Graves - Dr. Legislative Assistant","Rep Luetkemeyer - Legislative Director, Rep Sessions - Legislative Assistant, Rep Graves - Sr. Legislative Assistant","Congressman Luetkemeyer - Legislative Director Congressman Graves - Sr. Legislative Assistant Congressman Session - Legislative Assistant","Rep Luetkemeyer - Legislative Director Rep Graves - Legislative Assistant Rep Sessions - Legislative Assistant","Rep Luetkemeyer - Legislative Director Rep Graves - Sr. Legislative Assistant Rep Sessions - Legislative Assistant","Rep Luetkemeyer - Legislative Director Rep Graves - Sr. Legislative Assistant Rep Session - Legislative Assistant","Rep Luetkemeyer - Legislative Director Rep Sessions - Legislative Assistant Rep Graves - Sr. Legislative Assistant","Rep Luetkemeyer - Sr. Legislative Director Rep Sessions - Legislative Assistant Rep Graves - Sr. Legislative Assistant","Rep Luetkemeyer - Sr. Legislative Director Rep Sessions - Legislative Assistant Rep Graves - Sr. Legislative Assistant Rep Graves - Sr. Legislative Assistant","Rep Luetkemeyer - Legislative Director, Rep Graves - Sr. Legislative Assistant, Rep Sessions - Legislative Assistant","Rep. Luetkemeyer - Sr. Legislative Director, Rep. Sessions - Legislative Assistant, Rep. Graves - Sr. Legislative Assistant","Rep. Luetkemeyer - Sr. Legislative Director, Rep. Session - Legislative Assistant, Rep Graves, Sr. Legislative Assistant"],"totalFilings":53,"yearlyActivity":[{"year":2025,"filings":53,"clients":9,"firms":1,"issues":["DEF","BUD","ENG","HCR","EDU","TAX","MMM","TRA","MAR"]}],"topClients":[{"name":"PROMONTORY 150 LLC","filings":12},{"name":"JOHNS HOPKINS UNIVERSITY","filings":9},{"name":"WASHINGTON UNIVERSITY IN ST. LOUIS","filings":9},{"name":"THE UNIVERSITY OF MISSOURI SYSTEM","filings":8},{"name":"MISSOURI BEHAVIORAL HEALTH COALITION","filings":7},{"name":"SKINCURE ONCOLOGY","filings":5},{"name":"HUSCH BLACKWELL LLP ON BEHALF OF MONARCH-CHESTERFIELD LEVEE DISTRICT","filings":1},{"name":"HUSCH BLACKWELL ON BEHALF OF THE FABIUS RIVER DRAINAGE DISTRICT","filings":1},{"name":"HUSCH BLACKWELL ON BEHALF OF THE SNY ISLAND LEVEE DRAINAGE DISTRICT","filings":1}],"firms":[{"name":"HB STRATEGIES","filings":53}],"issues":["DEF","BUD","ENG","HCR","EDU","TAX","MMM","TRA","MAR"]}