{"id":51394,"name":"MENDA FIFE","slug":"menda-fife","revolvingDoor":true,"governmentPositions":["Professional Staff Member -- Senate Appropriations Committee; Legislative Assistant -- Senators Kennedy and Feinstein and Rep. C. Brown; and Legislative Correspondent and Mailroom Supervisor -- Senator Harkin.","LC and Mailroom Supervisor -- Senator Harkin","LC & Mailroom Supervisor -- Senator Harkin","Professional Staff Member -- Senate Appropriations Committee; Legislative Assistant -- Senators Kennedy & Feinstein and Rep. Corrine Brown; and, Legislative Correspondent and Mailroom Supervisor -- Senator Harkin","LC and Mailroom Supervisor - Sen. Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Kennedy, Feinstein and Cong. Corrine Brown; Legislative Correspondent/Mailroom Supervisor - Senator Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Edward Kennedy, Feinstein and Cong. Corrine Brown; Legislative Correspondent/Mailroom Supervisor - Senator Harkin","Professional Staff Member -- Senate Appropriations Committee; Legis. Asst. -- Sens. Kennedy & Feinstein and Rep. C. Brown; and LC and Mailroom Supervisor -- Senator Harkin","Professional Staff Member -- Senate Appropriations Committee; Legis. Asst. -- Sens. Kennedy & Feinstein and Rep. C. Brown; and LC and Mailroom Supervisor -- Senator Harkin.","LC and Mailroom Supervisor -- Senator Harkin; LA -- Senators Kennedy and Feinstein and Rep. C. Brown; and Professional Staff Member -- Senate Appropriations Committee","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senator Edward Kennedy, Senator Dianne Feinstein, and Congresswoman C. Brown; and Legislative Correspondent and Mailroom Supervisor - Senator Tom Harkin","Professional Staff Member -- Senate Appropriations Committee; Legislative Assistant -- Senators Kennedy & Feinstein and Representative C. Brown; and, Legislative Correspondent and Mailroom Supervisor -- Senator Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Edward M. Kennedy and Dianne Feinstein and Congresswoman C. Brown; and Legislative Correspondent/Mailroom Supervisor - Senator Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Edward M. Kennedy and Dianne Feinstein and Congresswoman C. Brown; and Legislative Correspondent/Mailroom Supervisor - Senator Tom Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Kennedy and Feinstein and Representative C. Brown; and Legislative Correspondent and Mailroom Supervisor -- Senator Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Kennedy and Feinstein and Rep. Corrine Brown; Legislative Correspondent and Mailroom Supervisor - Senator Harkin","Professional Staff Member -- Senate Appropriations Committee; Legislative Assistant -- Sens. Kennedy and Feinstein and Rep. C. Brown and Mailroom Supervisor -- Senator Harkin","Professional Staff Member - Senate Appropriations Committee; Legislative Assistant - Senators Edward M. Kennedy and Dianne Feinstein and Congresswoman C. Brown; and Legislative Correspondence/Mailroom Supervisor - Senator Tom Harkin"],"totalFilings":492,"yearlyActivity":[{"year":2018,"filings":62,"clients":5,"firms":1,"issues":["FOR","DEF","TRD","HCR","BUD","ENV","AER","FIN","IMM","HOM"]},{"year":2019,"filings":36,"clients":6,"firms":1,"issues":["DEF","BUD","FIN","TAX","AER","FOR"]},{"year":2020,"filings":46,"clients":5,"firms":1,"issues":["DEF","AER","TRA","BUD","MED","FOR","AVI"]},{"year":2021,"filings":57,"clients":7,"firms":1,"issues":["TRA","DEF","AER","BUD","FOR","HCR","LBR","CPI"]},{"year":2022,"filings":95,"clients":9,"firms":1,"issues":["CPI","BUD","DEF","INT","AER","LBR","FOR","TAX","HCR"]},{"year":2023,"filings":80,"clients":7,"firms":1,"issues":[]},{"year":2024,"filings":54,"clients":7,"firms":1,"issues":["DEF","BUD","CPI","FOR","TAX","SCI","EDU","TRA"]},{"year":2025,"filings":62,"clients":6,"firms":1,"issues":["BUD","DEF","FOR","CPI","TAX","TRA","EDU"]}],"topClients":[{"name":"GENERAL DYNAMICS","filings":84},{"name":"AEROJET ROCKETDYNE, AN L3HARRIS TECHNOLOGIES CO (FKA AEROJET ROCKETDYNE INC.)","filings":80},{"name":"LEONARDO DRS, INC. (FKA DRS TECHNOLOGIES, INC.)","filings":65},{"name":"MICROSOFT CORPORATION","filings":54},{"name":"GENERAL ELECTRIC COMPANY (FKA GE AVIATION)","filings":50},{"name":"GENERAL ATOMICS AERONAUTICAL SYSTEMS, INC.","filings":42},{"name":"HOBART HALLAWAY & QUAYLE VENTURES LLC (ON BEHALF OF INTELLICHECK INC )","filings":22},{"name":"KLICK, INC. (ON BEHALF OF TAKEDA PHARMACEUTICALS AMERICA, INC.)","filings":21},{"name":"SAP AMERICA, INC.","filings":19},{"name":"BSA BUSINESS SOFTWARE ALLIANCE, INC.","filings":14},{"name":"RAYTHEON TECHNOLOGIES CORPORATION AND AFFILIATES (FKA RAYTHEON COMPANY)","filings":13},{"name":"C2 STRATEGIES (ON BEHALF OF X-BOW LAUNCH SYSTEMS)","filings":12},{"name":"DRAKEN INTERNATIONAL, LLC","filings":8},{"name":"FORZA DC STRATEGIES, LLC OBO PETERSON'S","filings":8}],"firms":[{"name":"FIFESTRATEGIES, LLC","filings":492}],"issues":["FOR","DEF","TRD","HCR","BUD","ENV","AER","FIN","IMM","HOM","TAX","TRA","MED","AVI","LBR","CPI","INT","SCI","EDU"]}