{"id":56034,"name":"MICHAEL ZEHR","slug":"michael-zehr","revolvingDoor":true,"governmentPositions":["Legislative Assistant, US Sen. Mitch McConnell; Legislative Director, US Sen. Mel Martinez; Legislative Assistant, US Sen. Tim Hutchinson","LA for US Senator Mitch McConnell, LA for US Senator Tim Hutchinson, LD for US Senator Mel Martinez, Staff Director Senate Aging Committee, and LD for US Senator George LeMieux","LD, US Senator George LeMieux (R-FL); LD, US Senator Mel Martinez (R-FL); Staff Director, US Senate Special Committee on Aging; LA, US Senator Mitch McConnell (R-KY); and LA, US Senator Tim Hutchinson (R-AR)","Legislative Director, US Senator Mel Martinez; Legislative Director, US Senator George LeMieux; Staff Director, US Senate Special Committee on Aging; Legislative Assistant, US Senator Mitch McConnell; and Legislative Assistant, US Sen. Tim Hutchinson","Legislative Assistant, US Sen. Mitch McConnell; Legislative Director, US Sen. Mel Martinez; Legislative Assistant, US Sen. Tim Hutchinson; Staff Director Senate Aging Committee; Legislative Director US Sen. George LeMieux","Legislative Director, US Sen. Martinez (FL); Legislative Director, US Sen. LeMieux (FL); Staff Director, Sen. Aging Committee; Legislative Assistant, US Sen. McConnell (KY); Legislative Assistant, US Sen. Hutchinson (AR)","Legislative Director, Sen. LeMieux; Legislative Director, Sen. Martinez; Staff Director, Sen. Aging Committee; Legislative Assistant, Sen. McConnell; Legislative Assistant, Sen. Hutchinson","US Senator LeMieux, Legislative Director\nUS Senator Martinez, Legislative Director\nUS Senate Committee on Aging, Staff Director\nUS Senator McConnell, Legislative Assistant\nUS Senator Hutchinson, Legislative Assistant","Legislative Director US Sen. Martinez; Staff Director US Senate Aging Committee; Legislative Director US Sen. LeMieux; Legislative Assistant US Sen. McConnell; Legislative Assistant US Sen. Hutchinson","Legislative Director US Sen. Martinez; Staff Director US Sen. Aging Committee; Legislative Director US Sen. LeMieux; Legislative Assistant US Sen. McConnell; Legislative Assistant US Sen. Hutchinson","Legislative Assistant, U.S. Sen. Mitch McConnell; Legislative Director, U.S. Sen. Mel Martinez; Legislative Assistant, U.S. Sen. Tim Hutchinson"],"totalFilings":227,"yearlyActivity":[{"year":2018,"filings":35,"clients":10,"firms":1,"issues":["FUE","ENG","AVI","MAR","DEF","ENV","TAX","TRA","TRD"]},{"year":2019,"filings":52,"clients":11,"firms":1,"issues":["ENG","FUE","AVI","DEF","TAX","ENV","TRA","TRD","FIN","NAT"]},{"year":2020,"filings":71,"clients":13,"firms":1,"issues":["FUE","AVI","ENG","DEF","TAX","ENV","TRA","TRD","NAT","HCR","SCI"]},{"year":2021,"filings":35,"clients":7,"firms":1,"issues":["NAT","ENG","FUE","DEF","TRD","TAX","ENV"]},{"year":2022,"filings":34,"clients":7,"firms":1,"issues":["FUE","ENG","TAX","ENV","DEF","HOM","IMM","MAN","NAT"]}],"topClients":[{"name":"CONSUMER ENERGY ALLIANCE","filings":36},{"name":"SUNNOVA ENERGY CORPORATION","filings":36},{"name":"OCEAN MINERALS LLC","filings":32},{"name":"BP AMERICA, INC.","filings":23},{"name":"TCOM, L.P.","filings":18},{"name":"THE MICCOSUKEE TRIBE OF INDIANS OF FLORIDA","filings":15},{"name":"GENERAL ELECTRIC COMPANY","filings":13},{"name":"NEVADA VENADIUM COMPANY","filings":12},{"name":"SOS GLOBAL EXPRESS","filings":9},{"name":"ONTARIO TEACHERS PENSION PLAN","filings":9},{"name":"ASSOCIATION OF ENERGY SERVICE COMPANIES","filings":8},{"name":"ANBARIC DEVELOPMENT PARTNERS, LLC","filings":6},{"name":"SPOTTER RF","filings":4},{"name":"NATIONAL OCEAN POLICY COALITION","filings":3},{"name":"FLUXERGY, LLC","filings":3}],"firms":[{"name":"HBW RESOURCES","filings":227}],"issues":["FUE","ENG","AVI","MAR","DEF","ENV","TAX","TRA","TRD","FIN","NAT","HCR","SCI","HOM","IMM","MAN"]}