{"id":142601,"name":"MUFTIAH MCCARTIN","slug":"muftiah-mccartin","revolvingDoor":true,"governmentPositions":["House Rules Committee, Staff Dir., Dep Staff Dir.; House Select Committee on Voting Irregularities, GC (Detailed); House Committee on Appropriations, Prof Staff; House Parliamentarian, Assoc., Asst.","House Rules Committee, Staff Director, Deputy Staff Director; General Counsel (Detailed), House Select Committee on Voting Irregularities; House Committee on Appropriations, Professional staff; House Office of the Parliamentarian, Assoc., Asst.","House Rules Committee, Staff Director, Deputy Staff Director; General Counsel(Detailed), House Select Committee on Voting Irregularities; House Committee on Appropriations, Professional Staff, House Office of Parliamentarian, Assoc., Asst.","House Rules Committee, Staff Director, Deputy Staff Director; General Counsel (Detailed), House Select Committee on Voting Irregularities; House Committee on Appropriations, Professional Staff; House Office of Parliamentarian, Assoc., Ass.","House Rules Committee, Staff Director, Deputy Staff Director; House Select Committee on Voting Irregularities General Counsel (Detailed); Committee on Appropriations, Professional Staff; House Office of the Parliamentarian, Assoc., Asst.","House Rules Committee, Staff Director, Deputy Staff Director; General Counsel (detailed), House Select Committee on Voting Irregularities; House Committee on Appropriations, Professional Staff; House Office of the Parliamentarian, Assoc., Asst.","House Rules Committee, Staff Director, Deputy Staff Director; House Select Committee on Voting Irregularities, General Counsel (Detailed); Committee on Appropriations, Professional Staff; House Office of the Parliamentarian, Assoc., Asst."],"totalFilings":55,"yearlyActivity":[{"year":2023,"filings":15,"clients":2,"firms":1,"issues":[]},{"year":2024,"filings":18,"clients":3,"firms":1,"issues":["BUD","NAT","ENV","GOV","ACC"]},{"year":2025,"filings":22,"clients":4,"firms":1,"issues":["BUD","GOV","ENV","NAT"]}],"topClients":[{"name":"EARTHJUSTICE ACTION","filings":24},{"name":"WORLD WILDLIFE FUND, INC.","filings":15},{"name":"POLARIS PROJECT","filings":14},{"name":"ACACIA CENTER FOR JUSTICE","filings":2}],"firms":[{"name":"MCCARTIN PUBLIC POLICY GROUP LLC","filings":55}],"issues":["BUD","NAT","ENV","GOV","ACC"]}