{"id":63772,"name":"PAMELA BOWMAN","slug":"pamela-bowman","revolvingDoor":true,"governmentPositions":["Public Lands, maintenance backlogs in national parks","historic leasing in national parks; reauthorization of Historic Preservation Fund","national monuments; deferred maintenance in the parks; historic trail designation","reconstruction era historic network and emancipation trail legislation","national monuments; deferred maintenance in the parks; historic trail designation; Antiquities Act","Public Lands funding; maintenance backlog funding in the national parks","Emmett Till NHS; Rosenwald Schools Study; Brown V. Board NHS","national monuments; deferred maintenance in the parks; historic trail designation; Antiquities Act; preserving sites associated with the Civil Rights Movement","Public lands funding; deferred maintenance funding in the national parks and national monuments; programmatic funding for African-American cemeteries","historic leasing in national parks; permitting reform for energy and broadband access on public lands","Emmett Till NHS; Rosenwald Schools Study; Brown V. Board NHS; African-American Burial Grounds; Springfield Race Riots legislation; New Philadelphia Historic site legislation; Rosenwald Schools","Public lands funding; deferred maintenance funding in the national parks; HPF grant programs; programmatic funding for African-American cemeteries","Rosenwald Schools legislation and national monument proposals.","Rosenwald Schools;African-American Burial Grounds","national monuments; deferred maintenance in the parks;Route 66 historic trail designation; Antiquities Act;","Improvements to the federal rehabilitation tax credit.","Public lands funding including NPS deferred maintenance; DOI budget; HPF (grant programs and reauthorization); programmatic funding for African-American cemeteries.","National monument proposals.","African-American Burial Grounds","national monuments; deferred maintenance in the parks;Route 66 historic trail designation.","Public lands funding including NPS deferred maintenance; DOI budget; programmatic funding for African-American Burial Grounds.","National monuments; Great American Outdoors Act; federal designations and NPS programs; direct advocacy efforts for changes to and adoption of policies and procedures that support the preservation of historic and cultural resources.","African-American Burial Grounds; African American Civil Rights Network","National monuments; Great American Outdoors Act; federal designations; deferred maintenance in the parks; Route 66 historic trail designation.","Improvements to the federal rehabilitation tax credit; historic tax credit provisions in the One Big Beautiful Bill Act","National monuments; Great American Outdoors Act; federal designations; deferred maintenance in the parks; Route 66 historic trail designation, Historic Preservation Fund reauthorization, NHPA, and Section 106.","Public lands funding including NPS deferred maintenance; DOI budget; programmatic funding for African-American Burial Grounds; annual appropriations bills affecting historic preservation generally.","National monuments;Great American Outdoors Act/America the Beautiful Act;federal designations and NPS programs;direct advocacy efforts for changes to/adoption of policies and procedures that support the preservation of historic and cultural resources","National monuments;Great American Outdoors Act and America the Beautiful Act;federal designations;deferred maintenance in parks;Route 66 historic trail designation,Historic Preservation Fund reauthorization,NHPA and Section 106,including exemptions"],"totalFilings":193,"yearlyActivity":[{"year":2018,"filings":12,"clients":1,"firms":1,"issues":["BUD","POS","MAR","CIV","TRA","GOV","NAT"]},{"year":2019,"filings":48,"clients":1,"firms":1,"issues":["TRA","MAR","POS","CIV","BUD","GOV","NAT","TAX","BAN","FIN"]},{"year":2020,"filings":28,"clients":1,"firms":1,"issues":["BAN","FIN","CIV","MAR","TRA","TAX","BUD","GOV","NAT"]},{"year":2021,"filings":32,"clients":1,"firms":1,"issues":["TAX","BAN","FIN","TRA","MAR","CIV","BUD","GOV","NAT"]},{"year":2022,"filings":12,"clients":1,"firms":1,"issues":["BUD","GOV","CIV","NAT","TRA","TAX","BAN","FIN"]},{"year":2023,"filings":23,"clients":1,"firms":1,"issues":[]},{"year":2024,"filings":18,"clients":1,"firms":1,"issues":["BUD","GOV","CIV","NAT","TAX"]},{"year":2025,"filings":20,"clients":1,"firms":1,"issues":["BUD","GOV","CIV","NAT","TAX"]}],"topClients":[{"name":"NATIONAL TRUST FOR HISTORIC PRESERVATION","filings":193}],"firms":[{"name":"NATIONAL TRUST FOR HISTORIC PRESERVATION","filings":193}],"issues":["BUD","POS","MAR","CIV","TRA","GOV","NAT","TAX","BAN","FIN"]}