{"id":61658,"name":"PELHAM STRAUGHN","slug":"pelham-straughn","revolvingDoor":true,"governmentPositions":["Policy Director, House Committee on Agriculture; Senior Professional Staff, House Committee on Agriculture","Policy Director, House Committee on Agriculture; Senior Policy Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture; Legislative Assistant, Rep. Terry Everett","Policy Director, House Committee on Agriculture; Senior Policy Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture","Policy Director House Committee on Agriculture","Policy Director House Committee on Agriculture; Senior Professional Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture; Legislative Assistant, Rep. Terry Everett","Policy Director, House Committee on Agriculture; Senior Professional Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture; LA, Rep. Terry Everett","Policy Director, House Committee on Agriculture; Senior Policy Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture; LA, Rep. Terry Everett","Policy Director, House Committee on Agriculture; Professional Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture; Legislative Assistant, Rep. Terry Everett","Policy Director, House Committee on Agriculture; Senior Professional Staff, House Committee on Agriculture; Subcommittee Staff Director, House Committee on Agriculture; Legislative Assistant, Rep. Terry Everett","Legislative Assistant, Rep Terry Everett; Subcommittee Staff Director, House Agriculture Committee; Professional Staff, House Agriculture Committee; Policy Director, House Agriculture Committee","Legislative Assistant, Rep. Terry Everett; Subcommittee Staff Director, House Agriculture Committee; Professional Staff, House Agriculture Committee; Policy Director, House Agriculture Committee","Policy Director, House Ag Committee; Senior Professional Staff, House Ag Committee; Subcommittee Staff Director, House Ag Committee; LA, Rep. Terry Everett"],"totalFilings":207,"yearlyActivity":[{"year":2018,"filings":36,"clients":7,"firms":1,"issues":["AGR","BUD"]},{"year":2019,"filings":36,"clients":7,"firms":1,"issues":["AGR","BUD"]},{"year":2020,"filings":21,"clients":7,"firms":1,"issues":["AGR","BUD"]},{"year":2021,"filings":36,"clients":7,"firms":1,"issues":["BUD","AGR"]},{"year":2022,"filings":37,"clients":8,"firms":1,"issues":["AGR","BUD"]},{"year":2024,"filings":20,"clients":6,"firms":1,"issues":["AGR","BUD"]},{"year":2025,"filings":21,"clients":6,"firms":1,"issues":["AGR","BUD"]}],"topClients":[{"name":"NATIONAL WATERSHED COALITION","filings":46},{"name":"AMERICAN FARMLAND TRUST","filings":36},{"name":"SONOMA COUNTY WATER AGENCY","filings":27},{"name":"LAND TRUST ALLIANCE","filings":25},{"name":"AMERICAN WATER WORKS ASSOCIATION","filings":24},{"name":"SONOMA COUNTY AGRICULTURAL PRESERVATION AND OPEN SPACE DISTRICT","filings":19},{"name":"RUSSELL GROUP INC OBO LAND O'LAKES INC","filings":14},{"name":"LAND O'LAKES","filings":12},{"name":"THEODORE ROOSEVELT CONSERVATION PARTNERSHIP","filings":4}],"firms":[{"name":"9B GROUP, INC.","filings":207}],"issues":["AGR","BUD"]}