{"id":71065,"name":"REGINA MAHONY","slug":"regina-mahony","revolvingDoor":true,"governmentPositions":["Senior Policy Advisor, House Majority Leader/Democratic Whip Steny H Hoyer; Senior Policy Advisor, Rep. Cal Dooley","Senior Policy Advisor, House Majority Leader/Democratic Whip Rep. Steny H Hoyer; Senior Policy Advisor, Rep. Cal Dooley","Senior Policy Advisor, House Majority Leader/House Democratic Whip Rep. Steny H Hoyer; Senior Policy Advisor, Rep. Cal Dooley","Senior Policy Advisor, House Majority Leader/Democratic Whip Rep. Steny H Hoyer; Senior Policy Advisor Rep. Cal Dooley","Senior Policy Advisor, House Majority Leader/Democratic Whip Rep. Steny H Hoyer","Senior Policy Advisor, House Democratic Whip/Majority Leader Steny H Hoyer Senior Policy Advisor, Rep. Cal Dooley","Senior Policy Advisor, Rep. Cal Dooley; Senior Policy Advisor House Democratic Whip Steny H Hoyer; Senior Policy Advisor House Majority Leader Steny Hoyer","Senior Policy Advisor, Rep Cal Dooley; Senior Policy Advisor, House Democratic Whip Steny H Hoyer; Senior Policy Advisor, House Majority Leader Steny H Hoyer","Senior Policy Advisor, Rep. Cal Dooley; Senior Policy Advisor, House Democratic Whip Steny H Hoyer; Senior Policy Advisor, House Majority Leader Steny H Hoyer","Senior Policy Advisor, Rep. Cal Dooley; Senior Policy Advisor, House Democratic Whip Rep Steny H Hoyer; Senior Policy Advisor House Majority Leader Steny H Hoyer","Senior Policy Advisor, Rep. Cal Dooley; Senior Policy Advisor, House Democratic Whip Steny H Hoyer; House Majority Leader Steny H Hoyer","Senior Policy Advisor, House Majority Leader Steny H Hoyer; Senior Policy Advisor Democratic Whip Steny H Hoyer; Senior Policy Advisor Rep. Cal Dooley","Senior Policy Advisor, Rep. Cal Dooley; Senior Policy Advisor, Democratic Whip Steny H Hoyer; Senior Policy Advisor, House Majority Leader Steny H Hoyer","Senior Policy Advisor, Rep Cal Dooley; Senior Policy Advisor, Democratic Whip/Majority Leader Steny H Hoyer","Democratic Whip Steny H Hoyer; Majority Leader Steny H Hoyer","Senior Policy Advisor, Democratic Whip/Majority Leader Steny H Hoyer"],"totalFilings":108,"yearlyActivity":[{"year":2019,"filings":24,"clients":2,"firms":1,"issues":["BUD","ENG","SMB","TAX","LBR","FIN","ENV"]},{"year":2020,"filings":34,"clients":5,"firms":1,"issues":["ENG","BUD","ENV","TAX","LBR","SMB","AGR","DEF","BAN"]},{"year":2021,"filings":22,"clients":5,"firms":1,"issues":["TAX","SMB","LBR","BUD","AGR","ENG","TRA"]},{"year":2022,"filings":25,"clients":4,"firms":1,"issues":["MMM","HCR","AGR","BUD","TAX","ENG"]},{"year":2024,"filings":3,"clients":2,"firms":1,"issues":["BUD","MMM"]}],"topClients":[{"name":"CITIZENS FOR RESPONSIBLE ENERGY SOLUTIONS","filings":33},{"name":"NFIB (NATIONAL FEDERATION OF INDEPENDENT BUSINESS)","filings":22},{"name":"FLYWHEEL GOVERNMENT SOLUTIONS","filings":15},{"name":"THE WASHINGTON TAX & PUBLIC POLICY GROUP O/B/O ALLIANCE FOR BIOPHARMA","filings":11},{"name":"THE WASHINGTON TAX & PUBLIC POLICY GROUP ON BEHALF OF THE TAX REFORM COALITION","filings":9},{"name":"BOCKORNY GROUP OBO POST ACUTE MEDICAL, LLC","filings":7},{"name":"THE WASHINGTON TAX & PUBLIC POLICY GROUP OBO ALLIANZ CAPITAL PARTNERS GMBH","filings":6},{"name":"THE WASHINGTON TAX & PUBLIC POLICY GROUP ON BEHALF OF LINCOLN INFRASTRUCTURE USA","filings":5}],"firms":[{"name":"DOMER CONSULTING, LLC","filings":108}],"issues":["BUD","ENG","SMB","TAX","LBR","FIN","ENV","AGR","DEF","BAN","TRA","MMM","HCR"]}