{"id":145870,"name":"RICHARD VAN BUREN","slug":"richard-van-buren","revolvingDoor":true,"governmentPositions":["Leg. Correspondent, Senator Whitehouse; Assoc. Leg. Assistant, Leg. Assistant, Leg. Counsel, CMS; Health Insurance Spec., Medicaid; Senior Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel, Committee on Energy and Commerce","Leg. Correspondent, Senator Whitehouse; Assoc. Leg. Assistant, Leg. Assistant, Leg. Counsel, CMS; Health Insurance Specialist, Medicaid; Senior Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel, Committee on Energy and Commerce","Leg. Correspondent, Sen. Sheldon Whitehouse; Assoc. Leg. Assistant, Leg. Assistant, Leg. Counsel, CMS; Health Insurance Spec., Medicaid; Senior Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel, Committee on Energy and Commerce","Leg. Correspondent, Sen. Sheldon Whitehouse; Assoc. Leg. Assistant; Leg. Assistant, Leg. Counsel, CMS; Health Insurance Spec., Medicaid; Senior Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel; Committee on Energy and Commerce","Leg. Correspondent, Sen. Sheldon Whitehouse; Assoc. Leg. Assistant, Leg. Counsel, CMS; Health Insurance Spec., Medicaid; Senior Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel, Committee on Energy and Commerce","Leg. Correspondent, Sen. Sheldon Whitehouse; Assoc. Leg. Assistant, Leg. Assistant, Leg. Counsel, CMS; Health Insurance Spec., Medicaid; Senor Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel, Committee on Energy and Commerce","Leg. Correspondent, Sen. Sheldon Whitehouse; Assoc. Leg. Assistant, Leg. Assistant, CMS; Health Insurance Spec., Medicaid; Senior Analyst, CHIP Payment and MACPAC; Health Counsel, Senior Health Counsel, Committee on Energy and Commerce"],"totalFilings":58,"yearlyActivity":[{"year":2024,"filings":25,"clients":11,"firms":1,"issues":["HCR","MMM","BUD"]},{"year":2025,"filings":33,"clients":12,"firms":1,"issues":["HCR","MMM","EDU","BUD","SCI"]}],"topClients":[{"name":"AMERICA'S ESSENTIAL HOSPITALS","filings":8},{"name":"MEDICAID HEALTH PLANS OF AMERICA","filings":6},{"name":"PHILADELPHIA COLLEGE OF OSTEOPATHIC MEDICINE","filings":6},{"name":"THOMAS JEFFERSON UNIVERSITY","filings":5},{"name":"HEALTH AND HOSPITAL CORPORATION OF MARION COUNTY INDIANA","filings":4},{"name":"AMERIHEALTH CARITAS HEALTH PLAN","filings":4},{"name":"LOOK-ALIKE ADVOCACY COALITION (INFORMAL COALITION)","filings":4},{"name":"CALIFORNIA ASSOCIATION OF PUBLIC HOSPITALS AND HEALTH SYSTEMS","filings":4},{"name":"UNIVERSITY OF MINNESOTA","filings":4},{"name":"CALIFORNIA CHILDREN'S HOSPITAL ASSOCIATION","filings":3},{"name":"ACTIVE MINDS","filings":2},{"name":"RUSH UNIVERSITY SYSTEM FOR HEALTH","filings":2},{"name":"NATIONAL RESIDENT MATCHING PROGRAM","filings":2},{"name":"AMERICAN ASSOCIATION OF ORTHODONTISTS","filings":2},{"name":"INDEPENDENCE BLUE CROSS","filings":1},{"name":"AMERICAN ACADEMY OF FAMILY PHYSICIANS","filings":1}],"firms":[{"name":"COZEN O'CONNOR PUBLIC STRATEGIES","filings":58}],"issues":["HCR","MMM","BUD","EDU","SCI"]}