{"id":149027,"name":"RONALD STORHAUG","slug":"ronald-storhaug","revolvingDoor":true,"governmentPositions":["Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, Tax and Econ Policy Advisor, Senate Small Business Cmte; Sr Econ Policy Advisor, Econ Policy Advisor, Legis Asst, Senate Member Office (Kaine);Staff Asst, Senate Budget Committee","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, Tax and Econ Policy Advisor, Senate Small Business Cmte; Sr Econ Policy Advisor, Econ Policy Advisor, Legis Asst, Senate Member Office(Kaine);Staff Asst, Senate Budget Committee","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, Tax andEcon Policy Advisor, Senate Small Business Cmte; Sr Econ Policy Advisor,Econ Policy Advisor, Legis Asst, Senate Member Office(Kaine);Staff Asst,Senate Budget Committee","Dep Asst Sec, Dep of Treasury; Director of Tax and EconPolicy, Tax and Econ Policy Advisor, Senate Small BusinessCmte; Sr Econ Policy Advisor, Econ Policy Advisor, LegisAsst, Senate Member Office(Kaine);Staff Asst, Senate BudgetCommittee","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, Tax andEcon Policy Advisor, Senate Small Business Cmte; Sr Econ Policy Advisor, Econ Policy Advisor, Legis Asst, Senate Member Office(Kaine);Staff Asst, Senate Budget Committee","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, Tax and Econ PolicyAdvisor, Senate Small Business Cmte; Sr Econ Policy Advisor, Econ Po","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, TaxandEcon Policy Advisor, Senate Small Business Cmte; Sr Econ PolicyAdvisor,Econ Policy Advisor, Legis Asst, Senate MemberOffice(Kaine);Staff Asst,Senate Budget Committee","PSM-Detailee, Senate Appropriations Committee; House LiaisonAssistant, Coast Guard House Liaison Office; Coast Guard Fellow, SelectCommittee on Homeland Security","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, Tax andEconPolicy Advisor, Senate Small Business Cmte; Sr Econ Policy Advisor,EconPolicy Advisor, Legis Asst, Senate Member Office(Kaine);Staff Asst,SenateBudget Committee","Dep Asst Sec, Dep of Treasury; Director of Tax and Econ Policy, TaxandEconPolicy Advisor, Senate Small Business Cmte; Sr Econ PolicyAdvisor,EconPolicy Advisor, Legis Asst, Senate MemberOffice(Kaine);Staff Asst,SenateBudget Committee"],"totalFilings":164,"yearlyActivity":[{"year":2025,"filings":164,"clients":15,"firms":1,"issues":["HOU","NAT","ENV","BAN","TAX","FIN","ENG","DEF","HOM","DIS","SPO","TRD","MAN","SCI","FOR","BUD","CAW","LBR","RRR","TRU","TEC","TRA","CSP","AGR","MED"]}],"topClients":[{"name":"AMERICAN CRITICAL MINERALS ASSOCIATION","filings":34},{"name":"NATIONAL ASSOCIATION OF HOME BUILDERS","filings":24},{"name":"ALLIED UNIVERSAL SECURITY SERVICES LLC","filings":18},{"name":"NIKE, INC","filings":18},{"name":"AMERICAN WOOD COUNCIL","filings":15},{"name":"UNITED PARCEL SERVICE","filings":11},{"name":"STRIPE, INC.","filings":8},{"name":"GENERAC POWER SYSTEMS, INC.","filings":8},{"name":"INTERSTATE GAS SUPPLY, LLC DBA IGS ENERGY","filings":6},{"name":"CALIFORNIA ASSOCIATION OF WINEGRAPE GROWERS","filings":6},{"name":"BANCFIRST","filings":4},{"name":"CHENEGA CORPORATION","filings":3},{"name":"GARMIN INTERNATIONAL, INC.","filings":3},{"name":"OCTAPHARMA USA, INC.","filings":3},{"name":"MAINSPRING ENERGY INC","filings":3}],"firms":[{"name":"CORNERSTONE GOVERNMENT AFFAIRS, INC.","filings":164}],"issues":["HOU","NAT","ENV","BAN","TAX","FIN","ENG","DEF","HOM","DIS","SPO","TRD","MAN","SCI","FOR","BUD","CAW","LBR","RRR","TRU","TEC","TRA","CSP","AGR","MED"]}