{"id":72342,"name":"RYAN LEAVITT","slug":"ryan-leavitt","revolvingDoor":true,"governmentPositions":["Sen. Mike Lee- Special Assistant, Senate Judiciary Committee- Clerk, Sen. Dean Heller - Clerk, Staff Assistant, Legislative Correspondent, Sen. Orrin Hatch- Counsel, Senate Judiciary Committee- Counsel, Rep. John Curtis- Deputy Chief of Staff","Sen. Josh Hawley - Legislative Director","Sen. Josh Hawley - Legislative Director; Sen. Mike Lee- Special Assistant, Senate Judiciary Committee- Clerk, Sen. Dean Heller - Clerk, Staff Assistant, Legislative Correspondent, Sen. Orrin Hatch- Counsel, Senate Judiciary Committee- Counsel, Rep. John Curtis- Deputy Chief of Staff","Sen. Mike Lee- Special Assistant, Senate Judiciary Committee- Clerk, Sen. Dean Heller - Clerk, Staff Assistant, Legislative Correspondent, Sen. Orrin Hatch- Counsel, Senate Judiciary Committee- Counsel, Rep. John Curtis- Deputy Chief of Staff; Sen. Josh Hawley - Legislative Director","Legislative Director","Sen. Mike Lee- Special Assistant, Senate Judiciary Committee Clerk, Sen. Dean Heller- Clerk, Staff Assistant, Legislative Correspondent, Sen. Orrin Hatch- Counsel, Senate Judiciary Committee- Counsel, Rep. John Curtis- Deputy Chief of Staff; Senator Josh Hawley- Legislative Director","Legislative Director- Sen. Josh Hawley","Special Assistant- Sen. Mike Lee; Clerk- Sen. Judiciary Committee; Staff Assistant, Legislative Correspondent- Sen. Dean Heller; Counsel- Sen. Orrin Hatch, Sen. Judiciary Committee; Deputy Chief of Staff- Rep. John Curtis","Sen. Mike Lee- Special Assistant, Senate Judiciary Committee-Clerk, Sen. Dean Heller- Clerk, Staff Assistant, Legislative Correspondent, Sen. Orrin Hatch- Counsel, Senate Judiciary Committee- Counsel, Rep. John Curtis- Deputy Chief of Staff; Sen. Josh Hawley- Legislative Director","Leg. Dir.- Sen. Josh Hawley","Senator Josh Hawley, Legislative Director","Sen. Josh Hawley- Legislative Director","Sen. Josh Hawley, Legislative Director","Special Assistant, Law Clerk- Sen. Mike Lee Staff Assistant/Legislative Correspondant- Sen. Dean Heller Counsel- Sen. Orrin Hatch/Sen. Judiciary Committee Legislative Director/Dept. COS- Rep. John Curtis Legislative Director- Sen. Josh Hawley","Special Assistant/Law Clerk- Sen. Mike Lee/Sen. Jud. Committee; Staff Assistant/Legislative Correspondent- Sen. Dean Heller; Council- Sen. Orrin Hatch/Sen. Jud. Committee; Deputy Chief of Staff/Leg Dir.- Rep. John Curtis; Leg. Dir.- Sen. Josh Hawley","Sen. Mike Lee- Special Assistant, Senate Jud. Comm- Clerk, Sen. Dean Heller - Clerk, Staff Assistant, Legislative Correspondent, Sen. Orrin Hatch- Counsel, Senate Jud. Comm- Counsel, Rep. John Curtis- Deputy Chief of Staff; Sen Hawley-Leg. Direc","Sen. Mike Lee- Special Assistant, Sen. Judiciary Committee- Clerk, Sen. Dean Heller - Clerk, Staff Assistant, Leg. Correspondent, Sen. Orrin Hatch- Counsel, Sen. Judiciary Committee- Counsel, Rep. John Curtis- Deputy CoS. Sen. Josh Hawley - LD","Special Assistant;Law Clerk- Sen. Mike Lee; Sen. Judiciary Committee Staff Assistant/Leg Correspondent - Sen. Dean Heller Counsel - Sen. Orrin Hatch; Sen. Judiciary Committee Dept. COS/Leg Director- Rep. John Curtis Leg Director- Sen. Josh Hawley","Sen. Lee- Special Assistant, Senate Judiciary Committee- Clerk, Sen. Heller - Clerk, Staff Assistant, Leg Correspondent, Sen. Orrin Hatch- Counsel, Senate Judiciary Committee- Counsel, Rep. Curtis- Deputy Chief of Staff. Sen Hawley - Leg Director","Special Assistant, Law Clerk- Sen. Mike Lee Staff Assistant/Legislative Correspondent- Sen. Dean Heller Counsel- Sen. Orrin Hatch/Sen. Judiciary Committee Legislative Director/Dept. COS- Rep. John Curtis Legislative Director- Sen. Josh Hawley"],"totalFilings":510,"yearlyActivity":[{"year":2019,"filings":7,"clients":4,"firms":1,"issues":["TRA","NAT","HCR","MMM","BUD","DEF","AVI"]},{"year":2020,"filings":81,"clients":9,"firms":1,"issues":["HCR","MMM","BUD","ENV","TRA","NAT","RES","IMM","CPT","DEF","AVI","LAW","MED"]},{"year":2021,"filings":91,"clients":9,"firms":1,"issues":["LAW","BUD","ENV","RES","TRA","NAT","IMM","MMM","MED","HCR","URB","DIS","HOM","DEF"]},{"year":2022,"filings":120,"clients":10,"firms":1,"issues":["NAT","ENV","BUD","RES","TRA","IMM","HCR","MED","MMM","LAW","DEF","URB","DIS","HOU","UTI"]},{"year":2024,"filings":90,"clients":13,"firms":1,"issues":["BUD","EDU","TRA","IMM","NAT","HCR","MED","MMM","DIS","UTI","ENV","DEF"]},{"year":2025,"filings":121,"clients":17,"firms":1,"issues":["TAX","HCR","TRA","BUD","ENV","NAT","DIS","UTI","DEF","EDU","ENG","GOV","TAR","TRD"]}],"topClients":[{"name":"PARK CITY UTAH","filings":87},{"name":"SOUTH COAST WATER DISTRICT","filings":50},{"name":"WASATCH FRONT REGIONAL COUNCIL","filings":44},{"name":"SONIC HEALTHCARE USA","filings":43},{"name":"COVINGTON WATER DISTRICT","filings":43},{"name":"MILLCREEK, UTAH","filings":37},{"name":"BEACH CITIES HEALTH DISTRICT","filings":36},{"name":"UTAH TRANSIT AUTHORITY (UTA)","filings":22},{"name":"SOUTH JORDAN, UTAH","filings":22},{"name":"HOLLADAY, UTAH","filings":21},{"name":"KNOWMADICS, INC","filings":20},{"name":"O'BRIEN, GENTRY & SCOTT LLC (ON BEHALF OF ULTRA ELECTRONICS)","filings":12},{"name":"UTAH VALLEY UNIVERSITY","filings":12},{"name":"SPREAD THE WORD NEVADA","filings":11},{"name":"LEHI, UTAH","filings":9},{"name":"THE BENNETT CONSULTING GROUP FKA THE BENNETT CONSULTING GROUP OBO CITY OF MOAB","filings":8},{"name":"MUNICIPAL WATER DISTRICT OF ORANGE COUNTY CALIFORNIA","filings":6},{"name":"UNIVERSITY OF UTAH--ARUP LABORATORIES","filings":6},{"name":"CENTERLINE ACTION, INC.","filings":5},{"name":"AMERICAN CAPITOL GROUP OBO BALANCE OF NATURE","filings":5},{"name":"OPERATION UNDERGROUND RAILROAD","filings":4},{"name":"ADVANTAGE CAPITAL","filings":4},{"name":"PATEL PARTNERS OBO NIAGARA BOTTLING, LLC","filings":3}],"firms":[{"name":"BARKER LEAVITT, PLLC (SKA MR. JAMES C. BARKER)","filings":510}],"issues":["TRA","NAT","HCR","MMM","BUD","DEF","AVI","ENV","RES","IMM","CPT","LAW","MED","URB","DIS","HOM","HOU","UTI","EDU","TAX","ENG","GOV","TAR","TRD"]}