{"id":63292,"name":"SARAH DUMONT-MERCHAK","slug":"sarah-dumont-merchak","revolvingDoor":true,"governmentPositions":["Senate Banking Committee professional staff member, former Rep. Bill McCollum, senior banking associate, former REp. Bill Barr, deputy legislative director, House Banking and Financial Services Committee staff member","Senate Banking Committee professional staff member, former Rep. Bill McCollum, senior banking associate former Rep. Bill Barr, deputy legislative director, House Banking and Financial Services Committee staff member","Senate Banking Committee professional staff member, former Rep. Bill McCollum, senior banking associate, former Rep. Bill Barr, deputy legislative director, House Banking and Financial Services Committee staff member","Senate Banking Committee professional staff member, Rep. Bill McCollum, senior banking associate, Rep. Bob Barr, deputy legislative director, House Banking and Financial Services staff member","Senate Banking Committee professional staff member, former Rep. Bill McCollum, senior banking associate, former Rep. Bill Barr, deputy legislative director, House Banking and Financial Service Committee staff member","Chief of staff to Rep. Xavier Becerra, legislative director to Rep. Becerra, legislative counsel to Rep. Becerra, Chief of Staff, Office of Policy and Planning, U.S. Department of Education, Immigration Counsel, U.S. Department of Justice","Senate Banking Committee professional staff member, former Rep. Bill McCollum, senior banking associate, former Rep. Bob Barr, deputy legislative director, House Banking and Financial Services staff member","Senate Banking Committee professional staff member, former REp. Bill McCollum, senior banking associate, former Rep. Bill Barr, deputy legislative director, House Banking and Financial Service Committee staff member","Senate Banking Committee professional staff member, former Rep. Bill McCollum, senior banking associate, former Rep Bill Barr, deputy legislative director, House Banking and Financial Services Committee staff member"],"totalFilings":201,"yearlyActivity":[{"year":2018,"filings":201,"clients":17,"firms":1,"issues":["LBR","VET","SMB","IMM","HOM","TRD","TEC","FIN","TAX","CPT","CSP","INT","ADV","CPI","ENV","TRA","HCR","SCI","COM","AVI","EDU","MAN","ENG","LAW"]}],"topClients":[{"name":"CONSUMER TECHNOLOGY ASSOCIATION (PREVIOUSLY THE CONSUMER ELECTRONICS ASSOCIATION","filings":39},{"name":"AMAZON.COM","filings":24},{"name":"OATH INC AND VARIOUS SUBSIDIARIES FORMERLY KNOWN AS YAHOO! INC","filings":24},{"name":"LUTRON ELECTRONICS CO., INC.","filings":16},{"name":"ZEBRA TECHNOLOGIES","filings":16},{"name":"INTEL CORPORATION","filings":16},{"name":"SPRINT CORPORATION (FORMERLY SPRINT)","filings":15},{"name":"THE INTERNET INFRASTRUCTURE COALITION (I2COALITION)","filings":12},{"name":"DELL USA LP","filings":9},{"name":"COMPETITIVE CARRIERS ASSOCIATION (FORMERLY RURAL CELLULAR ASSOCIATION)","filings":8},{"name":"ENGINE ADVOCACY","filings":6},{"name":"MUSIC.INNOVATION.CONSUMERS COALITION \"MIC\"","filings":6},{"name":"PANDORA MEDIA LLC","filings":4},{"name":"CAROLINA WEST WIRELESS","filings":2},{"name":"HUMETRIX","filings":2},{"name":"IMMIGRATION VOICE","filings":1},{"name":"PORTER AND KORVICK, P.A.","filings":1}],"firms":[{"name":"TWINLOGIC STRATEGIES, LLP","filings":201}],"issues":["LBR","VET","SMB","IMM","HOM","TRD","TEC","FIN","TAX","CPT","CSP","INT","ADV","CPI","ENV","TRA","HCR","SCI","COM","AVI","EDU","MAN","ENG","LAW"]}