{"id":65052,"name":"SARAH BLACKWOOD","slug":"sarah-blackwood","revolvingDoor":true,"governmentPositions":["Leg. Director - U.S. DOE Energy Efficiency and Renewable Energy (EERE); Leg. Director - Congressman Jerry F. Costello; Prof. Staff - House Transp. and Infrastructure Com.","Leg. Director - U.S. DOE, Office of Energy Efficiency and Renewable Energy; Leg. Director - Congressman Jerry F. Costello; Prof. Staff - House Transp. & Infrastructure Comm.","Leg. Director - U.S. DOE, Office of Energy Efficiency and Renewable Energy; Leg. Director - U.S. Congressman Jerry F. Costello; Professional Staff - House Transportation and Infrastructure Committee","Department of Energy (DOE), Director of Congressional Affairs, Energy Efficiency and Renewable Energy Office; Legislative Director and Professional Staff, Congressman Jerry F. Costello (D-IL)","Department of Energy, Legislative Affairs Director, Energy Efficiency and Renewable Energy (EERE); Legislative Director and Professional Staff House Transportation and Infrastructure Committee, Congressman Jerry F. Costello (D-IL)","Department of Energy, Legislative Affairs Director, EERE; U.S. House of Representatives, Legislative Director and Professional Staff House T&I Committee, Congressman Jerry F. Costello","U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy (EERE), Director of Legislative Affairs; U.S. Congressman Jerry F. Costello (D-IL), Legislative Director, Professional Staff on House Transportation and Infrastructure Comm.","U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy (EERE), Director of Legislative Affairs; U.S. House of Representatives, Committee on Transportation and Infrastructure and Office of Congressman Jerry F. Costello (D-IL)","Legislative Director and House Transportation and Infrastructure Professional Staff for Congressman Costello (D-(IL); Legislative Affairs Director at the Office of Energy Efficiency and Renewable Energy (EERE) office at the U.S. Department of Energy","Legislative Affairs Congressional Director - U.S. Department of Energy, EERE Professional Staff - U.S. House Committee on Transportation and Infrastructure Legislative Director - U.S. Congressman Jerry F. Costello (D-IL)"],"totalFilings":136,"yearlyActivity":[{"year":2018,"filings":21,"clients":3,"firms":1,"issues":["TRD","MAN","AUT","LBR","AVI","TRA"]},{"year":2019,"filings":15,"clients":2,"firms":1,"issues":["TRA","TRD","LBR","AVI","EDU"]},{"year":2020,"filings":21,"clients":2,"firms":1,"issues":["BUD","AVI","LBR","TRD","TRA","DIS","MAN"]},{"year":2021,"filings":18,"clients":2,"firms":1,"issues":["BUD","AVI","LBR","MAN","TRD","IMM","TOU","ENV"]},{"year":2022,"filings":12,"clients":2,"firms":1,"issues":["AVI","LBR","ENV"]},{"year":2023,"filings":18,"clients":2,"firms":1,"issues":[]},{"year":2024,"filings":18,"clients":2,"firms":1,"issues":["AUT","ENG","MAN","TRD","TAX","AVI","LBR"]},{"year":2025,"filings":13,"clients":3,"firms":1,"issues":["MAN","TAX","AVI","LBR","ENG"]}],"topClients":[{"name":"ASSOCIATION OF FLIGHT ATTENDANTS-CWA","filings":72},{"name":"NOVELIS INC.","filings":35},{"name":"BIRLA CARBON U.S.A.","filings":14},{"name":"TAIYO NIPPON SANSO CORP.","filings":8},{"name":"FLEISHMANHILLARD INC ON BEHALF OF NOVELIS INC","filings":6},{"name":"MOMENTUM TECHNOLOGIES","filings":1}],"firms":[{"name":"SARAH BLACKWOOD GOVERNMENT RELATIONS, LLC","filings":136}],"issues":["TRD","MAN","AUT","LBR","AVI","TRA","EDU","BUD","DIS","IMM","TOU","ENV","ENG","TAX"]}