{"id":101685,"name":"SARAH BOLTON","slug":"sarah-bolton","revolvingDoor":true,"governmentPositions":["Education Policy Director, Senate HELP Committee, Dem. Staff; Sr. Policy and Budget Advisor, Senate Budget Committee, Dem. Staff; Legislative Assistant and Legislative Aide, Sen. Patty Murray; Staff Assistant, Senate Budget Committee, Clerk's Office","Edu Policy Director, Sen HELP Cmte Maj (Dem); Snr Policy & Budget Advisor, Sen Budget Cmte Min (Dem); Legislative Assistant, Sen Patty Murray; Legislative Aide, Sen Patty Murray; Staff Assistant, Sen Budget Cmte Clerk's Office; Intern, Rep Clyburn","Education Policy Director, Senate HELP Committee, Dem.Staff; Sr. Policy and Budget Advisor, Senate Budget Committee, Dem. Staff; Legislative Assistant and Legislative Aide, Sen. Patty Murray; Staff Assistant, Senate Budget Committee, Clerk's Office","Edu Policy Director, Sen HELP Cmte Maj (Dem); Snr Policy & Budget Advisor, Sen Budget Cmte Min ( Dem); Legislative Assistant, Sen Patty Murray, Legislative Aide, Sen Patty Murray; Staff Assistant, Sen Budget Cmte Clerks Office; Inter, Rep Clyburn","Education Policy Director,Senate HELP Committee, Dem. Staff; Sr. Policy and Budget Advisor,Senate Budget Committee, Dem. Staff; Legislative Assistant and Legislative Aide, Sen. Patty Murray; Staff Assistant, Senate Budget Committee,Clerk's Office","Education Policy Director,Senate HELP Committee, Dem. Staff; Sr. Policy and Budget Advisor, Senate Budget Committee, Dem. Staff; Legislative Assistant and Legislative Aide, Sen. Patty Murray; Staff Assistant,Senate Budget Committee,Clerk's Office","Education Policy Director, Senate HELP Committee, Dem. Staff; Sr. Policy and Budget Advisor,Senate Budget Committee, Dem. Staff; Legislative Assistant and Legislative Aide, Sen. Patty Murray;Staff Assistant,Senate Budget Committee,Clerk's Office","Education Policy Director, Senate HELP Committee,Dem. Staff;Sr. Policy and Budget Advisor,Senate Budget Committee, Dem. Staff; Legislative Assistant and Legislative Aide, Sen. Patty Murray; Staff Assistant, Senate Budget Committee, Clerk's Office"],"totalFilings":212,"yearlyActivity":[{"year":2021,"filings":60,"clients":4,"firms":1,"issues":["ALC","CIV","UNM","HCR","SMB","HOU","BUD","WEL","LAW","LBR","FAM","IMM","EDU"]},{"year":2022,"filings":90,"clients":4,"firms":1,"issues":["ALC","BUD","CIV","HCR","LAW","HOU","UNM","WEL","SMB","EDU","FAM","LBR","IMM"]},{"year":2024,"filings":34,"clients":4,"firms":1,"issues":["CIV","LAW","EDU","FAM","LBR","IMM","HCR","AGR","BUD"]},{"year":2025,"filings":28,"clients":4,"firms":1,"issues":["EDU","FAM","LBR","IMM","HCR","AGR","BUD","GOV"]}],"topClients":[{"name":"ALLIANCE FOR SAFETY AND JUSTICE","filings":89},{"name":"MOMSRISING","filings":52},{"name":"HUMAN MILK BANKING ASSOCIATION OF NORTH AMERICA","filings":22},{"name":"ROBERTS ENTERPRISE DEVELOPMENT FUND","filings":21},{"name":"FEEDING AMERICA","filings":14},{"name":"WOMEN DONORS NETWORK ACTION","filings":8},{"name":"TIDES NETWORK","filings":4},{"name":"REFORM ALLIANCE","filings":2}],"firms":[{"name":"THE RABEN GROUP","filings":212}],"issues":["ALC","CIV","UNM","HCR","SMB","HOU","BUD","WEL","LAW","LBR","FAM","IMM","EDU","AGR","GOV"]}