{"name":"SHAW SPRAGUE","slug":"shaw-sprague","positions":["Delta Queen renovation and compliance with Safety at Sea Act","maritime vessel safety","Opportunity Zones","improvements to the federal rehabilitation tax credit","HPF Funding","Opportunity Zone regulations affecting housing and historic preservation tax incentives; preservation of Cape Flattery lighthouse","improvements to the federal rehabilitation tax credit; expanding historic tax credits within established Opportunity Zones in designated census tracts.","HPF Funding; Rural Development grant funding; tribal consultation affecting Cape Flattery lighthouse, WA","housing and density issues in historic districts","Preservation of Cape Flattery Lighthouse (WA)","surface transportation reauthorization","improvements to the federal rehabilitation tax credit; expanding historic tax credits within established Opportunity Zones in designated census tracts; increase in historic tax credits as part of infrastructure reauthorization and funding","Leveraging opportunities affecting outleasing of federal historic properties","surface transportation reauthorization and infrastructure funding","general maritime issues affecting historic vessels and lighthouses","HPF Funding; Rural Development grant funding; COVID-19 relief funding for Main Street communities","improvements to the federal rehabilitation tax credit; curbing easement valuation abuses; increase in historic tax credits as part of infrastructure reauthorization and funding;","reauthorization of historic preservation funding and increase in authorization for Historic Preservation Fund","improvements to the federal rehabilitation tax credit; curbing easement valuation abuses; increase in historic tax credits as part of infrastructure reauthorization and funding; tax credits relating to neighborhood homes and downtown revitalization","HPF Funding; funding for Main Street communities; Historic Preservation Fund reauthorization","Leveraging opportunities affecting outleasing of federal historic properties; climate change policy across federal agencies; permitting review for energy and broadband access","Historic Preservation Fund (HPF) reauthorization and advocacy for HPF subgrant programs for historic preservation","Leveraging opportunities affecting outleasing of federal historic properties; climate change policy across federal agencies.","Annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY25 and FY26; reauthorization of Historic Preservation Fund","Direct advocacy efforts for changes to and adoption of policies and procedures that support the preservation of historic and cultural resources.","General matters impacting National Historic Preservation Act, including HPF reauthorization.","Build support for community development tax incentives, particularly those that support building reuse; Improvements to the federal rehabilitation tax credit; tax credits relating to neighborhood homes and downtown revitalization","Annual appropriations affecting historic preservation from the Historic Preservation Fund and Department of Interior budget request for FY25 and FY26","Build support for community development tax incentives,particularly those that support building reuse;Improvements to the federal rehabilitation tax credit;tax credits relating to neighborhood homes and downtown revitalization;One Big Beautiful Bill","Annual appropriations bills affecting historic preservation generally, including the Advisory Council on Historic Preservation and the Historic Preservation Fund and Department of the Interior budget request for FY25 and FY26, specifically.","General matters impacting the National Historic Preservation Act, including HPF reauthorization.","Build support for community development tax incentives, mainly which support building reuse; Improvements to the federal rehabilitation tax credit; tax credits relating to neighborhood homes and downtown revitalization; OBBBA HTC provisions","Oversee federal advocacy efforts for changes to and adoption of policies and procedures that support the preservation of historic and cultural resources.","General matters impacting National Historic Preservation Act, including HPF reauthorization and Section 106.","Build support for community development tax incentives, particularly those that support building reuse; Improvements to the federal rehabilitation tax credit; tax credits relating to neighborhood homes and downtown revitalization."],"firms":["NATIONAL TRUST FOR HISTORIC PRESERVATION"],"clients":["NATIONAL TRUST FOR HISTORIC PRESERVATION"],"filings":231,"issues":[]}