{"name":"SRINIVAS SONTI","slug":"srinivas-sonti","positions":["Temporary Professional Staff - United States Senate Committee on Foreign Relations\nSenior Policy Advisor-Senator Richard J. Durbin (D-IL)\nResearch Director-Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations Senior Policy Advisor-Senator Richard J. Durbin (D-IL) Research Director-Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations; Senior Policy Advisor-Senator Richard J. Durbin (D-IL); Research Director-Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations; Senior Policy Advisor - Senator Richard J. Durbin (D-IL); Research Director-Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations, Senior Policy Advisor-Senator Richard J. Durbin (D-IL), Research Director-Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations; Senior Policy Advisor-Senator Richard J. Durbin (DIL); Research Director-Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations; Senior Policy Advisor-Senator Richard J. Durbin (D-IL); Research Director-Senate Majority Leader Harry Reid (D-NV).","Temporary Professional Staff - United States Senate Committee on Foreign Relations; Senior Policy Advisor - Senator Richard J. Durbin (D-IL); Research Director - Senate Majority Leader Harry Reid (D-NV)","Temporary Professional Staff - United States Senate Committee on Foreign Relations; Senior Policy Advisor Senator Richard J. Durbin (D-IL); Research Director-Senate Majority Leader Harry Reid (D-NV)"],"firms":["LEWIS-BURKE ASSOCIATES, LLC"],"clients":["MICHELSON CENTER FOR PUBLIC POLICY","UNIVERSITY OF ILLINOIS","TEXAS TECH UNIVERSITY SYSTEM","AMERICAN SOCIETY OF HUMAN GENETICS","UNIVERSITY OF CINCINNATI","UNIVERSITY OF MINNESOTA","TULANE UNIVERSITY","RUNX1 FOUNDATION","UNIVERSITY OF ROCHESTER","LONG ISLAND UNIVERSITY","FRED HUTCHINSON CANCER CENTER FORMER \"FRED HUTCHISON CANCER RESEARCH CENTER\"","UNIVERSITY OF NEW HAMPSHIRE","ENTOMOLOGICAL SOCIETY OF AMERICA","PURDUE UNIVERSITY","HUMAN FACTORS AND ERGONOMICS SOCIETY","THE MICHAEL J. FOX FOUNDATION FOR PARKINSON'S RESEARCH","UNIVERSITY OF WISCONSIN-MADISON","DARTMOUTH COLLEGE"],"filings":307,"issues":[]}