{"name":"TED MCCANN","slug":"ted-mccann","positions":["Assistant to the Speaker of the House Staff Director, W&M Committee Budget Analyst, Budget Committee Legislative Assistant, Cong Paul Ryan Legislative Correspondent, Cong Paul Ryan Office Admin, Cong Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan\nSubcommittee Staff Director, W&M\nBudget Analyst, House Budget Committee\nLA, Rep Paul Ryan\nLC, Rep Paul Ryan\nOffice Administrator, Rep Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, W&M Budget Analyst, House Budget Committee LA, Rep Paul Ryan LC, Rep Paul Ryan Office Administrator, Rep Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, W&M Budget Analyst, House Budget Committee LA, Rep Paul Ryan LC, Rep Paul Ryan Office Administrator","Assistant to the Speaker of the House for Policy\nStaff Director, Ways and Means Committee\nBudget Analyst, House Budget Committee\nLegislative Assistant, Paul Ryan\nLegislative Correspondent, Paul Ryan\nOffice Administrator, Paul Ryan","Assistant to the Speaker of the US House Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Leg Assistant, Rep Paul Ryan Leg Correspondent, Rep Paul Ryan Office Administrator, Rep Paul Ryan","Assistant to the Speaker of the House Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Leg Asst, Rep Paul Ryan Leg Correspondent, Rep Paul Ryan Office Admin, Rep Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Staff Director, Ways and Means Budget Analyst, House Budget Committee Legislative Assistant, Rep. Paul Ryan Legislative Correspondent, Rep. Paul Ryan Office Administrator, Rep. Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Legislative Assistant, Rep. Paul Ryan Office Administrator, Rep. Paul Ryan","Assistant to the Speaker for Policy,Office of the Speaker Subcommittee Staff Director, Ways and Means Committee Budget Analyst, Budget Committee LA and LC, Rep Paul Ryan","Assistant to the Speaker for Policy, Office of the Speaker Subcommittee Staff Director, Ways and Means Committee Budget Analyst, Budget Committee LA and LC, Rep Paul Ryan","Assistant to the Speaker for Policy, Office of the Speaker Subcommittee Staff Director, Ways and Means Committee Budget Analyst, Budget Committee LA, LC, Office Administrator, Congressman Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Leg Asst; Leg Correspondent, Office Administrator, Rep Paul Ryan","Assistant to the Speaker for Policy Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Leg Asst, Leg Correspondent, Office Administrator, Rep Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Legislative Assistant, Legislative Correspondent, Office Administrator, Congressman Paul Ryan","Assistant to the Speaker for Policy Subcommittee Staff Director Ways and Means Budget Analyst Budget Committee LA, Congressman Paul Ryan LC Congressman Paul Ryan Office Administrator Congressman Paul Ryan","Asst to the Speaker for Policy Subcmmt Staff Director, Ways and Means Budget Analyst, House Budget Committee LA, LC, Office Administrator, Congressman Paul Ryan","Assistant to the Speaker for Policy Subcmmt Staff Director, Ways and Means Budget Analyst, House Budget Committee LA, LC, Office Administrator, Congressman Paul Ryan","Assistant to the Speaker for Policy; Subcommittee Staff Director, Ways and Means; Budget Analyst House Budget Committee; LA LC and Office Administrator Congressman Paul Ryan","Assistant to the Speaker for Policy; Subcommittee Staff Director Ways and Means; Budget Analyst House Budget Committee; LA, LC, Office Administrator Congressman Paul Ryan","Office of the Speaker, Asst to the Speaker for Policy Ways and Means, Subcommittee Staff Director Budget Committee, Budget Analyst Office of Cong. Paul Ryan: LA, LC, Office Administrator","Assistant to the Speaker for Policy, Speaker Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee Legislative Assistant, Legislative Correspondent, Office Administrator Congressman Paul Ryan","Assistant to the Speaker of the House, Speaker Paul Ryan Subcommittee Staff Director, House Ways and Means Budget Analyst, House Budget Committee Legislative Assistant, Legislative Correspondent, Office Administrator, Congressman Paul Ryan","Office of the Speaker, Asst to Speaker for Policy Ways and Means Committee, Subcommittee Staff Director Budget Committee, Budget Analyst Office of Congressman Paul Ryan: LA, LC, Office Administrator","Office of the Speaker of the House Subcommittee Staff Director, Ways and Means Committee Budget Analyst, Budget Committee LA, LC - Office of Congressman Paul Ryan","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, Budget Committee LA, LC, Congressman Paul Ryan's Office","Assistant to the Speaker for Policy, Speaker Paul Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, Budget Committee LA,LC Office of Congressman Paul Ryan","Assistant to the Speaker for Policy, Office of the Speaker Paul Ryan Subcommittee Staff Director, Ways and Means Committee Budget Analyst, House Budget Committee LA, LC Office of Congressman Paul Ryan"],"firms":["ARTICLE ONE GROUP, LLC"],"clients":["THE PHILANTHROPY ROUNDTABLE","AARP","GOODWILL EDUCATION INTIATIVES, INC","ACTION NOW INITIATIVE, LLC","FREEDOM FOUNDATION","YES, EVERY KID., INC.","OUSTER, INC.","STANDARD INDUSTRIES LTD.","JUUL LABS, INC","DO NO HARM","PINTEREST, INC","DATA FOUNDATION","ACTUM I, LLC"],"filings":171,"issues":[]}